Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: You now have a multiview app that shares a single [data model](glossary://data%20model) across multiple views. But the app doesn’t feel complete yet. Even though you can add or delete a `Creature` in the code, a [user](glossary://user) can’t add or delete creatures through the UI.
de: Du hast nun eine App mit mehreren Ansichten, die ein einzelnes [Datenmodell](glossary://data%20model) für mehrere Ansichten verwendet. Doch die App ist noch nicht ganz vollständig. Du kannst zwar mit `Creature` einen Charakter über den Code hinzufügen oder löschen, aber [Benutzer:innen](glossary://user) können das über die Benutzeroberfläche noch nicht.
es: Ahora tienes una app con varias vistas que comparte un único [modelo de datos](glossary://data%20model) en varias vistas. Pero la app aún no está completa. Aunque puedes añadir o eliminar una `Creature` (criatura) en el código, un [usuario](glossary://user) no puede añadir o eliminar criaturas a través de la IU.
es_419: Ahora tienes una app de varias visualizaciones que comparte un único [modelo de datos](glossary://data%20model) entre varias visualizaciones. Pero la app aún no está completa. Aunque tú puedes agregar y eliminar parámetros `Creature` en el código, el [usuario](glossary://user) no puede hacerlo mediante la interfaz.
fr: Tu disposes à présent d’une app à plusieurs vues qui partage un seul [modèle de données](glossary://data%20model) entre plusieurs vues. Mais l’app n’est pas encore terminée. Même si tu peux ajouter ou supprimer une `Creature` dans le code, un [utilisateur](glossary://user) ne peut pas ajouter ni supprimer de créatures au moyen de l’interface utilisateur.
it: Adesso hai un'app multi-vista che condivide un unico [modello di dati](glossary://data%20model) con più viste. Tuttavia l'app non è ancora completa. Anche se puoi inserire o eliminare `Creature` nel codice, l'[utente](glossary://user) non ha la possibilità di aggiungere o eliminare creature dall'interfaccia utente.
nl: Je hebt nu een app met meerdere weergaven die gebruikmaken van één gezamenlijk [gegevensmodel](glossary://data%20model). Maar de app is nog niet helemaal af. Je kunt al wel een `Creature` in de code toevoegen of verwijderen, maar een [gebruiker](glossary://user) kan nog geen wezens toevoegen of verwijderen via de gebruikersinterface.
no: Nå har du en app med flere visninger som deler på én [datamodell](glossary://data%20model) mellom flere visninger, men appen kjennes ikke helt fullstendig ut enda. Selv om du kan legge til eller slette en `Creature` i koden, kan ikke en [bruker](glossary://user) legge til eller slette skapninger via brukergrensesnittet.
pt: Agora você tem um app com várias visualizações que compartilha um único [modelo de dados](glossary://data%20model) por diversas visualizações. Mas o app ainda não parece completo. Embora você possa adicionar ou apagar uma `Creature` no código, um [usuário](glossary://user) não pode adicionar ou apagar criaturas pela IU.
sv: Nu har du en app med flera vyer som delar på en enda [datamodell](glossary://data%20model) mellan flera vyer, men appen känns inte helt fullständig än. Du kan visserligen lägga till eller radera en `Creature` i koden, men en [användare](glossary://user) kan inte lägga till eller radera varelser genom UI:t.
th: ตอนนี้คุณมีแอปแบบหลายมุมมองที่แชร์[โมเดลข้อมูล](glossary://data%20model)เดียวกันกับหลายมุมมอง แต่แอปก็ยังดูไม่สมบูรณ์ แม้ว่าคุณจะสามารถเพิ่มหรือลบ `Creature` ในโค้ดได้ แต่[ผู้ใช้](glossary://user)ไม่สามารถเพิ่มหรือลบสิ่งมีชีวิตผ่าน UI ได้
tr: Artık birden fazla görüntüde tek bir [veri modelini](glossary://data%20model) paylaşan bir çoklu görüntü uygulaman var. Ancak uygulama henüz tamamlanmış değil. Kodda bir `Creature` ekleyip silebiliyor olsan da, bir [kullanıcı](glossary://user) kullanıcı arayüzü yoluyla yaratık ekleyip silemez.
vi: Bây giờ, bạn có một ứng dụng nhiều chế độ xem chia sẻ một [mô hình dữ liệu](glossary://data%20model) đơn nhất trong nhiều chế độ xem. Tuy nhiên, ứng dụng dường như chưa hoàn chỉnh. Mặc dù bạn có thể thêm hoặc xóa một `Creature` trong mã, nhưng [người dùng](glossary://user) không thể thêm hoặc xóa các sinh vật thông qua UI.
zh_cn: 你现在有了一个多视图 App，而且它的多个视图共享单个[数据模型](glossary://data%20model)。但感觉 App 还没有彻底完成。即使你可以在代码中添加或删除 `Creature`，但[用户](glossary://user)无法通过 UI 来添加或删除动物。
zh_tw: 你現在擁有一個跨越多個顯示區共享單一[資料模型](glossary://data%20model)的多顯示區 App。但是 App 還沒有完成。即使你可以在程式碼中加入或刪除 `Creature`，[使用者](glossary://user)還是無法透過 UI 來加入或刪除生物。

source: Luckily, this is very straightforward to fix. Because you have access to the data model from your views, you can make changes to the data model when a person interacts with your UI. First, you’ll learn to delete a creature, then you’ll create a new view that allows people to add their own creatures.
de: Zum Glück lässt sich das Problem leicht lösen. Da du Zugriff auf das Datenmodell deiner Ansichten hast, kannst du Änderungen am Datenmodell vornehmen, wenn Benutzer:innen mit der Benutzeroberfläche interagieren. Als Erstes lernst du, wie man einen Charakter löscht, und danach erstellst du eine neue Ansicht, mit der Benutzer:innen eigene Charaktere hinzufügen können.
es: Por suerte, esto se puede solucionar de forma muy sencilla. Como tienes acceso al modelo de datos desde tus vistas, puedes hacer cambios al modelo de datos cuando una persona interactúa con tu IU. Primero, aprenderás a eliminar una criatura, y luego crearás una nueva vista con la que otras personas podrán añadir sus propias criaturas.
es_419: Por suerte, esto es muy sencillo de solucionar. Debido a que tienes acceso al modelo de datos desde tus visualizaciones, puedes hacer cambios en el modelo de datos cuando una persona interactúa con tu interfaz. Primero, aprenderás a eliminar una criatura y luego crearás una visualización nueva que le permita a las personas agregar sus propias criaturas.
fr: Heureusement, la solution est très simple. Puisque tu as accès au modèle de données à partir de tes vues, tu peux y apporter des modifications lorsqu’une personne interagit avec ton interface utilisateur. Tu vas d’abord apprendre à supprimer une créature, puis tu créeras une nouvelle vue qui permettra aux utilisateurs d’ajouter leurs propres créatures.
it: Fortunatamente risolvere questo problema è molto semplice. Poiché hai accesso al modello di dati dalle tue viste, puoi modificarlo quando qualcuno interagisce con l'interfaccia utente. Prima di tutto, imparerai a eliminare una creatura, poi creerai una nuova vista che consente di aggiungere altre creature.
nl: Dit is gelukkig gemakkelijk te verhelpen. Omdat je vanuit je weergaven toegang hebt tot het gegevensmodel, kun je wijzigingen aanbrengen in dat gegevensmodel wanneer een gebruiker met de gebruikersinterface werkt. Eerst ga je leren hoe je een wezen verwijdert en vervolgens ga je een nieuwe weergave aanmaken waarmee gebruikers hun eigen wezens kunt toevoegen.
no: Dette er heldigvis veldig enkelt å fikse. Siden du har tilgang til datamodellen fra visningene dine, kan du gjøre endringer i datamodellen når en person samhandler med brukergrensesnittet. Først lærer du å slette en skapning, og deretter lager du en ny visning der personer kan legge til sine egne skapninger.
pt: Felizmente, isso é muito fácil de resolver. Como você tem acesso ao modelo de dados das visualizações, você pode fazer alterações ao modelo de dados quando uma pessoa interage com a IU. Primeiro, você aprenderá a apagar uma criatura, depois, você criará uma nova visualização que permitirá que as pessoas adicionem suas próprias criaturas.
sv: Som tur är kan du enkelt fixa det. Eftersom du har tillgång till datamodellen från dina vyer kan du göra ändringar i datamodellen när en person interagerar med UI:t. Först lär du dig att radera en varelse och sedan skapar du en ny vy där personer kan lägga till sina egna varelser.
th: โชคดีที่เรื่องนี้แก้ไขได้ง่ายมาก เนื่องจากคุณสามารถเข้าถึงโมเดลข้อมูลได้จากมุมมองของคุณ คุณสามารถแก้ไขโมเดลข้อมูลเมื่อมีคนโต้ตอบกับ UI ของคุณได้ ก่อนอื่นคุณจะได้เรียนรู้การลบสิ่งมีชีวิต จากนั้นคุณจะได้สร้างมุมมองใหม่ที่ช่วยให้ผู้คนสามารถเพิ่มสิ่งมีชีวิตของตัวเองได้
tr: Neyse ki, bunu düzeltmek oldukça basittir. Görüntülerindeki veri modeline erişimin olduğu için bir kişi senin kullanıcı arayüzünle etkileşim kurduğunda veri modelinde değişiklikler yapabilirsin. Öncelikle bir yaratığı silmeyi öğreneceksin, ardından kişilerin kendi yaratıklarını eklemesine izin veren yeni bir görüntü yaratacaksın.
vi: Thật may là vấn đề này rất dễ khắc phục. Vì bạn có quyền truy cập vào mô hình dữ liệu từ các chế độ xem nên bạn có thể thực hiện các thay đổi đối với mô hình dữ liệu khi một người tương tác với UI. Trước tiên, bạn sẽ học cách xóa một sinh vật, sau đó bạn sẽ tạo ra một chế độ xem mới cho phép mọi người thêm các sinh vật của riêng họ.
zh_cn: 还好这很容易解决。由于你可以从视图访问数据模型，因此能够在用户与 UI 交互时，对数据模型进行更改。首先，你将学习删除动物，然后再创建可让用户添加自己的动物的新视图。
zh_tw: 幸運的是，這很容易解決。由於你可以從顯示區取用資料模型，因此你能夠在使用者與 UI 互動時更改資料模型。首先，你將學習刪除一個生物，然後製作一個新的顯示區來讓使用者加入自己的新生物。

# GuideBook..Guide0..StepAdd and delete creatures..TaskdeleteACreature..title
source: Delete a Creature
de: Charakter löschen
es: Eliminar una criatura
es_419: Eliminar una criatura
fr: Supprimer une créature
it: Eliminare una creatura
nl: Een wezen verwijderen
no: Slett en skapning
pt: Apague uma Criatura
sv: Radera en varelse
th: ลบสิ่งมีชีวิต
tr: Yaratık Silme
vi: Xóa một sinh vật
zh_cn: 删除动物
zh_tw: 刪除生物

source: SwiftUI makes deleting data from a `List` very straightforward. You can delete a creature by adding an `.onDelete` modifier to the `ForEach` loop in `ContentView`.
de: Mit SwiftUI ist es ganz einfach, Daten aus einer `List` (Liste) zu löschen. Du kannst einen Charakter löschen, indem du den Modifikator `.onDelete` zur `ForEach`-Schleife in `ContentView` hinzufügst.
es: SwiftUI hace que borrar datos de una `List` (lista) resulte muy sencillo. Puedes borrar una criatura añadiendo un modificador `.onDelete` al bucle `ForEach` en la vista de contenido (`ContentView`).
es_419: SwiftUI permite eliminar datos de una lista (`List`) de forma fácil y rápida. Puedes eliminar una criatura con sólo agregar un modificador `.onDelete` al ciclo `ForEach` en la visualización `ContentView`.
fr: Avec SwiftUI, il est très simple de supprimer des données d’une `List`. Tu peux supprimer une créature en ajoutant un modificateur `.onDelete` à la boucle `ForEach` dans `ContentView`.
it: Con SwiftUI eliminare dati da `List` è molto intuitivo. Puoi eliminare una creatura aggiungendo il modificatore `.onDelete` al ciclo `ForEach` in `ContentView`.
nl: SwiftUI maakt het verwijderen van gegevens uit een `List` erg eenvoudig. Je kunt een `.onDelete`-modifier toevoegen aan de `ForEach`-lus in `ContentView` om een wezen te verwijderen.
no: SwiftUI gjør det veldig enkelt å slette data fra en `List`. Du kan slette en skapning ved å legge til en `.onDelete`-modifikator i `ForEach`-løkken i `ContentView`.
pt: A SwiftUI facilita muito o apagamento de dados de uma `List`. Para apagar uma criatura, adicione um modificador `.onDelete` ao loop `ForEach` em `ContentView`.
sv: SwiftUI gör det väldigt enkelt att radera data från en `List`. Du kan radera en varelse genom att lägga till en `.onDelete`-modifierare i `ForEach`-loopen i `ContentView`.
th: SwiftUI ทำให้การลบข้อมูลจาก `List` เป็นเรื่องที่ง่ายมาก คุณสามารถลบสิ่งมีชีวิตได้ง่ายๆ โดยเพิ่มปุ่มปรับค่า `.onDelete` ไปยัง `ForEach` loop ใน `ContentView`
tr: SwiftUI bir listeden (`List`) veri silmeyi oldukça basit hâle getirir. `ContentView`’daki `ForEach` döngüsüne bir `.onDelete` niteleyicisi ekleyerek bir yaratığı silebilirsiniz.
vi: SwiftUI làm cho việc xóa dữ liệu khỏi một `List` trở nên rất đơn giản. Bạn có thể xóa một sinh vật bằng cách thêm một trình sửa đổi `.onDelete` vào vòng lặp `ForEach` trong `ContentView`.
zh_cn: 在 SwiftUI 中可以很容易地从 `List` 删除数据。你可以在 `ContentView` 的 `ForEach` 循环中添加 `.onDelete`（删除中）修饰符来删除动物。
zh_tw: SwiftUI 能讓你直接從 `List` 中刪除資料。你可以透過在 `ContentView` 的 `ForEach` 迴圈中加入 `.onDelete` 修飾符來刪除生物。

source: Adding the `.onDelete` modifier allows you to run some custom code (an `action` [closure](glossary://closure) when a person decides to delete an item). Your closure’s code removes the current creature from your app’s observable [data model](glossary://data%20model).
de: Durch das Hinzufügen des Modifikators `.onDelete` kannst du eigenen Code ausführen (einen `action`-[Funktionsabschluss](glossary://closure), wenn sich Benutzer:innen entscheiden, ein Objekt zu löschen). Der Code des Funktionsabschlusses entfernt den aktuellen Charakter aus dem beobachtbaren [Datenmodell](glossary://data%20model) der App.
es: Añadir el modificador `.onDelete` te permite ejecutar un código personalizado (una [clausura](glossary://closure) de `action` (acción) cuando una persona decide eliminar un ítem). Tu código de clausura elimina la criatura actual del [modelo de datos](glossary://data%20model) observable de tu app.
es_419: Agregar el modificador `.onDelete` te permite ejecutar código personalizado (una [clausura](glossary://closure) de `action` cuando una persona decide eliminar un elemento). Tu código de clausura elimina la criatura actual del [modelo de datos](glossary://data%20model) observable de tu app.
fr: L’ajout du modificateur`.onDelete` te permet d’exécuter un code personnalisé (une [clôture](glossary://closure) `action` lorsqu’une personne décide de supprimer un élément). Ton code de clôture supprime la créature actuelle du [modèle de données](glossary://data%20model) observable de ton app.
it: Aggiungendo il modificatore `.onDelete` potrai eseguire del codice personalizzato (una [chiusura](glossary://closure) `action` quando qualcuno decide di eliminare un elemento). Il tuo codice di chiusura elimina la creatura corrente dal [modello di dati](glossary://data%20model) osservabile della tua app.
nl: Door de modifier `.onDelete` toe te voegen, kun je aangepaste code (een [closure](glossary://closure) voor een `action`) uitvoeren wanneer een gebruiker een onderdeel wil verwijderen). De code van de closure verwijdert het huidige wezen uit het observeerbare [gegevensmodel](glossary://data%20model) van je app.
no: Når du legger til modifikatoren `.onDelete`, kan du kjøre en tilpasset kode (en [closure-blokk](glossary://closure)-`action` når en person bestemmer seg for å slette et objekt). Closure-blokkens kode fjerner den aktuelle skapningen fra appens observerbare [datamodell](glossary://data%20model).
pt: A adição do modificador `.onDelete` permite que você execute um código personalizado (um [encerramento](glossary://closure) de `action` quando uma pessoa decide apagar um item). O código de encerramento remove a criatura atual do [modelo de dados](glossary://data%20model) observável do app.
sv: När du lägger till modifieraren `.onDelete` kan du köra en del anpassad kod (en [stängnings](glossary://closure)-`åtgärd` när en person beslutar sig för att radera ett objekt). Stängningskoden tar bort den aktuella varelsen från appens observerbara [datamodell](glossary://data%20model).
th: การเพิ่มปุ่มปรับค่า `.onDelete` ทำให้คุณสามารถรันโค้ดแบบกำหนดเอง ([การปิด](glossary://closure) `action` เมื่อมีคนตัดสินใจลบรายการ) บางโค้ดได้ โค้ดการปิดของคุณจะเอาสิ่งมีชีวิตปัจจุบันออกจาก[โมเดลข้อมูล](glossary://data%20model)ที่สังเกตเห็นได้ของแอปของคุณ
tr: `.onDelete` niteleyicisini eklemek bazı özel kodları çalıştırmana izin verir (kişi bir öğeyi silmeye karar verdiğinde `action` [kapaması](glossary://closure)). Kapama kodun, şu anki yaratığı uygulamanın gözlemlenebilir [veri modelinden](glossary://data%20model) siler.
vi: Thêm trình sửa đổi `.onDelete` cho phép bạn chạy một số mã tùy chỉnh (một [bao đóng](glossary://closure) `action` khi một người quyết định xóa một mục). Mã của bao đóng xóa sinh vật hiện tại khỏi [mô hình dữ liệu](glossary://data%20model) có thể quan sát của ứng dụng của bạn.
zh_cn: 添加 `.onDelete` 修饰符可让你运行一些自定代码（当用户决定删除项目时的 `action`（操作）[闭包](glossary://closure)）。你的闭包代码会从 App 的可观测[数据模型](glossary://data%20model)中移除当前动物。
zh_tw: 當使用者決定刪除項目時，加入 `.onDelete` 修飾符能讓你執行一些自訂程式碼（一個 `action` [閉包](glossary://closure)）。你的閉包程式碼會從 App 的可觀察[資料模型](glossary://data%20model)中刪除目前的生物。

source: Inside the `.onDelete` [closure](glossary://closure), you’ll remove the current creature by calling `remove(atOffsets:)` and passing in the value `indexSet` from the closure. This finds the corresponding creature in the `creatures` array based on the row of the list you choose to delete.
de: Entferne im [Funktionsabschluss](glossary://closure) von `.onDelete` den aktuellen Charakter, indem du `remove(atOffsets:)` aufrufst und den Wert `indexSet` aus dem Funktionsabschluss übergibst. Dadurch wird der entsprechende Charakter im Array `creatures` auf Grundlage der Listenzeile gesucht, die du löschen möchtest.
es: Dentro de la [clausura](glossary://closure) `.onDelete`, eliminarás la criatura actual llamando a `remove(atOffsets:)` y pasándole el valor `indexSet` de la clausura. Esto encuentra la criatura correspondiente en el vector `creatures` en función de la fila de la lista que elijas eliminar.
es_419: Dentro de la [clausura](glossary://closure) `.onDelete`, debes eliminar a la criatura actual llamando a `remove(atOffsets:)` y pasando el valor `indexSet` de la clausura. Esto buscará a la criatura correspondiente en el arreglo `creatures` según la fila de la lista que elijas eliminar.
fr: Dans la [clôture](glossary://closure) `.onDelete`, tu supprimeras la créature actuelle en appelant `remove(atOffsets:)` et en transmettant la valeur `indexSet` depuis la clôture. Cela trouve la créature correspondante dans le tableau `creatures` en fonction de la rangée de la liste que tu as choisi de supprimer.
it: All'interno della [chiusura](glossary://closure) `.onDelete`, rimuoverai la creatura attuale richiamando `remove(atOffsets:)` e trasmettendo il valore `indexSet` dalla chiusura. In questo modo, verrà trovata la creatura corrispondente nell'array `creatures` sulla base della riga dell'elenco che hai scelto di eliminare.
nl: Je verwijdert het huidige wezen door `remove(atOffsets:)` aan te roepen in de [closure](glossary://closure) `.onDelete` en de waarde `indexSet` uit de closure door te geven. Hiermee wordt het corresponderende wezen in de array `creatures` opgezocht op basis van de rij uit de lijst die je wilt verwijderen.
no: Inni `.onDelete`-[closure-blokken](glossary://closure) fjerner du den aktuelle skapningen ved å kalle `remove(atOffsets:)` og overføre verdien `indexSet` fra closure-blokken. Dette finner tilsvarende skapning i matrisen `creatures` basert på raden i listen som du velger å slette.
pt: Dentro do [encerramento](glossary://closure) `.onDelete`, você removerá a criatura atual. Para isso, chame `remove(atOffsets:)` e passe o valor `indexSet` do encerramento. Isso busca a criatura correspondente no vetor `creatures` com base na linha da lista que você escolheu apagar.
sv: Inuti `.onDelete`-[stängningen](glossary://closure) tar du bort den aktuella varelsen genom att anropa `remove(atOffsets:)` och överföra värdet `indexSet` från stängningen. Detta hittar motsvarande varelse i arrayen `creatures` baserat på raden i listan som du väljer att radera.
th: ภายใน[การปิด](glossary://closure) `.onDelete` คุณจะเอาสิ่งมีชีวิตปัจจุบันออกโดยเรียกใช้ `remove(atOffsets:)` และส่งผ่านค่า `indexSet` จากการปิด การทำเช่นนี้จะค้นหาสิ่งมีชีวิตที่สอดคล้องกันในอาร์เรย์ `creatures` โดยอิงจากแถวของรายการที่คุณเลือกที่จะลบ
tr: `.onDelete` [kapamasının](glossary://closure) içinde, `remove(atOffsets:)` fonksiyonunu çağırarak ve kapamadan `indexSet` değerini geçirerek şu anki yaratığı sileceksin. Bu, silmeyi seçtiğin liste satırına göre `creatures` dizisinde karşılık gelen yaratığı bulur.
vi: Bên trong [bao đóng](glossary://closure) `.onDelete`, bạn sẽ xóa sinh vật hiện tại bằng cách gọi `remove(atOffsets:)` và chuyển vào giá trị `indexSet` từ bao đóng. Việc này tìm thấy sinh vật tương ứng trong dãy `creatures` dựa trên hàng của danh sách mà bạn lựa chọn xóa.
zh_cn: 在 `.onDelete` [闭包](glossary://closure)中，你将调用 `remove(atOffsets:)`（移除偏移处的项）并传入闭包中的 `indexSet`（索引组）值来移除当前动物。这会根据你选择删除的列表行在 `creatures` 数组中找到对应的动物。
zh_tw: 在 `.onDelete` [閉包](glossary://closure)中，你將藉由呼叫 `remove(atOffsets:)` 並從閉包中傳入值 `indexSet` 來刪除目前的生物。這會根據你選擇刪除的列表橫列在 `creatures` 陣列中找到對應的生物。

source: Try adding this modifier below the `ForEach` loop and run your app. Does swiping to the left on a creature allow you to delete it?
de: Versuche, den Modifikator unter der `ForEach`-Schleife hinzuzufügen, und führe deine App aus. Kannst du einen Charakter löschen, indem du nach links streichst?
es: Prueba a añadir este modificador debajo del bucle `ForEach` y ejecuta tu app. Al deslizar una criatura hacia la izquierda, ¿te permite eliminarla?
es_419: Intenta agregar este modificador debajo de cada ciclo `ForEach` y ejecuta tu app. ¿Puedes eliminar una criatura tras deslizarla a la izquierda?
fr: Essaie d’ajouter ce modificateur sous la boucle `ForEach` et d’exécuter ton app. Est-ce que balayer une créature vers la gauche te permet de la supprimer ?
it: Prova ad aggiungere questo modificatore sotto il ciclo `ForEach` e a eseguire l'app. Se scorri verso sinistra quando tocchi una creatura, riesci a eliminarla?
nl: Voeg deze modifier toe onder de `ForEach`-lus en voer je app uit. Kun je een wezen verwijderen door naar links te vegen op het wezen?
no: Prøv å legge til denne modifikatoren nedenfor `ForEach`-løkken, og kjør appen. Kan du slette en skapning hvis du sveiper mot venstre på den?
pt: Tente adicionar este modificador abaixo do loop `ForEach` e execute o app. Será que passar o dedo para a esquerda sobre uma criatura permite que você a apague?
sv: Prova att lägga till den här modifieraren nedanför `ForEach`-loopen och köra appen. Kan du radera en varelse om du sveper åt vänster på den?
th: ลองเพิ่มปุ่มปรับค่านี้ใต้ `ForEach` loop แล้วรันแอปของคุณ การปัดไปทางซ้ายบนสิ่งมีชีวิตทำให้คุณลบสิ่งมีชีวิตนั้นได้หรือไม่
tr: Bu niteleyiciyi `ForEach` Döngüsünün altına eklemeyi dene ve uygulamanı çalıştır. Bir yaratıkta sola kaydırdığında onu silmene izin veriliyor mu?
vi: Thử thêm trình sửa đổi này bên dưới vòng lặp `ForEach` và chạy ứng dụng của bạn. Thao tác vuốt sang trái trên một sinh vật có cho phép bạn xóa sinh vật đó không?
zh_cn: 尝试在 `ForEach` 循环下方添加这个修饰符，然后运行 App。你可以通过向左轻扫动物来删除它吗？
zh_tw: 嘗試在 `ForEach` 迴圈下方加入此修飾符並執行你的 App。在生物上向左滑動是否能刪除它？

source: Add a `NavigationLink` to `CreatureEditor`
de: `NavigationLink` zu `CreatureEditor` hinzufügen
es: Añadir un enlace de navegación (`NavigationLink`) a `CreatureEditor`
es_419: Agregar un enlace `NavigationLink` a `CreatureEditor`
fr: Ajouter un `NavigationLink` à `CreatureEditor`
it: Aggiungere un `NavigationLink` a `CreatureEditor`
nl: Een `NavigationLink` aan `CreatureEditor` toevoegen
no: Legg til en `NavigationLink` i `CreatureEditor`
pt: Adicione um `NavigationLink` a `CreatureEditor`
sv: Lägg till en `NavigationLink` i `CreatureEditor`
th: เพิ่ม `NavigationLink` ไปยัง `CreatureEditor`
tr: `CreatureEditor`’a `NavigationLink` ekleme
vi: Thêm một `NavigationLink` vào `CreatureEditor`
zh_cn: 将 `NavigationLink` 添加到 `CreatureEditor`
zh_tw: 將一個 `NavigationLink` 加入 `CreatureEditor`
