Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page2..Paragraph11
source: Important: Always create your data outside of the view [body](glossary://body). Think of the `body` as a ❌ no-data-creation zone that’s only used to declare what your views look like. This is a core principle of creating apps, known as [data separation](glossary://data%20separation).
de: Hinweis: Erstelle deine Daten immer außerhalb des [Hauptteils](glossary://body) einer Ansicht. Betrachte den Hauptteil als eine ❌ Keine-Daten-erstellen-Zone, die nur festlegt, wie deine Ansicht aussieht. Das ist ein Kernprinzip beim Erstellen von Apps und wird als [Datentrennung](glossary://data%20separation) bezeichnet.
es: Importante: Crea siempre tus datos fuera de la vista del [cuerpo](glossary://body). Piensa en el cuerpo (`body`) como una zona prohibida para la creación de datos ❌ que se usa para declarar el aspecto de tus vistas. Este es un principio básico de la creación de aplicaciones conocido como [separación de datos](glossary://data%20separation).
es_419: Nota importante: crea siempre tus datos fuera del [cuerpo](glossary://body) de la visualización. Recuerda que `body` NO es para crear datos ❌, y que se usa solamente para declarar el aspecto de tus visualizaciones. Este es un principio fundamental de la creación de apps conocido como [separación de datos](glossary://data%20separation).
fr: Important : crée toujours tes données en dehors du [corps](glossary://body) de la vue. Considère le `body` comme une zone sans création de données ❌, qui n’est utilisé que pour déclarer l’apparence de tes vues. Il s’agit d’un principe fondamental de la création d’apps connu sous le nom de [séparation des données](glossary://data%20separation).
it: Importante: crea sempre i tuoi dati al di fuori del [corpo](glossary://body) della vista. Considera il corpo come una zona in cui ❌ non si creano dati e che deve essere utilizzata solamente per dichiarare l'aspetto delle tue viste. Questo è uno dei principi fondamentali della creazione delle app noto come [separazione dei dati](glossary://data%20separation).
nl: Belangrijk: maak je gegevens altijd buiten de [body](glossary://body) van de weergave aan. Je kunt de `body` zien als een gebied waar ❌ geen gegevens mogen worden aangemaakt. De body wordt alleen gebruikt om het uiterlijk van je weergaven te declareren. Dit is een kernprincipe voor het maken van apps dat [gegevensscheiding](glossary://data%20separation) wordt genoemd.
no: Viktig: Opprett alltid dataene utenfor visningens [visningsinnhold](glossary://body). Tenk på `body` som et område der ingen data opprettes ❌, og som bare brukes til å deklarere hvordan visningene ser ut. Dette er et kjerneprinsipp for å lage apper, som kalles [dataseparering](glossary://data%20separation).
pt: Importante: sempre crie os dados fora do [corpo](glossary://body) da visualização. Pense no `body` como uma zona ❌ sem criação de dados, usada apenas para declarar a aparência das visualizações. Este é um princípio fundamental da criação de apps, conhecido como [separação de dados](glossary://data%20separation).
sv: Viktigt: Skapa alltid dina data utanför vyns [body](glossary://body). Tänk på `body` som ett område där inga data skapas ❌ och som endast används till att deklarera hur vyerna ser ut. Det här är en kärnprincip för att skapa appar som kallas [dataseparering](glossary://data%20separation).
th: หมายเหตุสำคัญ: สร้างข้อมูลของคุณภายนอก[เนื้อหา](glossary://body)ของมุมมองเสมอ ให้คิดว่า `body` เป็นโซนที่ ❌ ห้ามสร้างข้อมูล และใช้เพื่อประกาศว่ามุมมองของคุณมีลักษณะอย่างไรเท่านั้น นี่เป็นหลักการสำคัญของการสร้างแอปที่เรียกว่า[การแยกข้อมูล](glossary://data%20separation)
tr: Önemli: Verilerini her zaman görüntü [gövdesinin](glossary://body) dışında yarat. Gövdeyi (`body`), yalnızca görüntülerinin nasıl görüneceğini bildirmek için kullanılan bir ❌ veri yaratılamaz bölgesi olarak düşün. Bu, uygulama yaratmanın [veri ayırma](glossary://data%20separation) olarak bilinen temel prensibidir.
vi: Quan trọng: Luôn tạo ra dữ liệu của bạn ở bên ngoài [phần thân](glossary://body) của chế độ xem. Hãy coi `body` là một ❌ vùng không tạo ra dữ liệu chỉ được sử dụng để khai báo hình thức của các chế độ xem. Đây là một nguyên tắc cốt lõi trong việc tạo ra các ứng dụng, được gọi là [tách dữ liệu](glossary://data%20separation).
zh_cn: 重要：始终在视图[主体](glossary://body)之外创建数据。将 `body`（主体）想象成一个 ❌ 不创建数据的区域，而是仅用于声明视图的外观。这是创建 App 的核心准则，称为[数据分离](glossary://data%20separation)。
zh_tw: 重要事項：你只能在顯示區的[主體](glossary://body)之外建立資料。`body` 不是用來建立資料的區域 ❌，它應該只用來宣告你的顯示區外觀。這是製作 App 的核心原則，稱為[資料分離](glossary://data%20separation)。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page3..Paragraph12
source: To allow SwiftUI to update your views automatically, you need to tell it which view [properties](glossary://property) it should manage and track for you.
de: Um SwiftUI die automatische Aktualisierung der Ansichten zu ermöglichen, musst du SwiftUI mitteilen, welche [Eigenschaften](glossary://property) der Ansichten verwaltet und verfolgt werden sollen.
es: Para permitir que SwiftUI actualice tus vistas automáticamente, tienes que indicarle cuáles son las [propiedades](glossary://property) de tu vista que debe gestionar y controlar por ti.
es_419: Para permitir que SwiftUI actualice tus visualizaciones de forma automática, tienes que indicarle cuáles son las [propiedades](glossary://property) de tus visualizaciones que debe administrar y supervisar por ti.
fr: Pour autoriser SwiftUI à mettre à jour tes vues automatiquement, tu dois lui indiquer quelles [propriétés](glossary://property) des vues il doit gérer et suivre.
it: Per consentire a SwiftUI di aggiornare automaticamente le tue viste, dovrai specificare quali delle loro [proprietà](glossary://property) devono essere gestite e monitorate.
nl: Om je weergaven automatisch te laten bijwerken door SwiftUI, moet je opgeven welke weergave-[eigenschappen](glossary://property) door SwiftUI moeten worden beheerd en bijgehouden.
no: Hvis du vil tillate at SwiftUI oppdaterer visningene automatisk, må du fortelle det hvilke av visningenes [egenskaper](glossary://property) det skal håndtere og spore for deg.
pt: Para permitir que a SwiftUI atualize as visualizações automaticamente, você precisa indicar quais [propriedades](glossary://property) da visualização ela deve gerenciar a rastrear.
sv: Om du vill låta SwiftUI uppdatera vyer automatiskt måste du säga åt den vilka av vyernas [egenskaper](glossary://property) den ska hantera och spåra åt dig.
th: ในการอนุญาตให้ SwiftUI อัปเดตมุมมองของคุณโดยอัตโนมัติ คุณต้องบอก SwiftUI ว่า[คุณสมบัติ](glossary://property)มุมมองคุณสมบัติใดที่ SwiftUI ควรจัดการและติดตามให้กับคุณ
tr: SwiftUI’ın görüntülerini otomatik olarak güncellemesine izin vermek için görüntü [özelliklerinden](glossary://property) hangilerini senin için yönetmesi ve izlemesi gerektiğini ona söylemen gerekir.
vi: Để cho phép SwiftUI tự động cập nhật các chế độ xem, bạn cần cho biết những [thuộc tính](glossary://property) nào của chế độ xem cần được quản lý và theo dõi cho bạn.
zh_cn: 若要允许 SwiftUI 自动更新你的视图，你需要告诉它应当管理和跟踪哪些视图[属性](glossary://property)。
zh_tw: 若要讓 SwiftUI 自動更新你的顯示區，你需要告訴它應該為你管理和追蹤哪些顯示區的[屬性](glossary://property)。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page3..Paragraph13
source: To do this, add a special syntax, called a [property wrapper](glossary://property%20wrapper), before your property definition. Adding the `@State` property wrapper before `isOn` turns it into a [state property](glossary://state%20property). SwiftUI manages the value and updates the affected parts of the view whenever its [state](glossary://state) changes.
de: Dafür fügst du eine spezielle Syntax vor der Definition der Eigenschaft ein, die als [Eigenschaftswrapper](glossary://property%20wrapper) bezeichnet wird. Wenn du den Eigenschaftswrapper `@State` vor `isOn` einfügst, wird `isOn` zu einer [Statuseigenschaft](glossary://state%20property). SwiftUI verwaltet den Wert und aktualisiert die beeinflussten Bestandteile der Ansicht, wenn sich ihr [Status](glossary://state) ändert.
es: Para ello, añade una sintaxis especial, llamada [contenedor de propiedades](glossary://property%20wrapper), antes de la definición de la propiedad. Añadir el contenedor de propiedades `@State` delante de `isOn` lo convierte en una [propiedad de estado](glossary://state%20property). SwiftUI gestiona el valor y actualiza las partes afectadas de la vista cada vez que cambia su [estado](glossary://state).
es_419: Para ello, agrega una sintaxis especial llamada [contenedor de propiedades](glossary://property%20wrapper) antes de la definición de tu propiedad. Al agregar el contenedor de propiedades `@State` antes de `isOn`, se convierte en una [propiedad de estado](glossary://state%20property). SwiftUI administra el valor y actualiza los elementos afectados de la visualización cada vez que su [estado](glossary://state) cambia.
fr: Pour ce faire, ajoute une syntaxe spéciale, appelée un [wrapper de propriété](glossary://property%20wrapper), devant la définition de ta propriété. L’ajout du wrapper de propriété `@State` avant la propriété `isOn` la transforme en une [propriété d’état](glossary://state%20property). SwiftUI gère la valeur et met à jour les éléments concernés de la vue dès que son [état](glossary://state) change.
it: Per farlo, aggiungi una sintassi speciale chiamata [wrapper di proprietà](glossary://property%20wrapper) prima della definizione della proprietà. Aggiungendo il wrapper di proprietà `@State` prima di `isOn`, quest'ultima viene trasformata in una [proprietà di stato](glossary://state%20property). SwiftUI gestisce il valore e aggiorna le porzioni della vista interessate ogni volta che si verificano dei cambiamenti di [stato](glossary://state).
nl: Om dit te doen, moet je vóór de definitie van de eigenschap een speciale syntaxis toevoegen, een zogenaamde [eigenschapwrapper](glossary://property%20wrapper). Door de eigenschapwrapper `@State` vóór `isOn` toe te voegen, verandert `isOn` in een [statuseigenschap](glossary://state%20property). SwiftUI beheert de waarde en werkt de betreffende delen van de weergave bij wanneer de [status](glossary://state) ervan verandert.
no: Du gjør dette ved å legge til en bestemt syntaks som kalles en [egenskapsinnpakning](glossary://property%20wrapper), foran egenskapsdefinisjonen. Når du legger til egenskapsinnpakningen `@State` før `isOn`, endres den til en [statusegenskap](glossary://state%20property). SwiftUI håndterer verdien og oppdaterer visningene som påvirkes når [statusen](glossary://state) endres.
pt: Para fazer isso, adicione uma sintaxe especial chamada [empacotador de propriedades](glossary://property%20wrapper) antes da definição da propriedade. A adição do empacotador de propriedade `@State` antes de `isOn` o transforma em uma [propriedade de estado](glossary://state%20property). A SwiftUI gerencia o valor e atualiza as partes afetadas da visualização sempre que o seu [estado](glossary://state) muda.
sv: Du gör det genom att lägga till en särskild syntax som kallas en [egenskapspaketerare](glossary://property%20wrapper) framför egenskapsdefinitionen. När du lägger till egenskapspaketeraren `@State` före `isOn` förvandlas den till en [statusegenskap](glossary://state%20property). SwiftUI hanterar värdet och uppdaterar de vyer som påverkas när dess [status](glossary://state) ändras.
th: ในการทำเช่นนี้ ให้เพิ่มไวยากรณ์พิเศษที่เรียกว่า[ตัวหุ้มคุณสมบัติ](glossary://property%20wrapper)ด้านหน้าคำจำกัดความคุณสมบัติของคุณ การเพิ่มตัวหุ้มคุณสมบัติ `@State` ก่อน `isOn` จะทำให้กลายเป็น[คุณสมบัติสถานะ](glossary://state%20property) SwiftUI จะจัดการค่าและอัปเดตส่วนที่ได้รับผลกระทบของมุมมองทุกครั้งที่[สถานะ](glossary://state)ของมุมมองเปลี่ยนแปลงไป
tr: Bunu yapmak için özellik tanımından önce [özellik sarmalayıcı](glossary://property%20wrapper) adı verilen özel bir söz dizimi ekle. `isOn`'dan önce `@State` özellik sarmalayıcısını eklemek, onu bir [durum özelliğine](glossary://state%20property) dönüştürür. SwiftUI bu değeri yönetir ve [durumu](glossary://state) her değiştiğinde görüntünün etkilenen bölümlerini günceller.
vi: Để thực hiện việc này, hãy thêm một cú pháp đặc biệt, được gọi là một [trình đóng gói thuộc tính](glossary://property%20wrapper), vào phía trước định nghĩa thuộc tính của bạn. Việc thêm trình đóng gói thuộc tính `@State` vào phía trước `isOn` sẽ chuyển đổi thuộc tính thành [thuộc tính trạng thái](glossary://state%20property). SwiftUI quản lý giá trị và cập nhật các phần bị ảnh hưởng của chế độ xem bất kỳ lúc nào [trạng thái](glossary://state) thay đổi.
zh_cn: 若要实现这个操作，在属性定义前添加一个叫做[属性包装器](glossary://property%20wrapper)的特殊语法。在 `isOn` 前面添加 `@State`（状态）属性包装器可将它变为[状态属性](glossary://state%20property)。SwiftUI 管理这个值并在视图[状态](glossary://state)更改时更新视图受影响的部分。
zh_tw: 為此，請在屬性定義前加入一個稱為[屬性包覆](glossary://property%20wrapper)的特殊語法。在 `isOn` 前面加入 `@State` 屬性包覆會將其變成[狀態屬性](glossary://state%20property)。SwiftUI 會管理這個值並在其[狀態](glossary://state)更改時更新顯示區受影響的部分。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page4..Paragraph14
source: So how can you change the [state](glossary://state) of `isOn`? One common way is through [user interaction](glossary://user%20interaction), such as when a person taps a `Button`.
de: Wie kannst du nun den [Status](glossary://state) von `isOn` ändern? Eine häufig genutzte Methode ist mit einer [Benutzerinteraktion](glossary://user%20interaction), z. B. wenn Benutzer:innen auf eine mit `Button` erstellte Taste tippen.
es: Entonces, ¿cómo se puede cambiar el [estado](glossary://state) de `isOn`? Una forma habitual es mediante la [interacción del usuario](glossary://user%20interaction), como cuando una persona toca un botón (`Button`).
es_419: Entonces, ¿cómo puedes cambiar el [estado](glossary://state) de `isOn`? Una forma habitual de hacerlo es mediante la [interacción del usuario](glossary://user%20interaction), por ejemplo, cuando se toca un botón.
fr: Comment peux-tu changer l’[état](glossary://state) de `isOn` ? L’un des moyens les plus courants est l’[interaction utilisateur](glossary://user%20interaction), par exemple lorsqu’une personne touche un `Button`.
it: Quindi come si fa a cambiare lo [stato](glossary://state) della proprietà `isOn`? Uno dei modi più comuni è di farlo attraverso l'[interazione dell'utente](glossary://user%20interaction), ad esempio, quando una persona tocca un `Button`.
nl: Dus hoe kun je de [status](glossary://state) van `isOn` wijzigen? [Gebruikersinteractie](glossary://user%20interaction) is een veelgebruikte manier, bijvoorbeeld wanneer een gebruiker op een `Button` tikt.
no: Så hvordan endrer du [statusen](glossary://state) for `isOn`? En vanlig måte er gjennom [brukerinteraksjon](glossary://user%20interaction), for eksempel når en person trykker på en `Button`.
pt: Então, como seria possível alterar o [estado](glossary://state) de `isOn`? Uma maneira comum é através da [interação do usuário](glossary://user%20interaction), como quando uma pessoa toca em um `Button`.
sv: Så hur ändrar du [statusen](glossary://state) för `isOn`? Ett vanligt sätt är genom [användarinteraktion](glossary://user%20interaction), till exempel när en person trycker på en `Button`.
th: แล้วคุณจะเปลี่ยน[สถานะ](glossary://state)ของ `isOn` ได้อย่างไรกันล่ะ วิธีหนึ่งที่ใช้บ่อยคือผ่าน[การโต้ตอบของผู้ใช้](glossary://user%20interaction) เช่น เมื่อมีคนแตะ `Button`
tr: Peki, `isOn`'un [durumunu](glossary://state) nasıl değiştirebilirsin? Yaygın bir yol, kişinin bir düğmeye (`Button`) dokunmasında olduğu gibi [kullanıcı etkileşimi](glossary://user%20interaction) aracılığıyladır.
vi: Vậy làm cách nào bạn có thể thay đổi [trạng thái](glossary://state) của `isOn`? Một cách phổ biến là thông qua [tương tác của người dùng](glossary://user%20interaction), ví dụ như khi một người chạm vào một `Button`.
zh_cn: 那么你能如何更改 `isOn` 的[状态](glossary://state)呢？普遍的做法是通过[用户交互](glossary://user%20interaction)来进行，如用户轻点 `Button`（按钮）。
zh_tw: 那麼你要如何改變 `isOn` 的[狀態](glossary://state)呢？一種常見的方式是透過[使用者互動](glossary://user%20interaction)，例如使用者點按了 `Button`。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page4..Paragraph15
source: To create a `Button`, pass in a text [label](glossary://label), like “Press Me”, and an action [closure](glossary://closure), a block of code that runs when you tap the button.
de: Um mit `Button` eine Taste zu erstellen, übergib eine Text[beschriftung](glossary://label), wie „Drücke mich“, und einen [Funktionsabschluss](glossary://closure) für die Aktion – ein Codeblock, der ausgeführt wird, wenn du die Taste drückst.
es: Para crear un botón (`Button`), pasa una [etiqueta](glossary://label) de texto (como “Púlsame”) y una acción de [clausura](glossary://closure), un bloque de código que se ejecuta al tocar el botón.
es_419: Para crear un botón `Button`, pasa una [etiqueta](glossary://label) de texto, como “Presióname”, y una acción del tipo [clausura](glossary://closure), que es un bloque de código que se ejecuta cuando tocas el botón.
fr: Pour créer un `Button`, transmets une [étiquette](glossary://label) de texte, comme « Appuie-moi dessus », et une [clôture](glossary://closure) d’action, un bloc de code qui s’exécute quand tu touches le bouton.
it: Per creare un `Button`, trasmetti un'[etichetta](glossary://label) di testo come “Premi” e un'azione [chiusura](glossary://closure), ossia una porzione di codice da eseguire quando tocchi il pulsante.
nl: Om een `Button` aan te maken, geef je een tekst[label](glossary://label) door, zoals “Tik hier”, en een [closure](glossary://closure) voor een actie. Dit is een blok code dat wordt uitgevoerd wanneer je op de knop tikt.
no: For å lage en `Button` overfører du en tekst[etikett](glossary://label), for eksempel «Trykk på meg», og en handlings-[closure-blokk](glossary://closure), som er en kodeblokk som kjøres når du trykker på knappen.
pt: Para criar um `Button`, passe uma [etiqueta](glossary://label) de texto, como “Pressione‑me”, e um [encerramento](glossary://closure) de ação, um bloco de código que é executado quando você toca no botão.
sv: För att skapa en `Button` överför du en text[etikett](glossary://label), exempelvis ”Tryck på mig”, och en åtgärds[stängning](glossary://closure) som är ett kodblock som körs när du trycker på knappen.
th: ในการสร้าง `Button` ให้ส่งผ่าน[ป้าย](glossary://label)ข้อความ เช่น “กดที่ฉันสิ” และ[การปิด](glossary://closure)การทำงาน ซึ่งเป็นบล็อกของโค้ดที่จะรันเมื่อคุณแตะปุ่ม
tr: Bir düğme (`Button`) yaratmak için “Bas” gibi bir metin [etiketi](glossary://label) ve düğmeye dokunduğunda çalışan bir kod öbeği olan bir eylem [kapaması](glossary://closure) geçir.
vi: Để tạo ra một `Button`, hãy chuyển vào một [nhãn](glossary://label) văn bản, ví dụ như “Nhấn vào tôi” và một [bao đóng](glossary://closure) hành động, là một khối mã sẽ chạy khi bạn chạm vào nút.
zh_cn: 创建一个 `Button`，传入文本[标签](glossary://label)（如“按下我”），再创建一个操作[闭包](glossary://closure)，这是在你轻点按钮时运行的代码块。
zh_tw: 若要建立 `Button`，請傳入文字[標籤](glossary://label)（例如「按一下我」）、一個動作[閉包](glossary://closure)以及當你點按按鈕要執行的程式碼區塊。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page5..Paragraph16
source: When a person taps the button, the action [closure](glossary://closure) changes the value of `isOn` using the `toggle()` method.
de: Wenn auf die Taste getippt wird, wird der [Funktionsabschluss](glossary://closure) der Aktion mit der `toggle()`-Methode auf `isOn` gesetzt.
es: Cuando una persona toca el botón, la acción de [clausura](glossary://closure) cambia el valor de `isOn` usando el método `toggle()`.
es_419: Cuando alguien toca el botón, la acción [clausura](glossary://closure) cambia el valor de `isOn` mediante el método `toggle()`.
fr: Quand quelqu’un touche le bouton, la [clôture](glossary://closure) d’action change la valeur de `isOn` à l’aide de la méthode `toggle()`.
it: Quando una persona tocca il pulsante, l'azione [chiusura](glossary://closure) cambia il valore di `isOn` utilizzando il metodo `toggle()`.
nl: Als een gebruiker op de knop tikt, wijzigt de [closure](glossary://closure) van de actie de waarde van `isOn` met de methode `toggle()`.
no: Når en person trykker på knappen, endrer handlingen [closure-blokk](glossary://closure) verdien for `isOn` ved å bruke metoden `toggle()`.
pt: Quando uma pessoa toca no botão, o [encerramento](glossary://closure) da ação altera o valor de `isOn` com o método `toggle()`.
sv: När en person trycker på knappen ändrar åtgärden [stängning](glossary://closure) värdet för `isOn` genom att använda metoden `toggle()`.
th: เมื่อมีคนแตะปุ่ม [การปิด](glossary://closure)การทำงานจะเปลี่ยนค่าของ `isOn` โดยใช้วิธีการ `toggle()`
tr: Bir kişi düğmeye dokunduğunda eylem [kapaması](glossary://closure), `toggle()` metodunu kullanarak `isOn` değerini değiştirir.
vi: Khi một người chạm vào nút, [bao đóng](glossary://closure) hành động thay đổi giá trị của `isOn` bằng phương thức `toggle()`.
zh_cn: 用户轻点按钮时，操作[闭包](glossary://closure)会使用 `toggle()`（开关）方法更改 `isOn` 的值。
zh_tw: 當使用者點一下按鈕時，[閉包](glossary://closure)這個動作會使用 `toggle()` 方法更改 `isOn` 的值。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page5..Paragraph17
source: `toggle()` changes the value to `true` if it’s `false`, and to `false` if it’s `true`, sort of like turning a light switch on or off.
de: `toggle()` ändert den Wert in `true`, wenn er `false` ist, und in `false`, wenn er `true` ist – wie beim Ein- oder Ausschalten des Lichtschalters.
es: `toggle()` cambia el valor a `true` si es `false` y a `false` si es `true`, algo así como encender o apagar un interruptor de la luz.
es_419: El método `toggle()` cambia el valor a `true` si el valor actual era `false`, o lo cambia a `false` si el valor actual era `true`; un poco como prender o apagar un foco.
fr: `toggle()` remplace la valeur par `true` si elle est `false`, et par `false` si elle est `true`, comme lorsque tu allumes ou éteins la lumière.
it: `toggle()` modifica il valore `false` su `true` e `true` su `false`, un po' come un interruttore che accende e spegne la luce.
nl: `toggle()` verandert de waarde in `true` als deze `false` is, en in `false` als deze `true` is, vergelijkbaar met het aan- en uitdoen van een lamp.
no: `toggle()` endrer verdien til `true` hvis den er `false` og til `false` hvis den er `true`, omtrent som når du slår av eller på en lysbryter.
pt: `toggle()` altera o valor para `true` se for `false`, e para `false` se for `true`, como quando você liga ou desliga um interruptor de luz.
sv: `toggle()` ändrar värdet till `true` om det är `false` och till `false` om det är `true`, ungefär som när du tänder eller släcker en lampa.
th: `toggle()` จะเปลี่ยนค่าเป็น `true` หากค่าเป็น `false` และเปลี่ยนเป็น `false` หากค่าเป็น `true` คล้ายกับการเปิดหรือปิดสวิตช์ไฟ
tr: `toggle()`, değer `false` ise onu `true` olarak, `true` ise `false` olarak değiştirir (bir elektrik düğmesini açıp kapatmak gibi).
vi: `toggle()` thay đổi giá trị thành `true` nếu là `false` và thành `false` nếu là `true`, giống như việc bật hoặc tắt công tắc đèn.
zh_cn: `toggle()` 会在值为 `false` 时将它更改为 `true`，为 `true` 时更改为 `false`，就像按灯按钮控制开关一样。
zh_tw: `toggle()` 如果為 `false` 則會將值更改為 `true`，如果為 `true` 則會更改為 `false`，就像開燈或關燈一樣。
