Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Think of and create an entirely new project using SwiftUI. Implement your own `NavigationStack` to move between views, use [state properties](glossary://state%20property) to change the appearance of views locally, built-in SwiftUI views and [bindings](glossary://binding) to enable user interactions, and an [observable object](glossary://observable%20object) passed into the app environment to share data across multiple views. If you get stuck, come back to this project and look at code examples to fix any bugs you run into. Good luck, you can do this!
de: Überlege dir ein komplett neues Projekt und erstelle es mithilfe von SwiftUI. Implementiere eine eigene Instanz von `NavigationStack`, um zwischen den Ansichten zu navigieren, und verwende [Statuseigenschaften](glossary://state%20property), um das Erscheinungsbild von Ansichten lokal zu ändern, integrierte SwiftUI-Ansichten und [Bindungen](glossary://binding), um Benutzerinteraktionen zu ermöglichen, und ein [beobachtbares Objekt](glossary://observable%20object), das in die App-Umgebung übergeben wird, um Daten ansichtübergreifend zu teilen. Wenn du nicht weiter weißt, kannst du jederzeit zu diesem Projekt zurückkehren und dir die Codebeispiele anschauen, um die Probleme zu lösen, denen du eventuell begegnest. Viel Glück!
es: Piensa y crea un proyecto completamente nuevo con SwiftUI. Implementa tu propia pila de navegación (`NavigationStack`)para pasar de una vista a otra, usa [propiedades de estado](glossary://state%20property) para cambiar la apariencia de las vistas localmente, las vistas integradas de SwiftUI y las [vinculaciones](glossary://binding) para permitir las interacciones de los usuarios y un [objeto observable](glossary://observable%20object) pasado al entorno de la app environment para compartir datos entre varias vistas. Si te quedas atascado, vuelve a este proyecto y mira los ejemplos de código para solucionar cualquier error que encuentres. Buena suerte, ¡tú puedes hacerlo!
es_419: Piensa y crea un proyecto completamente nuevo usando SwiftUI. Implementa tu propia visualización `NavigationStack` para moverte entre las visualizaciones, usa [propiedades de estado](glossary://state%20property) para cambiar el aspecto de las visualizaciones localmente, usa visualizaciones integradas y [ligaduras](glossary://binding) de SwiftUI para permitir la interacción del usuario, y pasa un [objeto observable](glossary://observable%20object) al entorno de la app para compartir datos entre varias visualizaciones. Si tienes problemas, regresa a este proyecto y consulta los ejemplos de código para solucionar cualquier error que encuentres. ¡Buena suerte! ¡Tú puedes!
fr: Imagine et crée un projet entièrement nouveau avec SwiftUI. Implémente ta propre `NavigationStack` pour passer d’une vue à l’autre, utilise des [propriétés d’état](glossary://state%20property) pour changer l’apparence des vues localement, des vues SwiftUI intégrées et des [associations](glossary://binding) pour autoriser les interactions utilisateur, et un [objet observable](glossary://observable%20object) transmis dans l’environnement de l’app pour partager des données entre plusieurs vues. Si tu es bloqué, reviens à ce projet et regarde les exemples de code pour corriger tout bogue rencontré. Bonne chance, tu peux y arriver !
it: Pensa a un progetto completamente nuovo utilizzando SwiftUI e poi realizzalo. Implementa la tua `NavigationStack` per spostarti tra una vista e l'altra, utilizza [le proprietà di stato](glossary://state%20property) per cambiare l'aspetto delle viste localmente, così come le viste integrate in SwiftUI e i [vincoli](glossary://binding) per abilitare le interazioni con l'utente e un [oggetto osservabile](glossary://observable%20object) trasmesso all'ambiente dell'app per condividere dati in più viste. Se ti blocchi, puoi sempre rivedere questo progetto e consultare gli esempi di codice che ti saranno utili per risolvere i problemi che si potrebbero verificare. Tutto questo per te non sarà sicuramente un problema. In bocca al lupo!
nl: Bedenk en maak een volledig nieuw project met behulp van SwiftUI. Implementeer je eigen `NavigationStack` om van de ene naar de andere weergave te gaan, gebruik [statuseigenschappen](glossary://state%20property) om het uiterlijk van weergaven lokaal te wijzigen, ingebouwde SwiftUI-weergaven en [bindingen](glossary://binding) om gebruikersinteractie mogelijk te maken en een [observeerbaar object](glossary://observable%20object) dat aan de appomgeving wordt doorgegeven om gegevens tussen meerdere weergaven te delen. Als je vast komt te zitten, kun je teruggaan naar dit project en de codevoorbeelden bekijken om de bugs te verhelpen die je tegenkomt. Veel succes! Je kunt het!
no: Finn på og opprett et helt nytt prosjekt med SwiftUI. Implementer en egen `NavigationStack`som flytter mellom visninger, bruk [statusegenskaper](glossary://state%20property) til å endre utseendet på visninger lokalt, innebygde SwiftUI-visninger og [bindinger](glossary://binding) til å aktivere brukerinteraksjoner og et [observerbart objekt](glossary://observable%20object) som overføres til appmiljøet for å dele data mellom flere visninger. Hvis du sitter fast, kan du komme tilbake til dette prosjektet og se på kodeeksempler som hjelper deg med å løse eventuelle bugger du møter på. Lykke til, du klarer det!
pt: Imagine e crie um projeto inteiramente novo usando SwiftUI. Implemente seu próprio `NavigationStack` para mover entre as visualizações, use [propriedades de estado](glossary://state%20property) para alterar a aparência das visualizações localmente, use visualizações integradas de SwiftUI e [vínculos](glossary://binding) para permitir interações do usuário e um [objeto observável](glossary://observable%20object) passado para dentro do ambiente do app para compartilhar dados entre diversas visualizações. Se não conseguir sair do lugar, volte para este projeto e observe os exemplos de código para corrigir qualquer bug que você encontrar. Boa sorte, você consegue!
sv: Hitta på och skapa ett helt nytt projekt med SwiftUI. Implementera en egen `NavigationStack` som flyttar mellan vyer, använd [statusegenskaper](glossary://state%20property) till att ändra utseendet på vyer, inbyggda SwiftUI vyer och [kopplingar](glossary://binding) till att aktivera användarinteraktioner och ett [observerbart objekt](glossary://observable%20object) som överförs till appmiljön för att dela data mellan flera vyer. Om du fastnar kan du komma tillbaka till det här projektet och titta på kodexempel som hjälper dig att fixa eventuella buggar som du stöter på. Lycka till, du klarar det!
th: คิดและสร้างโปรเจ็กต์ใหม่ทั้งหมดโดยใช้ SwiftUI ใช้งาน `NavigationStack` ของคุณเองเพื่อย้ายไปมาระหว่างมุมมอง, ใช้[คุณสมบัติสถานะ](glossary://state%20property)เพื่อเปลี่ยนรูปแบบของมุมมองภายใน, ใช้มุมมอง SwiftUI ในตัวและ[การรวม](glossary://binding)เพื่ออนุญาตการโต้ตอบของผู้ใช้, และใช้[วัตถุที่สังเกตเห็นได้](glossary://observable%20object)ที่ส่งผ่านไปยังสภาพแวดล้อมแอปเพื่อแชร์ข้อมูลกับหลายมุมมอง ถ้าคุณไปต่อไม่ได้ ให้กลับมาที่โปรเจ็กต์นี้แล้วดูตัวอย่างโค้ดเพื่อแก้บั๊กใดๆ ที่คุณพบ โชคดีนะ คุณทำได้อยู่แล้ว!
tr: Tamamen yeni bir proje düşün ve SwiftUI’ı kullanarak onu yarat. Görüntüler arasında dolaşmak için kendi `NavigationStack`’ini uygula, görüntülerin görünüşünü yerel olarak değiştirmek için [durum özelliklerini](glossary://state%20property), kullanıcı etkileşimlerini etkinleştirmek için yerleşik SwiftUI görüntülerini ve [bağlamalarını](glossary://binding), birden çok görüntü genelinde veri paylaşmak için uygulama ortamına geçirilen bir [gözlemlenebilir nesneyi](glossary://observable%20object) kullan. Sıkışırsan bu projeye geri dön ve karşılacağın hataları düzeltmek için kod örneklerine bak. İyi şanslar, başarabilirsin!
vi: Hãy suy nghĩ và tạo ra một dự án hoàn toàn mới bằng SwiftUI. Triển khai `NavigationStack` của riêng bạn để di chuyển giữa các chế độ xem, sử dụng các [thuộc tính trạng thái](glossary://state%20property) để thay đổi giao diện của các chế độ xem cục bộ, các chế độ xem SwiftUI tích hợp và các [ràng buộc](glossary://binding) để cho phép người dùng tương tác, cũng như một [đối tượng có thể quan sát](glossary://observable%20object) được chuyển vào trong môi trường ứng dụng để chia sẻ dữ liệu trên nhiều chế độ xem. Nếu bạn bị vướng mắc, hãy quay lại dự án này và xem các ví dụ về mã để sửa bất kỳ lỗi nào mà bạn gặp phải. Chúc may mắn. Bạn có thể làm được!
zh_cn: 思考并使用 SwiftUI 创建一个全新的项目。使用自己的 `NavigationStack` 在视图间移动、使用[状态属性](glossary://state%20property)在本地更改视图的外观、使用 SwiftUI 内建视图和[绑定](glossary://binding)以启用用户交互，以及使用传入到 App 环境的[可观测对象](glossary://observable%20object)在多个视图中共享数据。如果遇到困难，可以回到这个项目并观察代码示例来修复产生的程序错误。祝你好运，你一定可以做到！
zh_tw: 使用 SwiftUI 思考並創作一個全新的計畫案。實現自己的 `NavigationStack` 在顯示區之間移動，使用[狀態屬性](glossary://state%20property)更改局部顯示區的外觀，內建 SwiftUI 顯示區和[綁定](glossary://binding)，以啟用使用者互動，並將[可觀察的物件](glossary://observable%20object)傳入 App 環境來在多個顯示區之間共享資料。如果你遇到困難，請返回此計畫案並查看程式碼的範例來修正你遇到的任何錯誤。祝你好運，你一定可以做到的！

source: ForEach(data.creatures) { creature in CreatureRow(creature: creature) }
es_419: ForEach(data.creatures) { criatura en CreatureRow(creature: creature) }

source: dismiss()
fr: fermer()
