Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Next, give `CreatureEditor` a navigation title that describes the view’s purpose.
de: Versehe `CreatureEditor` als Nächstes mit einem Navigationstitel, der den Zweck der Ansicht beschreibt.
es: A continuación, asigna a `CreatureEditor` un título de navegación que describa el propósito de la vista.
es_419: Después, asígnale un título de navegación a `CreatureEditor` que describa el propósito de la visualización.
fr: Ensuite, attribue un titre de navigation à `CreatureEditor` qui décrit l’objectif de la vue.
it: Successivamente, assegna a `CreatureEditor` un titolo di navigazione che descrive lo scopo della vista.
nl: Geef vervolgens `CreatureEditor` een navigatietitel die het doel van de weergave beschrijft.
no: Deretter gir du `CreatureEditor` en navigeringstittel som beskriver visningens formål.
pt: Depois, dê um título de navegação a `CreatureEditor` que descreva o propósito da visualização.
sv: Härnäst ger du `CreatureEditor` en navigeringstitel som beskriver vyns syfte.
th: ถัดไป กำหนดชื่อการนำทางให้กับ `CreatureEditor` ที่อธิบายถึงจุดประสงค์ของมุมมอง
tr: Sonra, `CreatureEditor`’a görüntünün amacını açıklayan bir dolaşma başlığı ver.
vi: Tiếp theo, hãy đặt cho `CreatureEditor` một tiêu đề điều hướng mô tả mục đích của chế độ xem.
zh_cn: 下一步，给 `CreatureEditor` 添加描述视图目的的导航标题。
zh_tw: 接下來，為 `CreatureEditor` 指定一個導覽標題，說明顯示區的用途。

source: Add a navigation title to the `CreatureEditor` view.
de: Füge einen Navigationstitel zur Ansicht `CreatureEditor` hinzu.
es: Añade un título de navegación a la vista `CreatureEditor`.
es_419: Agrega un título de navegación a la visualización `CreatureEditor`.
fr: Ajoute un titre de navigation à la vue `CreatureEditor`.
it: Aggiungi un titolo di navigazione alla vista `CreatureEditor`.
nl: Voeg een navigatietitel toe aan de weergave `CreatureEditor`.
no: Legg til en navigeringstittel i visningen `CreatureEditor`.
pt: Adicione um título de navegação à visualização `CreatureEditor`.
sv: Lägg till en navigeringstitel i vyn `CreatureEditor`.
th: เพิ่มชื่อการนำทางไปยังมุมมอง `CreatureEditor`
tr: `CreatureEditor` görüntüsüne bir dolaşma başlığı ekle.
vi: Thêm một tiêu đề điều hướng vào chế độ xem `CreatureEditor`.
zh_cn: 将导航标题添加到 `CreatureEditor` 视图。
zh_tw: 將導覽標題加入 `CreatureEditor` 顯示區。

source: Run your app and test navigating to `CreatureEditor` from `ContentView`.
de: Führe deine App aus und versuche, von `ContentView` zu `CreatureEditor` zu navigieren.
es: Ejecuta tu app y prueba la navegación a `CreatureEditor` desde `ContentView`.
es_419: Ejecuta tu app e intenta ir a `CreatureEditor` desde `ContentView`.
fr: Exécute ton app et teste la navigation vers `CreatureEditor` depuis `ContentView`.
it: Esegui l'app e testa la navigazione da `ContentView` a `CreatureEditor`.
nl: Voer je app uit en test of je naar `CreatureEditor` kunt navigeren vanuit `ContentView`.
no: Kjør appen, og test navigeringen til `CreatureEditor` fra `ContentView`.
pt: Execute o app e teste a navegação para `CreatureEditor` a partir de `ContentView`.
sv: Kör appen och testa navigeringen till `CreatureEditor` från `ContentView`.
th: รันแอปของคุณแล้วทดสอบการนำทางไปยัง `CreatureEditor` จาก `ContentView`
tr: Uygulamanı çalıştır ve `ContentView`’dan `CreatureEditor`’a gitmeyi test et.
vi: Chạy ứng dụng của bạn và kiểm tra việc điều hướng đến `CreatureEditor` từ `ContentView`.
zh_cn: 运行 App，并测试从 `ContentView` 导航到 `CreatureEditor`。
zh_tw: 執行你的 App 並測試從 `ContentView` 導覽至 `CreatureEditor`。

source: .toolbar { ToolbarItem { NavigationLink("Add") { CreatureEditor() .navigationTitle("Add Creature") } } }
de: .toolbar { ToolbarItem { NavigationLink("Hinzufügen") { CreatureEditor() .navigationTitle("Charakter hinzufügen") } } }
es: .toolbar { ToolbarItem { NavigationLink("Añadir") { CreatureEditor() .navigationTitle("Añadir criatura") } } }
es_419: .toolbar { ToolbarItem { NavigationLink("Agregar") { CreatureEditor() .navigationTitle("Agregar criatura") } } }
fr: .toolbar { ToolbarItem { NavigationLink("Ajouter") { CreatureEditor() .navigationTitle("Ajouter une créature") } } }
it: .toolbar { ToolbarItem { NavigationLink("Aggiungi") { CreatureEditor() .navigationTitle("Aggiungi creatura") } } }
nl: .toolbar { ToolbarItem { NavigationLink("Voeg toe") { CreatureEditor() .navigationTitle("Add Creature") } } }
sv: .toolbar { ToolbarItem { NavigationLink("Lägg till") { CreatureEditor() .navigationTitle("Add Creature") } } }
th: .toolbar { ToolbarItem { NavigationLink("เพิ่ม") { CreatureEditor() .navigationTitle("เพิ่มสิ่งมีชีวิต") } } }
tr: .toolbar { ToolbarItem { NavigationLink("Ekle") { CreatureEditor() .navigationTitle("Yaratık Ekle") } } }
vi: .toolbar { ToolbarItem { NavigationLink("Thêm") { CreatureEditor() .navigationTitle("Thêm sinh vật") } } }
zh_cn: .toolbar { ToolbarItem { NavigationLink("添加") { CreatureEditor() .navigationTitle("添加动物") } } }

source: Define the `CreatureEditor` data
de: Die Daten für `CreatureEditor` definieren
es: Definir los datos de `CreatureEditor`
es_419: Definir los datos de `CreatureEditor`
fr: Définir les données `CreatureEditor`
it: Definire i dati di `CreatureEditor`
nl: De `CreatureEditor`-gegevens definiëren
no: Definer `CreatureEditor`-dataene
pt: Defina os dados de `CreatureEditor`
sv: Definiera `CreatureEditor`-data
th: กำหนดข้อมูล `CreatureEditor`
tr: `CreatureEditor` verilerini tanımlama
vi: Xác định dữ liệu `CreatureEditor`
zh_cn: 定义 `CreatureEditor` 数据
zh_tw: 定義 `CreatureEditor` 資料

source: To add a new creature, you’ll create a [composed view](glossary://composed%20view) `CreatureEditor` that allows you to edit a new creature and add it to your [data model](glossary://data%20model).
de: Zum Hinzufügen eines neuen Charakters erstellst du die [zusammengesetzte Ansicht](glossary://composed%20view) `CreatureEditor`, mit der du einen neuen Charakter bearbeiten und diesen zu deinem [Datenmodell](glossary://data%20model) hinzufügen kannst.
es: Para añadir una nueva criatura, crearás una [vista compuesta](glossary://composed%20view) `CreatureEditor` que te permita editar una nueva criatura y añadirla a tu [modelo de datos](glossary://data%20model).
es_419: Para agregar una criatura nueva, crearás una [visualización compuesta](glossary://composed%20view) `CreatureEditor` que te permita editar una criatura nueva y agregarla a tu [modelo de datos](glossary://data%20model).
fr: Pour ajouter une nouvelle créature, tu créeras une [vue composée](glossary://composed%20view) `CreatureEditor` qui te permettra de modifier une nouvelle créature et de l’ajouter à ton [modèle de données](glossary://data%20model).
it: Per aggiungere una nuova creatura, dovrai creare una [vista composta](glossary://composed%20view) `CreatureEditor` che ti consentirà di modificare la nuova creatura e di aggiungerla al tuo [modello di dati](glossary://data%20model).
nl: Om een nieuw wezen toe te voegen, maak je de [samengestelde weergave](glossary://composed%20view) `CreatureEditor` aan waarin je een nieuw wezen kunt bewerken en kunt toevoegen aan je [gegevensmodel](glossary://data%20model).
no: Når du vil legge til en ny skapning, oppretter du en [sammenstilt visning](glossary://composed%20view), `CreatureEditor`, der du kan redigere en ny skapning og legge den til i [datamodellen](glossary://data%20model) din.
pt: Para adicionar uma nova criatura, você criará um `CreatureEditor` de [visualização composta](glossary://composed%20view) que lhe permite editar uma criatura nova e adicioná-la ao [modelo de dados](glossary://data%20model).
sv: När du vill lägga till en ny varelse skapar du en [sammanställd vy](glossary://composed%20view), `CreatureEditor`, där du kan redigera en ny varelse och lägga till den i din [datamodell](glossary://data%20model).
th: ในการเพิ่มสิ่งมีชีวิตใหม่ คุณจะได้สร้าง `CreatureEditor` ของ[มุมมองที่ถูกประกอบ](glossary://composed%20view) ซึ่งจะทำให้คุณสามารถแก้ไขสิ่งมีชีวิตใหม่และเพิ่มไปยัง[โมเดลข้อมูล](glossary://data%20model)ของคุณได้
tr: Yeni bir yaratık eklemek amacıyla, yeni bir yaratığı düzenlemene ve [veri modeline](glossary://data%20model) eklemene izin veren [oluşturulmuş bir görüntü](glossary://composed%20view) (`CreatureEditor`) yaratacaksın.
vi: Để thêm một sinh vật mới, bạn sẽ tạo ra một [chế độ xem tổ hợp](glossary://composed%20view) `CreatureEditor` cho phép bạn sửa một sinh vật mới và thêm vào [mô hình dữ liệu](glossary://data%20model) của mình.
zh_cn: 若要添加新动物，你将创建一个 `CreatureEditor` [组合视图](glossary://composed%20view)，它可让你编辑新动物并将这个动物添加到[数据模型](glossary://data%20model)。
zh_tw: 為了加入新的生物，你將會製作一個[組合式顯示區](glossary://composed%20view) `CreatureEditor`，它可讓你編輯新的生物並將其加入你的[資料模型](glossary://data%20model)。

source: Take a moment to think through which [properties](glossary://property) you’ll need in `CreatureEditor` to create a new `Creature` instance and add it to your data model.
de: Überlege einen Moment, welche [Eigenschaften](glossary://property) du in `CreatureEditor` brauchst, um eine neue `Creature`-Instanz zu erstellen und diese zu deinem Datenmodell hinzuzufügen.
es: Piensa un poco en qué [propiedades](glossary://property) necesitarás en `CreatureEditor` para crear una nueva instancia de `Creature` y añadirla a tu modelo de datos.
es_419: Tómate un momento para pensar qué [propiedades](glossary://property) necesitarás en `CreatureEditor` para crear una nueva instancia de `Creature` y agregarla a tu modelo de datos.
fr: Prends un moment pour réfléchir aux [propriétés](glossary://property) dont tu auras besoin dans `CreatureEditor` pour créer une nouvelle instance de `Creature` et l’ajouter à ton modèle de données.
it: Prenditi un po' di tempo per pensare a quali [proprietà](glossary://property) ti serviranno in `CreatureEditor` per creare una nuova istanza `Creature` e aggiungerla al tuo modello di dati.
nl: Neem even de tijd om te bedenken welke [eigenschappen](glossary://property) je nodig hebt in `CreatureEditor` om een nieuwe instantie van `Creature` aan te maken en deze toe te voegen aan je gegevensmodel.
no: Ta deg tid til å tenke over hvilke [egenskaper](glossary://property) som er nødvendige i `CreatureEditor` for å kunne opprette en ny instans av `Creature` og legge den til i datamodellen.
pt: Reflita sobre quais [propriedades](glossary://property) você precisará em `CreatureEditor` para criar uma nova instância `Creature` e adicioná-la ao modelo de dados.
sv: Ägna ett ögonblick åt att fundera över vilka [egenskaper](glossary://property) som behövs i `CreatureEditor` för att du ska kunna skapa en ny instans av `Creature` och lägga till den i datamodellen.
th: ใช้เวลาสักครู่เพื่อคิดทบทวนว่าคุณจะต้องใช้[คุณสมบัติ](glossary://property)ใดใน `CreatureEditor` เพื่อสร้างชื่อแทนประเภท `Creature` ใหม่และเพิ่มไปยังโมเดลข้อมูลของคุณ
tr: Biraz dur ve yeni bir `Creature` örneği yaratıp bunu veri modeline eklemek için `CreatureEditor`’da hangi [özelliklere](glossary://property) ihtiyacın olacağını düşün.
vi: Hãy dành thời gian để suy nghĩ xem bạn sẽ cần những [thuộc tính](glossary://property) nào trong `CreatureEditor` để tạo ra một thể hiện `Creature` mới và thêm vào mô hình dữ liệu của mình.
zh_cn: 花点时间思考一下，你需要在 `CreatureEditor` 中使用哪些[属性](glossary://property)来创建新的 `Creature` 实例，并将它添加到你的数据模型。
zh_tw: 花點時間思考一下你需要在 `CreatureEditor` 中使用哪些[屬性](glossary://property)來建立一個新的 `Creature` 實例，並將其加入你的資料模型中。

source: You’ll need a `Creature` property that you can modify within the [local](glossary://local%20scope) `CreatureEditor` view.
de: Du brauchst die Eigenschaft `Creature`, die du in der [lokalen](glossary://local%20scope) `CreatureEditor`-Ansicht ändern kannst.
es: Necesitarás una propiedad `Creature` que puedas modificar dentro de la vista [local](glossary://local%20scope) `CreatureEditor`.
es_419: Necesitarás una propiedad `Creature` que puedas modificar desde la visualización `CreatureEditor` [local](glossary://local%20scope).
fr: Tu auras besoin d’une propriété `Creature` que tu pourras modifier avec la vue `CreatureEditor` [locale](glossary://local%20scope).
it: Dovrai creare la proprietà `Creature` che potrai modificare all'interno della vista `CreatureEditor` [locale](glossary://local%20scope).
nl: Je hebt de eigenschap `Creature` nodig die je kunt wijzigen in de [lokale](glossary://local%20scope) weergave `CreatureEditor`.
no: Du trenger en `Creature`-egenskap som du kan endre inni den [lokale](glossary://local%20scope) `CreatureEditor`-visningen.
pt: Você vai precisar de uma propriedade `Creature` que você pode modificar dentro da visualização [local](glossary://local%20scope) do `CreatureEditor`.
sv: Du behöver en `Creature`-egenskap som du kan ändra inuti den [lokala](glossary://local%20scope) `CreatureEditor`-vyn.
th: คุณจะต้องมีคุณสมบัติ `Creature` ที่คุณสามารถแก้ไขภายในมุมมอง `CreatureEditor` [แบบภายใน](glossary://local%20scope)ได้
tr: [Yerel](glossary://local%20scope) `CreatureEditor` görüntüsünün içinde değiştirebileceğin bir `Creature` özelliğine ihtiyacın olacak.
vi: Bạn sẽ cần một thuộc tính `Creature` mà bạn có thể sửa đổi bên trong chế độ xem `CreatureEditor` [cục bộ](glossary://local%20scope).
zh_cn: 你需要一个可在[本地](glossary://local%20scope) `CreatureEditor` 视图中修改的 `Creature` 属性。
zh_tw: 你將需要一個可以在[區域](glossary://local%20scope) `CreatureEditor` 顯示區中修改的 `Creature` 屬性。

source: You’ll need access to your `CreatureZoo` [observable object](glossary://observable%20object) from the [environment](glossary://environment) so you can add your `Creature` instance to it.
de: Du brauchst Zugriff auf das [beobachtbare Objekt](glossary://observable%20object) von `CreatureZoo` aus der [Umgebung](glossary://environment), damit du die `Creature`-Instanz hinzufügen kannst.
es: Necesitarás acceder al [objeto observable](glossary://observable%20object) `CreatureZoo` desde el [entorno](glossary://environment) para poderle añadir tu instancia de `Creature`.
es_419: Necesitarás acceso a tu [objeto observable](glossary://observable%20object) `CreatureZoo` desde el [entorno](glossary://environment) para que puedas agregarle tu instancia de `Creature`.
fr: Il te faudra un accès à ton [objet observable](glossary://observable%20object) `CreatureZoo` depuis l’[environnement](glossary://environment) pour que tu puisses y ajouter ton instance de `Creature`.
it: Dovrai accedere all'[oggetto osservabile](glossary://observable%20object) `CreatureZoo` dall'[ambiente](glossary://environment) in modo da poterci aggiungere la tua istanza `Creature`.
nl: Je hebt toegang tot het [observeerbare object](glossary://observable%20object) `CreatureZoo` nodig vanuit de [omgeving](glossary://environment) zodat je er de instantie `Creature` aan toe kunt voegen.
no: Du må ha tilgang til det [observerbare objektet](glossary://observable%20object) `CreatureZoo` fra [miljøet](glossary://environment), slik at du kan legge til din instans av `Creature` i den.
pt: Você precisará acessar o [objeto observável](glossary://observable%20object) `CreatureZoo` a partir do [ambiente](glossary://environment) para que você possa adicionar a instância de `Creature` a ele.
sv: Du måste ha tillgång till det [observerbara objektet](glossary://observable%20object) `CreatureZoo` från [miljön](glossary://environment) så att du kan lägga till din instans av `Creature` i den.
th: คุณจะต้องเข้าถึง[วัตถุที่สังเกตเห็นได้](glossary://observable%20object)ของ `CreatureZoo` จาก[สภาพแวดล้อม](glossary://environment)เพื่อให้คุณสามารถเพิ่มชื่อแทนประเภท `Creature` ของคุณไปที่นั่นได้
tr: `Creature` örneğini ekleyebilmek için [ortamdan](glossary://environment) `CreatureZoo` [gözlemlenebilir nesnene](glossary://observable%20object) erişmen gerekecek.
vi: Bạn sẽ cần truy cập vào [đối tượng có thể quan sát](glossary://observable%20object) `CreatureZoo` từ [môi trường](glossary://environment) để bạn có thể thêm thể hiện `Creature` của mình vào đó.
zh_cn: 你需要从[环境](glossary://environment)中访问 `CreatureZoo` [可观测对象](glossary://observable%20object)，以便可以将 `Creature` 实例加入其中。
zh_tw: 你需要從[環境](glossary://environment)中取用你的 `CreatureZoo` [可觀察的物件](glossary://observable%20object)，以便將 `Creature` 實例加入其中。

source: Try creating two properties that accomplish these goals, using the following hints if you get stuck.
de: Versuche, zwei Eigenschaften zu erstellen, mit denen du das erreichen kannst. Wenn du nicht weiterkommst, kannst du diese Tipps verwenden.
es: Prueba a crear dos propiedades que cumplan estos objetivos, usando las siguientes pistas si te atascas.
es_419: Intenta crear dos propiedades que se encarguen de eso, y usa las siguientes pistas si tienes problemas.
fr: Essaie de créer deux propriétés qui accomplissent ces objectifs, en utilisant les astuces suivantes si tu es bloqué.
it: Prova a creare due proprietà che ti servono per raggiungere questi due obiettivi. Se non riesci ad andare avanti puoi utilizzare i suggerimenti di seguito.
nl: Probeer twee eigenschappen aan te maken waarmee je deze doelen bereikt. Gebruik de volgende tips als je vast komt te zitten.
no: Prøv å opprette to egenskaper som oppfyller disse målene, og bruk følgende hint hvis du sitter fast.
pt: Tente criar duas propriedades que atinjam essas metas. Use as dicas a seguir caso não consiga sair do lugar.
sv: Försök att skapa två egenskaper som åstadkommer de här sakerna och använd följande tips ifall du kör fast.
th: ลองสร้างคุณสมบัติสองรายการที่จะทำให้บรรลุเป้าหมายเหล่านี้โดยใช้คำใบ้ต่อไปนี้หากคุณไปต่อไม่ได้
tr: Bu hedefleri gerçekleştiren iki özellik yaratmayı dene; sıkışırsan aşağıdaki ipuçlarını kullan.
vi: Thử tạo ra hai thuộc tính đạt được những mục tiêu này, sử dụng các gợi ý sau đây nếu bạn vị vướng mắc.
zh_cn: 尝试创建两个可以实现这些目标的属性，遇到困难时可使用以下提示。
zh_tw: 嘗試建立兩個可以實現這些目標的屬性，如果遇到困難，請使用以下提示。

source: First, create a [state property](glossary://state%20property) that stores a `Creature` instance. You can leave its `name` and `emoji` parameters as empty strings for now.
de: Erstelle als Erstes eine [Statuseigenschaft](glossary://state%20property), die die `Creature`-Instanz speichert. Du kannst die Parameter `name` und `emoji` erst einmal leer lassen.
es: Primero, crea una [propiedad de estado](glossary://state%20property) que guarde una instancia de `Creature`. De momento, puedes dejar sus parámetros `name` y `emoji` como cadenas vacías.
es_419: Primero, crea una [propiedad de estado](glossary://state%20property) que almacene una instancia de `Creature`. Y, por ahora, deja sus parámetros `name` y `emoji` como strings vacíos.
fr: Tout d’abord, crée une [propriété d’état](glossary://state%20property) qui stocke une instance de `Creature`. Tu peux laisser ses paramètres `name` et `emoji` comme des chaînes vides pour le moment.
it: Per prima cosa, crea una [proprietà di stato](glossary://state%20property) che contenga un'istanza `Creature`. Per il momento puoi lasciare vuote le stringhe corrispondenti ai parametri `name` ed `emoji`.
nl: Maak om te beginnen een [statuseigenschap](glossary://state%20property) aan waarin een instantie van `Creature` kan worden bewaard. Je kunt de parameters `name` en `emoji` van de eigenschap voorlopig leeg laten.
no: Først oppretter du en [statusegenskap](glossary://state%20property) som lagrer en instans av `Creature`. Du kan la strengene for `name` og `emoji`-parametrene være tomme for øyeblikket.
pt: Primeiro, crie uma [propriedade de estado](glossary://state%20property) que armazene uma instância `Creature`. Você pode deixar os parâmetros `name` e `emoji` como strings vazias por enquanto.
sv: Först skapar du en [statusegenskap](glossary://state%20property) som lagrar en instans av `Creature`. Du kan låta strängarna för `name`- och `emoji`-parametrarna vara tomma just nu.
th: ก่อนอื่นให้สร้าง[คุณสมบัติสถานะ](glossary://state%20property)ที่จะจัดเก็บชื่อแทนประเภท `Creature` คุณสามารถปล่อยให้พารามิเตอร์ `name` และ `emoji` เป็นสตริงว่างไปก่อนได้ในตอนนี้
tr: Öncelikle, bir `Creature` örneğini saklayan bir [durum özelliği](glossary://state%20property) yarat. `name` ve `emoji` parametrelerini şimdilik boş dizgiler olarak bırakabilirsin.
vi: Trước tiên, hãy tạo ra một [thuộc tính trạng thái](glossary://state%20property) lưu trữ một thể hiện `Creature`. Bây giờ, bạn có thể để các tham số `name` và `emoji` dưới dạng các chuỗi trống.
zh_cn: 首先，创建一个可储存 `Creature` 实例的[状态属性](glossary://state%20property)。目前你可以将它的 `name` 和 `emoji` 参数留为空字符串。
zh_tw: 首先，建立一個儲存 `Creature` 實例的[狀態屬性](glossary://state%20property)。你可以先讓它的 `name` 和 `emoji` 參數留空。

source: Next, declare an [environment object](glossary://environment%20object) of type `CreatureZoo` to access your [observable object](glossary://observable%20object) instance.
de: Deklariere als Nächstes ein [Umgebungsobjekt](glossary://environment%20object) des Typs `CreatureZoo`, um auf die Instanz des [beobachtbaren Objekts](glossary://observable%20object) zuzugreifen.
es: A continuación, declara un [objeto de entorno](glossary://environment%20object) de tipo `CreatureZoo` para acceder a la instancia de tu [objeto observable](glossary://observable%20object).
es_419: Luego, declara un [objeto de entorno](glossary://environment%20object) del tipo `CreatureZoo` para acceder a tu instancia de [objeto observable](glossary://observable%20object).
fr: Ensuite, déclare un [objet d’environnement](glossary://environment%20object) de type `CreatureZoo` pour accéder à ton instance d’[objet observable](glossary://observable%20object).
it: Poi, dichiara un [oggetto ambiente](glossary://environment%20object) di tipo `CreatureZoo` per accedere all'istanza del tuo [oggetto osservabile](glossary://observable%20object).
nl: Declareer vervolgens een [omgevingsobject](glossary://environment%20object) van het type `CreatureZoo` om toegang te krijgen tot de instantie van je [observeerbare object](glossary://observable%20object).
no: Deretter deklarerer du et [miljøobjekt](glossary://environment%20object) av typen `CreatureZoo`, slik at du får tilgang til instansen din av det [observerbare objektet](glossary://observable%20object).
pt: Em seguida, declare um [objeto de ambiente](glossary://environment%20object) do tipo `CreatureZoo` para acessar a instância do [objeto observável](glossary://observable%20object).
sv: Härnäst deklarerar du ett [miljöobjekt](glossary://environment%20object) av typen `CreatureZoo` så att du kommer åt din instans av det [observerbara objektet](glossary://observable%20object).
th: ถัดไป ให้ประกาศ[วัตถุสภาพแวดล้อม](glossary://environment%20object)ของประเภท `CreatureZoo` เพื่อเข้าถึงชื่อแทนประเภทของ[วัตถุที่สังเกตเห็นได้](glossary://observable%20object)ของคุณ
tr: Sonra, [gözlemlenebilir nesne](glossary://observable%20object) örneğine erişmek için `CreatureZoo` tipinde bir [ortam nesnesi](glossary://environment%20object) bildir.
vi: Tiếp theo, hãy khai báo một [đối tượng môi trường](glossary://environment%20object) thuộc kiểu `CreatureZoo` để truy cập thể hiện [đối tượng có thể quan sát](glossary://observable%20object) của bạn.
zh_cn: 下一步，声明一个 `CreatureZoo` 类型的[环境对象](glossary://environment%20object)来访问[可观测对象](glossary://observable%20object)实例。
zh_tw: 接下來宣告一個類型 `CreatureZoo` 的[環境物件](glossary://environment%20object)來取用你的[可觀察的物件](glossary://observable%20object)實例。

# GuideBook..Guide0..StepAdd and delete creatures..TaskdefineYourView..title
source: Create a Form in CreatureEditor
de: Form in `CreatureEditor` erstellen
es: Crear un formulario en CreatureEditor
es_419: Crear un formulario en la visualización `CreatureEditor`
fr: Créer un formulaire dans CreatureEditor
it: Creare una forma in `CreatureEditor`
nl: Een formulier aanmaken in CreatureEditor
no: Opprett et skjema i CreatureEditor
pt: Crie um Formulário no CreatureEditor
sv: Skapa ett formulär i CreatureEditor
th: การสร้าง Form ใน CreatureEditor
tr: CreatureEditor’da Form Yaratma
vi: Tạo một Biểu mẫu trong CreatureEditor
zh_cn: 在 CreatureEditor 中创建表格
zh_tw: 在 CreatureEditor 中製作表單
