Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Because a `NavigationStack` acts like a deck of cards, it will only ever display the view that’s on top. Navigating to a new view pushes it to the top of the stack so it can be seen.
de: Da sich `NavigationStack` wie ein Kartendeck verhält, wird immer nur die oberste Ansicht angezeigt. Durch das Navigieren zu einer neuen Ansicht wird diese ganz oben in den Stapel geschoben, damit sie sichtbar ist.
es: Dado que una pila de navegación (`NavigationStack`) actúa como una baraja de cartas, solo mostrará la vista que esté en la parte superior. Navegar a una nueva vista la empuja a la parte superior de la pila para que se pueda ver.
es_419: Debido a que `NavigationStack` funciona como una baraja, solamente se mostrará la visualización que esté arriba. Al navegar a otra visualización, esta se pasa a la parte superior de la pila para poder mostrarse.
fr: Puisqu’une `NavigationStack` agit comme un jeu de cartes, elle n’affichera jamais que la vue qui se trouve sur le dessus. Naviguer vers une autre vue la pousse au sommet de la pile pour qu’elle puisse être vue.
it: Dal momento che `NavigationStack` funziona come un mazzo di carte, mostrerà solo la vista che si trova più in alto. Quando navighi verso una nuova vista, questa viene spinta in cima alla pila per essere visualizzata.
nl: Omdat een `NavigationStack` werkt als een spel kaarten, is alleen de bovenste weergave zichtbaar. Als je naar een nieuwe weergave navigeert, wordt deze boven op de stapel geplaatst zodat deze zichtbaar is.
no: Siden en `NavigationStack` fungerer som en kortstokk, viser den alltid bare visningen som er øverst. Når du navigerer til en ny visning, flyttes den opp øverst i stabelen så den blir synlig.
pt: Como um `NavigationStack` se comporta como um baralho de cartas, ele só exibe a visualização que está por cima. Ao navegar para uma nova visualização, ela é empurrada para o topo da pilha para que possa ser vista.
sv: Eftersom en `NavigationStack` fungerar som en kortlek visar den endast vyn som är överst. När du navigerar till en ny vy flyttas den upp överst i traven så att den blir synlig.
th: เนื่องจาก `NavigationStack` ทำหน้าที่เหมือนกับสำรับไพ่ โค้ดจะแสดงเฉพาะมุมมองที่อยู่ด้านบนสุดเท่านั้น การนำทางไปยังมุมมองใหม่จะผลักมุมมองไปที่ด้านบนสุดของสแต็คเพื่อให้สามารถมองเห็นได้
tr: Bir `NavigationStack` bir kart destesi gibi davrandığı için yalnızca en üstteki görüntüyü gösterir. Yeni bir görüntüye gidildiğinde görülebilmesi için görüntü yığının en üstüne itilir.
vi: Vì `NavigationStack` đóng vai trò như một cỗ bài nên nó sẽ chỉ luôn hiển thị chế độ xem ở trên cùng. Việc điều hướng đến một chế độ xem mới sẽ đẩy chế độ xem đó lên trên cùng của ngăn xếp sao cho bạn có thể nhìn thấy.
zh_cn: `NavigationStack` 就像一副纸牌，只会显示顶部的视图。导航到新的视图会将它推到堆栈的顶部，这样才能被看见。
zh_tw: 因為 `NavigationStack` 就像一副紙牌，它只會顯示最上面的顯示區。導覽到新的顯示區會將它推到堆疊的頂部，以便可以看到它。

source: NavigationLink("No, Push Me!") { Text("I'm another destination view") .navigationTitle("Destination") }
de: NavigationLink("Nein, drück mich!") { Text("Ich bin eine weitere Zielansicht") .navigationTitle("Ziel") }
es: NavigationLink("¡Venga, púlsame!") { Text("Soy otra vista de destino") .navigationTitle("Destino") }
es_419: NavigationLink("¡No, presióname a mí!") { Text("Soy otra visualización de destino") .navigationTitle("Destino") }
fr: NavigationLink(« Non, appuie sur moi !") { Text("Je suis une autre vue de destination") .navigationTitle("Destination") }
it: NavigationLink("No, premi me!") { Text("Sono un'altra vista di destinazione") .navigationTitle("Destinazione") }
nl: NavigationLink("Nee, tik hier!") { Text("k ben een andere doelweergave") .navigationTitle("Doel") }
pt: NavigationLink("Push Me!") { Text("Sou outra visualização de destino") .navigationTitle("Destination") }
sv: NavigationLink("Nej, tryck på mig!") { Text("Jag är en annan målvy") .navigationTitle("Mål") }
th: NavigationLink("ไม่ กดที่ฉันสิ!") { Text("ฉันคือมุมมองปลายทางอีกมุมมอง") .navigationTitle("ปลายทาง") }
tr: NavigationLink("Hayır, Bana Bas!") { Text("Ben başka bir hedef görüntüyüm") .navigationTitle("Hedef") }
vi: NavigationLink("Không, hãy đẩy tôi!") { Text("Tôi là một chế độ xem đích khác") .navigationTitle("Đích") }
zh_cn: NavigationLink("不，按下我！") { Text("我是另一个目的视图") .navigationTitle("目的位置") }
zh_tw: NavigationLink("No, Push Me!") { Text("我是目標顯示區") .navigationTitle("Destination") } ```

source: Experiment with a `NavigationSplitView`
de: Mit `NavigationSplitView` experimentieren
es: Experimentar con una vista dividida de navegación (`NavigationSplitView`)
es_419: Experimentar con `NavigationSplitView`
fr: Expérimenter une `NavigationSplitView`
it: Sperimentare con la vista `NavigationSplitView`
nl: Experimenteren met een `NavigationSplitView`
no: Eksperimenter med en `NavigationSplitView`
pt: Faça experiências com uma `NavigationSplitView`
sv: Experimentera med en `NavigationSplitView`
th: ทดลองใช้ `NavigationSplitView`
tr: `NavigationSplitView` ile denemeler yapma
vi: Thử nghiệm với một `NavigationSplitView`
zh_cn: `NavigationSplitView` 试验
zh_tw: 體驗 `NavigationSplitView`

source: Next, you’ll create a `NavigationSplitView` to display content as columns.
de: Als Nächstes erstellst du eine Instanz von `NavigationSplitView`, um Inhalte als Spalten anzuzeigen.
es: A continuación, vas a crear una vista dividida de navegación (`NavigationSplitView`) para mostrar el contenido como columnas.
es_419: Después, debes crear una `NavigationSplitView` para mostrar contenido como columnas.
fr: Ensuite, tu vas créer une `NavigationSplitView` pour afficher le contenu sous forme de colonnes.
it: Successivamente, creerai una `NavigationSplitView` per mostrare i contenuti come colonne.
nl: Vervolgens ga je een `NavigationSplitView` aanmaken om inhoud in kolommen weer te geven.
no: Nå skal du opprette en `NavigationSplitView` som viser innhold som kolonner.
pt: A seguir, você criará uma `NavigationSplitView` para mostrar o conteúdo como colunas.
sv: Sedan skapar du en `NavigationSplitView` som visar innehåll som kolumner.
th: ถัดไป คุณจะต้องสร้าง `NavigationSplitView` เพื่อแสดงเนื้อหาเป็นคอลัมน์
tr: Sonra, içerikleri sütun olarak görüntülemek için bir `NavigationSplitView` yaratacaksın.
vi: Tiếp theo, bạn sẽ tạo ra một `NavigationSplitView` để hiển thị nội dung dưới dạng các cột.
zh_cn: 下一步，你将创建一个 `NavigationSplitView` 来以列的方式显示内容。
zh_tw: 下一步，你將建立一個 `NavigationSplitView` 來將內容顯示為直欄。

source: You’ll use a navigation links as your leading column, and when tapped, each of these will display some text in the trailing column.
de: Du verwendest Navigations-Links in der Hauptspalte. Wenn du darauf tippst, zeigt jeder von ihnen Text in der Nebenspalte an.
es: Usarás un enlace de navegación como columna inicial y, al tocarlo, cada uno de ellos mostrará algún texto en la columna final.
es_419: Usa enlaces de navegación como columna inicial que, al tocarlos, cada uno muestre texto en la columna final.
fr: Tu utiliseras des liens de navigation comme ta première colonne et, lorsque tu les toucheras, chacun d’eux affichera du texte dans la dernière colonne.
it: Utilizzerai dei link di navigazione come colonna iniziale; quando vengono toccati, ciascuno di questi link mostrerà del testo nella colonna successiva.
nl: Je gebruikt navigatielinks als primaire kolom en wanneer op de links wordt getikt geven ze tekst in de secundaire kolom weer.
no: Du bruker navigeringslenker som innledende kolonne. Når de blir trykket på, viser hver av disse litt tekst i den etterfølgende kolonnen.
pt: Você usará links de navegação como coluna condutora que, quando tocados, mostrarão um texto na coluna de trilha.
sv: Du använder navigeringslänkar som inledande kolumn. När de blir tryckta på visar var och en av dessa en del text i den följande kolumnen.
th: คุณจะใช้ลิงก์การนำทางเป็นคอลัมน์เริ่มต้นของคุณ และเมื่อถูกแตะ ลิงก์การนำทางแต่ละลิงก์เหล่านี้จะแสดงข้อความบางส่วนในคอลัมน์ต่อท้าย
tr: Öndeki sütun olarak dolaşma bağlantıları görüntüsünü kullanacaksın; bu bağlantılara dokunulduğunda ise sondaki sütunda bazı metinler görüntülenecek.
vi: Bạn sẽ sử dụng các liên kết điều hướng làm cột đầu và khi được chạm, mỗi liên kết này sẽ hiển thị văn bản nào đó trong cột cuối.
zh_cn: 将导航链接用作前导列。轻点时，各个链接会在后续列中显示一些文本。
zh_tw: 你會使用導覽連結作為前導直欄，當點按時，每個連結都會在其後的直欄中顯示一些文字。

source: First, add your `NavigationSplitView`. You’ll notice that there are two sections: the first section is the leading column of the split view, and the second is a [placeholder view](glossary://placeholder%20view) that shows some temporary content until you select one of the links.
de: Zuerst fügst du eine Instanz von `NavigationSplitView` hinzu. Wie dir sicher schon aufgefallen ist, gibt es zwei Bereiche: Beim ersten Bereich handelt es sich um die Hauptspalte der Split View. Der zweite Bereich ist eine [Platzhalteransicht](glossary://placeholder%20view), die temporären Inhalt anzeigt, bis einer der Links ausgewählt wird.
es: Primero, añade tu vista dividida de navegación (`NavigationSplitView`). Verás que hay dos secciones: la primera es la columna inicial de la vista dividida, y la segunda es una [vista de marcador de posición](glossary://placeholder%20view) que muestra algún contenido temporal hasta que selecciones uno de los enlaces.
es_419: Primero, agrega tu visualización `NavigationSplitView`. Verás que hay dos secciones: la primera es la columna inicial de la visualización dividida, y la segunda es una [visualización de marcador de posición](glossary://placeholder%20view) que muestra contenido temporal hasta que se seleccione uno de los enlaces.
fr: Ajoute d’abord ta `NavigationSplitView`. Tu remarqueras qu’il y a deux sections : la première est la première colonne de la vue partagée, et la seconde est une [vue de paramètre fictif](glossary://placeholder%20view) qui affiche un contenu temporaire jusqu’à ce que tu sélectionnes l’un des liens.
it: Innanzitutto aggiungi la vista `NavigationSplitView`. Noterai che ci sono due sezioni: la prima è la colonna iniziale della vista suddivisa e la seconda è una [vista segnaposto](glossary://placeholder%20view) che mostra del contenuto temporaneo finché non selezioni uno dei link.
nl: Voeg om te beginnen een `NavigationSplitView` toe. Je zult merken dat er twee secties zijn: de eerste sectie is de primaire kolom van de Split View en de tweede is een [plaatsaanduidingsweergave](glossary://placeholder%20view) waarin tijdelijke inhoud wordt weergegeven totdat je een van de links selecteert.
no: Først legger du til en `NavigationSplitView`. Legg merke til at det finnes to deler: den første delen er den innledende kolonnen i den delte visningen, og den andre er en [plassholdervisning](glossary://placeholder%20view) som viser noe midlertidig innhold frem til du velger en av lenkene.
pt: Primeiro, adicione uma `NavigationSplitView`. Você notará duas seções: a primeira é a coluna condutora da visualização dividida e a segunda é uma [visualização marcadora de posição](glossary://placeholder%20view) que mostra um conteúdo temporário até que você selecione um dos links.
sv: Först lägger du till en `NavigationSplitView`. Lägg märke till att det finns två avsnitt: det första avsnittet är den inledande kolumnen i den delade vyn och det andra är en [platshållarvy](glossary://placeholder%20view) som visar något tillfälligt innehåll tills du väljer en av länkarna.
th: ก่อนอื่นให้เพิ่ม `NavigationSplitView` ของคุณ คุณจะสังเกตเห็นสองส่วน: ส่วนแรกคือคอลัมน์เริ่มต้นของมุมมองแบบแยกส่วนและส่วนที่สองคือ[มุมมองที่พัก](glossary://placeholder%20view) ซึ่งจะแสดงเนื้อหาชั่วคราวจนกว่าคุณจะเลือกลิงก์ใดลิงก์หนึ่ง
tr: Önce `NavigationSplitView`’unu ekle. İki bölüm olduğunu fark edeceksin: İlk bölüm, bölünmüş görüntünün öndeki sütunudur; ikincisi ise sen bağlantılardan birini seçene kadar bazı geçici içerikleri gösteren bir [yer tutucu görüntüdür](glossary://placeholder%20view).
vi: Trước tiên, hãy thêm `NavigationSplitView` của bạn. Bạn sẽ nhận thấy rằng có hai phần: phần thứ nhất là cột đầu của chế độ xem tách rời và phần thứ hai là một [chế độ xem trình giữ chỗ](glossary://placeholder%20view) hiển thị nội dung tạm thời nào đó đến khi bạn chọn một trong các liên kết.
zh_cn: 首先，添加 `NavigationSplitView`。你会注意到有两个部分：第一个部分是拆分视图的前导列，第二个部分是[占位符视图](glossary://placeholder%20view)，在你选择其中一个链接之前会显示一些临时内容。
zh_tw: 首先，加入你的 `NavigationSplitView`。你會注意到有兩個部分：第一個部分是分割顯示區的前導直欄，第二個是[暫存區顯示區](glossary://placeholder%20view)顯示了一些臨時內容，直到你選擇其中一個連結。

source: Next, add some links to your `NavigationSplitView`.
de: Füge als Nächstes einige Links zu `NavigationSplitView` hinzu.
es: A continuación, añade algunos enlaces a tu vista dividida de navegación (`NavigationSplitView`).
es_419: A continuación, agrega algunos enlaces a `NavigationSplitView`.
fr: Ensuite, ajoute des liens à ta `NavigationSplitView`.
it: Successivamente, aggiungi dei link alla vista `NavigationSplitView`.
nl: Voeg nu enkele links aan je `NavigationSplitView` toe.
no: Deretter legger du til noen lenker i `NavigationSplitView`.
pt: A seguir, adicione alguns links à `NavigationSplitView`.
sv: Sedan lägger du till några länkar i `NavigationSplitView`.
th: ถัดไป ให้เพิ่มบางลิงก์ไปยัง `NavigationSplitView` ของคุณ
tr: Sonra, `NavigationSplitView`’ına bazı bağlantılar ekle.
vi: Tiếp theo, hãy thêm một số liên kết vào `NavigationSplitView` của bạn.
zh_cn: 下一步，将一些链接添加到 `NavigationSplitView`。
zh_tw: 下一步，加入一些連結到你的 `NavigationSplitView`。

source: You might notice that the view still looks the same as a `NavigationStack` if you have a small preview size. Try expanding the preview to see multiple columns.
de: Dir ist sicher aufgefallen, dass bei einer kleinen Vorschaugröße die Ansicht noch genauso aussieht wie `NavigationStack`. Versuche, die Vorschau zu vergrößern, um mehrere Spalten zu sehen.
es: Puede que observes que la vista sigue teniendo el mismo aspecto que una pila de navegación (`NavigationStack`) si tienes un tamaño de previsualización pequeño. Prueba a ampliar la previsualización para ver varias columnas.
es_419: Es posible que notes que las visualizaciones se ven igual que con `NavigationStack` si utilizas un tamaño de vista previa pequeño. Intenta expandir la vista previa para ver varias columnas.
fr: Tu remarqueras peut-être que la vue ressemble toujours à une `NavigationStack` si ton aperçu est de petite taille. Essaie d’élargir l’aperçu pour voir plusieurs colonnes.
it: Probabilmente noterai che la vista è ancora uguale a una `NavigationStack` se hai un'anteprima di piccole dimensioni. Prova a espandere l'anteprima per visualizzare più colonne.
nl: Zoals je misschien opvalt, ziet de weergave er nog hetzelfde uit als een `NavigationStack` als je voorvertoning klein is. Maak de voorvertoning groter om meerdere kolommen te zien.
no: Du merker kanskje at visningen fortsatt ser lik ut som en `NavigationStack` hvis du har en liten forhåndsvisningsstørrelse. Prøv å utvide visningen slik at du ser flere kolonner.
pt: Você pode notar que a visualização ainda tem a mesma aparência do `NavigationStack` se o tamanho da pré‑visualização for pequeno. Tente expandir a pré‑visualização para ver várias colunas.
sv: Du kanske märker att vyn fortfarande ser likadan ut som `NavigationStack` om du har en liten förhandsvisningsstorlek. Prova att expandera vyn så att du ser flera kolumner.
th: คุณอาจสังเกตเห็นว่ามุมมองยังคงดูเหมือน `NavigationStack` หากคุณมีการแสดงตัวอย่างขนาดเล็ก ลองขยายการแสดงตัวอย่างเพื่อดูหลายคอลัมน์
tr: Önizleme boyutun küçükse görüntünün hâlâ `NavigationStack` gibi göründüğünü fark edebilirsin. Birden fazla sütun görmek için önizlemeyi genişletmeyi dene.
vi: Bạn có thể nhận thấy rằng chế độ xem trông vẫn giống như một `NavigationStack` nếu bạn có kích cỡ bản xem trước nhỏ. Hãy thử mở rộng bản xem trước để nhìn thấy nhiều cột.
zh_cn: 你可能注意到了，如果预览尺寸较小，视图看起来依旧和 `NavigationStack` 一样。尝试一下扩大预览来查看多个列。
zh_tw: 如果你的預覽尺寸較小，你可能會注意到顯示區看起來仍然與 `NavigationStack` 相同。嘗試展開預覽來檢視多個直欄。

source: List { NavigationLink("First link") { Text("😵‍💫") } NavigationLink("Second link") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
de: List { NavigationLink("Erster Link") { Text("😵‍💫") } NavigationLink("Zweiter Link") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
es: List { NavigationLink(“Primer enlace de navegación") { Text("😵‍💫") } NavigationLink("Segundo enlace de navegación") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
es_419: List { NavigationLink("Primer enlace") { Text("😵‍💫") } NavigationLink("Segundo enlace") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
fr: List { NavigationLink("Premier lien") { Text("😵‍💫") } NavigationLink("Second lien") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
it: List { NavigationLink("Primo link") { Text("😵‍💫") } NavigationLink("Secondo link") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
nl: List { NavigationLink("Eerst link") { Text("😵‍💫") } NavigationLink("Tweede link") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
sv: List { NavigationLink("Första länken") { Text("😵‍💫") } NavigationLink("Andra länken") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
th: List { NavigationLink("ลิงก์แรก") { Text("😵‍💫") } NavigationLink("ลิงก์ที่สอง") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
tr: List { NavigationLink("İlk bağlantı") { Text("😵‍💫") } NavigationLink("İkinci bağlantı") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
vi: List { NavigationLink("Liên kết thứ nhất") { Text("😵‍💫") } NavigationLink("Liên kết thứ hai") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }
zh_cn: List { NavigationLink("第一个链接") { Text("😵‍💫") } NavigationLink("第二个链接") { Text("😵‍") } //#-learning-code-snippet(addMoreNavLinks) }

source: Finally, add a [placeholder view](glossary://placeholder%20view) to provide some initial content for your second column.
de: Füge zum Schluss eine [Platzhalteransicht](glossary://placeholder%20view) hinzu, um einige Startinhalte für deine zweite Spalte bereitzustellen.
es: Por último, añade una [vista de marcador de posición](glossary://placeholder%20view) para proporcionar algún contenido inicial para tu segunda columna.
es_419: Por último, agrega una [visualización de marcador de posición](glossary://placeholder%20view) para ofrecer contenido inicial en tu segunda columna.
fr: Enfin, ajoute une [vue de paramètre fictif](glossary://placeholder%20view) pour fournir un contenu initial pour ta deuxième colonne.
it: Infine, aggiungi una [vista segnaposto](glossary://placeholder%20view) per fornire del contenuto iniziale per la tua seconda colonna.
nl: Voeg ten slotte een [plaatsaanduidingsweergave](glossary://placeholder%20view) toe om begininhoud aan de tweede kolom toe te voegen.
no: Legg til slutt til en [plassholdervisning](glossary://placeholder%20view) for å vise noe innledende innhold for den andre kolonnen.
pt: Finalmente, adicione uma [visualização marcadora de posição](glossary://placeholder%20view) para fornecer um conteúdo inicial à segunda coluna.
sv: Lägg slutligen till en [platshållarvy](glossary://placeholder%20view) för att visa en del inledande innehåll för den andra kolumnen.
th: ขั้นสุดท้าย ให้เพิ่ม[มุมมองที่พัก](glossary://placeholder%20view)เพื่อให้เนื้อหาเริ่มต้นบางส่วนกับคอลัมน์ที่สองของคุณ
tr: Son olarak, ikinci sütununda bazı başlangıç içerikleri olması için bir [yer tutucu görüntü](glossary://placeholder%20view) ekle.
vi: Cuối cùng, hãy thêm một [chế độ xem trình giữ chỗ](glossary://placeholder%20view) để cung cấp một số nội dung ban đầu cho cột thứ hai của bạn.
zh_cn: 最后，添加一个[占位符视图](glossary://placeholder%20view)来为第二列提供一些初始内容。
zh_tw: 最後，加入一個[暫存區顯示區](glossary://placeholder%20view)來為你的第二個直欄提供一些初始內容。

source: You can see this placeholder content by expanding your preview and restarting it before selecting a link.
de: Du kannst diese Platzhalterinhalte sehen, indem du die Vorschau erweiterst und vor dem Auswählen eines Links neu startest.
es: Puedes ver este contenido de marcador de posición expandiendo tu previsualización y reiniciándola antes de seleccionar un enlace.
es_419: Puedes ver este contenido de marcador de posición si expandes tu vista previa y la reinicias antes de seleccionar un enlace.
fr: Tu peux voir ce contenu de paramètre fictif en élargissant ton aperçu et en le redémarrant avant de sélectionner un lien.
it: Puoi visualizzare il contenuto segnaposto espandendo l'anteprima e riavviandola prima di selezionare un link.
nl: Je kunt deze tijdelijke inhoud bekijken door de voorvertoning te vergroten en deze opnieuw te starten voordat je een link selecteert.
no: Du kan se dette plassholderinnholdet ved å utvide forhåndsvisningen og starte den på nytt før du velger en lenke.
pt: Para ver esse conteúdo marcador de posição, expanda a pré‑visualização e reinicie‑a antes de selecionar um link.
sv: Du kan se det här platshållarinnehållet genom att expandera förhandsvisningen och starta om den innan du väljer en länk.
th: คุณสามารถดูเนื้อหาของที่พักนี้ได้โดยขยายการแสดงตัวอย่างของคุณและเริ่มการทำงานใหม่ก่อนจะเลือกลิงก์
tr: Önizlemeni genişleterek ve bir bağlantı seçmeden önce yeniden başlatarak bu yer tutucu içerikleri görebilirsin.
vi: Bạn có thể nhìn thấy nội dung trình giữ chỗ này bằng cách mở rộng bản xem trước và bắt đầu lại trước khi chọn một liên kết.
zh_cn: 在选择链接之前先扩大并重新启动预览，就可以查看这个占位符内容。
zh_tw: 你可以在選擇連結之前展開預覽並重新啟動它來檢視此暫存區的內容。

source: Text("Select a link")
de: Text("Link auswählen")
es: Text("Selecciona un enlace")
es_419: Text("Selecciona un enlace")
fr: Text("Sélectionne un lien")
it: Text("Seleziona un link")
nl: Text("Selecteer een link")
pt: Text("Selecione um link")
sv: Text("Välj en länk")
th: Text("เลือกลิงก์")
tr: Text("Bir bağlantı seç")
vi: Text("Chọn một liên kết")
zh_cn: Text("选择一个链接")
zh_tw: Text("選擇一個連結")

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskaddMoreNavLinks..title
source: Experiment with NavigationLinks
de: Mit Navigations-Links experimentieren
es: Experimentar con NavigationLinks
es_419: Experimentar con enlaces de navegación
fr: Expérimenter les liens de navigation
it: Sperimentare con i NavigationLink
nl: Experimenteren met NavigationLinks
no: Eksperimenter med NavigationLinks
pt: Experimente Usar NavigationLinks
sv: Experimentera med NavigationLinks
th: ทดลองใช้ NavigationLinks
tr: NavigationLinks ile Denemeler Yapma
vi: Thử nghiệm với NavigationLinks
zh_cn: NavigationLinks 试验
zh_tw: 體驗 NavigationLinks
