Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page6..Paragraph18
source: This `if` statement uses `isOn` as a condition to show the enclosed view when `true`, and to hide it when `false`.
de: Diese `if`-Anweisung verwendet `isOn` als Bedingung, um die eingeschlossene Ansicht einzublenden, wenn der Wert `true` ist, und sie auszublenden, wenn er `false` ist.
es: Esta sentencia `if` usa `isOn` como condición para mostrar la vista incluida entre las llaves cuando es `true` y ocultarla cuando es `false`.
es_419: Este enunciado `if` usa `isOn` como condición para mostrar la visualización adjunta cuando es `true`, y para ocultarla cuando es `false`.
fr: Cette instruction `if` utilise `isOn` comme une condition pour afficher la vue incluse lorsqu’elle est `true`, et pour la masquer lorsqu’elle est `false`.
it: Nell'istruzione `if`, `isOn` viene utilizzato come una condizione per mostrare la vista che racchiude quando è `true` e per nasconderla quando è `false`.
nl: Deze `if`-instructie gebruikt `isOn` als een voorwaarde om de ingesloten weergave te tonen bij `true` en te verbergen bij `false`.
no: Dette `if`-uttrykket bruker `isOn` som en betingelse for å vise den omsluttende visningen når det er `true` og for å skjule den når det er `false`.
pt: Essa instrução `if` usa `isOn` como uma condição para mostrar a visualização contida quando `true` e para ocultá‑la quando `false`.
sv: Det här `if`-uttrycket använder `isOn` som ett villkor för att visa den omslutna vyn när det är `true` och för att gömma den när det är `false`.
th: ชุดคำสั่ง `if` นี้จะใช้ `isOn` เป็นเงื่อนไขเพื่อแสดงมุมมองแบบปิดเมื่อเป็น `true` และซ่อนเมื่อเป็น `false`
tr: Bu `if` ifadesi `isOn`’u `true` olduğunda kapalı görüntüyü göstermek, `false` olduğunda ise gizlemek için koşul olarak kullanır.
vi: Câu lệnh `if` này sử dụng `isOn` như một điều kiện để hiển thị chế độ xem được bao quanh khi `true` và ẩn chế độ xem khi `false`.
zh_cn: 这个 `if` 语句将 `isOn` 用作条件，在它为 `true` 时显示附带视图，为 `false` 时隐藏视图。
zh_tw: 這個 `if` 語句使用 `isOn` 作為條件，在 `true` 時會顯示包含的顯示區，在 `false` 時則會隱藏顯示區。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page6..Paragraph19
source: This is how the `isOn` data connects to the view. Its current [state](glossary://state) determines how the UI appears.
de: So sind die `isOn`-Daten mit der Ansicht verbunden. Ihr aktueller [Status](glossary://state) legt fest, wie die Benutzeroberfläche angezeigt wird.
es: Así es como los datos de `isOn` se conectan a la vista. Su [estado](glossary://state) actual determina cómo aparece la IU.
es_419: Así es como los datos de `isOn` están conectados con la visualización: su [estado](glossary://state) actual determina cómo aparece la interfaz de usuario.
fr: C’est de cette manière que les données `isOn` se connectent à la vue. L’[état actuel](glossary://state) détermine de quelle manière s’affiche l’interface utilisateur.
it: Questo è il modo in cui i dati di `isOn` sono collegati alla vista. Il suo [stato](glossary://state) attuale determina l'aspetto dell'interfaccia utente.
nl: Dit is de manier waarop de `isOn`-gegevens zijn verbonden met de weergave. De huidige [status](glossary://state) bepaalt hoe de gebruikersinterface wordt weergegeven.
no: Det er sånn `isOn`-dataene kobles til visningen. Den aktuelle [statusen](glossary://state) avgjør hvordan brukergrensesnittet vises.
pt: É assim que os dados de `isOn` são conectados à visualização. Seu [estado](glossary://state) atual determina como a IU aparece.
sv: Det är så här `isOn`-data ansluter till vyn. Dess aktuella [status](glossary://state) avgör hur UI:t visas.
th: นี่เป็นวิธีที่ข้อมูล `isOn` เชื่อมต่อกับมุมมอง [สถานะ](glossary://state)ปัจจุบันของข้อมูลจะกำหนดลักษณะที่ UI จะแสดง
tr: Bu, `isOn` verilerinin görüntüye bağlanma şeklidir. Güncel [durumu](glossary://state) kullanıcı arayüzünün nasıl görüneceğini belirler.
vi: Đây là cách dữ liệu `isOn` kết nối với chế độ xem. [Trạng thái](glossary://state) hiện tại của thuộc tính xác định cách UI xuất hiện.
zh_cn: 这是 `isOn` 数据与视图连接的方式。它的当前[状态](glossary://state)决定了 UI 会如何显示。
zh_tw: 這就是 `isOn` 資料連接到顯示區的方式。它目前的[狀態](glossary://state)決定了 UI 的顯示方式。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page7..Paragraph20
source: When you tap the button in the preview, the circle view in the `if` statement displays or hides.
de: Wenn du auf die Taste in der Vorschau tippst, wird die Kreisansicht in der `if`-Anweisung ein- oder ausgeblendet.
es: Al tocar el botón en la vista previa, la vista del círculo de la sentencia `if` se muestra o se oculta.
es_419: Cuando presionas el botón en la previsualización, se muestra u oculta la visualización del círculo del enunciado `if`.
fr: Lorsque tu touches le bouton dans l’aperçu, la vue du cercle dans l’instruction `if` apparaît ou disparaît.
it: Quando tocchi il pulsante nell'anteprima, la vista del cerchio nell'istruzione `if` viene visualizzata o nascosta.
nl: Wanneer je op de knop in de voorvertoning tikt, wordt de cirkelweergave in de `if`-instructie weergegeven of verborgen.
no: Når du trykker på knappen i forhåndsvisningen, vises eller skjules sirkelvisningen i `if`-uttrykket.
pt: Quando você toca no botão na pré‑visualização, a visualização do círculo na instrução `if` é exibida ou ocultada.
sv: När du trycker på knappen i förhandsvisningen visas eller göms cirkelvyn i `if`-uttrycket.
th: เมื่อคุณแตะปุ่มในการแสดงตัวอย่าง มุมมองวงกลมในชุดคำสั่ง `if` จะแสดงหรือซ่อน
tr: Önizlemede düğmeye dokunduğunda `if` ifadesindeki daire görüntüsü gösterilir veya gizlenir.
vi: Khi bạn chạm vào nút trong bản xem trước, chế độ xem hình tròn trong câu lệnh `if` hiển thị hoặc ẩn.
zh_cn: 当你轻点预览中的按钮时，`if` 语句中的圆圈视图会显示或隐藏。
zh_tw: 當你點一下預覽中的按鈕時，即會顯示或隱藏 `if` 語句中的圓形顯示區。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page7..Paragraph21
source: Try changing the circle’s color and tapping the button again. Try changing the initial value of `isOn` to `true`. What changes do you notice in each case?
de: Versuche, die Farbe des Kreises zu ändern und erneut auf die Taste zu tippen. Versuche, den Ausgangswert von `isOn` in `true` zu ändern. Was ändert sich jeweils?
es: Prueba a cambiar el color del círculo y vuelve a pulsar el botón. Prueba a cambiar el valor inicial de `isOn` a `true`. ¿Qué cambios observas en cada caso?
es_419: Intenta cambiar el color del círculo y tocar el botón de nuevo. Intenta también cambiar el valor inicial de `isOn` a `true`. ¿Qué cambios notas en cada caso?
fr: Essaie de changer la couleur du cercle et de toucher à nouveau le bouton. Essaie de remplacer la valeur initiale de `isOn` par `true`. Quels changements remarques-tu dans chaque cas ?
it: Prova a modificare il colore del cerchio e a premere nuovamente il pulsante. Prova a impostare il valore iniziale di `isOn` su `true`. Quali sono i cambiamenti che si verificano in ciascun caso?
nl: Wijzig de kleur van de cirkel en tik opnieuw op de knop. Verander vervolgens de beginwaarde van `isOn` in `true`. Wat verandert er in beide gevallen?
no: Prøv å endre fargen på sirkelen, og trykk på knappen igjen. Prøv å endre den innledende verdien for `isOn` til `true`.Hvilke endringer legger du merke til når du gjør dette?
pt: Tente mudar a cor do círculo e toque novamente no botão. Tente alterar o valor inicial de `isOn` para `true`. Quais alterações você nota em cada caso?
sv: Prova att ändra cirkelns färg och trycka igen på knappen. Prova att ändra det inledande värdet för `isOn` till `true`. Vilka förändringar lägger du märke till när du gör de här sakerna?
th: ลองเปลี่ยนสีของวงกลมแล้วแตะปุ่มอีกครั้ง ลองเปลี่ยนค่าเริ่มต้นของ `isOn` เป็น `true` คุณสังเกตเห็นการเปลี่ยนแปลงใดบ้างในแต่ละกรณี
tr: Dairenin rengini değiştirmeyi ve düğmeye yeniden dokunmayı dene. `isOn`’un ilk değerini `true` olarak değiştirmeyi dene. Her durumda ne değişiklikler fark ettin?
vi: Thử thay đổi màu của hình tròn và chạm lại vào nút. Hãy thử thay đổi giá trị ban đầu của `isOn` thành `true`. Bạn lưu ý thấy những thay đổi nào trong mỗi trường hợp?
zh_cn: 尝试更改圆圈的颜色，然后再次轻点按钮。试着将 `isOn` 的初始值更改为 `true`。在每种情况中，你观察到了什么变化？
zh_tw: 嘗試更改圓圈的顏色並且再點一下按鈕。試著將 `isOn` 的初始值更改為 `true`。你注意到每種情況下有什麼變化嗎？

# GuideBook..Guide0..StepModifying State..TaskaddElse..title
source: Add an `else` statement that shows a different color circle
de: `else`-Anweisung zum Anzeigen eines anderen Farbkreises hinzufügen
es: Añadir una sentencia `else` que muestre un círculo de otro color
es_419: Agregar un enunciado `else` que muestre un círculo de color diferente
fr: Ajouter une instruction `else` qui affiche un cercle d’une autre couleur
it: Aggiungere un'istruzione `else` che mostra un cerchio di colore diverso
nl: Voeg een `else`-instructie toe waarmee je een cirkel met een andere kleur weergeeft
no: Legg til et `else`-uttrykk som viser en sirkel med en annen farge
pt: Adicione uma instrução `else` que mostra um círculo de cor diferente
sv: Lägg till ett `else`-uttryck som visar en cirkel med en annan färg
th: เพิ่มชุดคำสั่ง `else` ที่แสดงวงกลมสีอื่น
tr: Farklı bir renk dairesini gösteren bir `else` ifadesi ekleme
vi: Thêm một câu lệnh `else` hiển thị một hình tròn có màu khác
zh_cn: 添加显示不同颜色圆圈的 `else` 语句
zh_tw: 加入一個顯示不同顏色圓圈的 `else` 語句

# GuideBook..Guide0..StepModifying State..TaskaddElse..Page8..Paragraph22
source: Take a moment to reflect on how tapping the button updates the view. When you tap the `Button`, you change the [state](glossary://state) of `isOn`. SwiftUI [observes](glossary://observe) this change, and updates the view using the new value. In your view [body](glossary://body), you use an `if` statement to display the view if `isOn` is `true` and to hide it if `false`.
de: Nimm dir einen Moment Zeit und denke darüber nach, wie die Ansicht aktualisiert wird, wenn auf die Taste getippt wird. Beim Tippen auf `Button` änderst du den [Status](glossary://state) von `isOn`. SwiftUI [beobachtet](glossary://observe) diese Änderung und aktualisiert die Ansicht mit dem neuen Wert. Im Ansicht-[Hauptteil](glossary://body) verwendest du eine `if`-Anweisung, um die Ansicht einzublenden, wenn `isOn` den Wert `true` hat, und auszublenden, wenn der Wert `false` ist.
es: Tómate un momento para reflexionar sobre cómo al tocar el botón se actualiza la vista. Al tocar `Button`, se cambia el [estado](glossary://state) de `isOn`. SwiftUI [observa](glossary://observe) este cambio y actualiza la vista usando el nuevo valor. En tu vista del [cuerpo](glossary://body), verás una sentencia `if` para mostrar la vista si `isOn` es `true` y para ocultarla si es `false`.
es_419: Tómate un momento para reflexionar sobre cómo al tocar el botón, se actualiza la visualización. Cuando presionas el botón `Button`, se cambia el [estado](glossary://state) de `isOn` (está activado). SwiftUI [observa](glossary://observa) este cambio y actualiza la visualización con el nuevo valor. En tu visualización [cuerpo](glossary://body), se usa un enunciado `if` para mostrar la visualización si `isOn` es `true`, o para ocultarla si es `false`.
fr: Prends un moment pour réfléchir à la manière dont toucher le bouton met à jour la vue. Lorsque tu touches le `Button`, tu changes l’[état](glossary://state) de `isOn`. SwiftUI [observe](glossary://observe) ce changement et met à jour la vue avec la nouvelle valeur. Dans le [corps](glossary://body) de ta vue, tu utilises une instruction `if` pour afficher la vue si `isOn` est `true` et pour la masquer si elle est `false`.
it: Prenditi del tempo per riflettere su come l'azione di toccare il pulsante aggiorna la vista. Quando tocchi `Button`, modifichi lo [stato](glossary://state) di `isOn`. SwiftUI [osserva](glossary://observe) il cambiamento e aggiorna la vista utilizzando il nuovo valore. Nel [corpo](glossary://body) della tua vista, puoi usare un'istruzione `if` per mostrare la vista se il valore di `isOn` è `true` e per nasconderla se è `false`.
nl: Neem even de tijd om na te denken over hoe de weergave wordt bijgewerkt wanneer op de knop wordt getikt. Wanneer je op de `Button` tikt, verandert de [status](glossary://state) van `isOn`. SwiftUI [observeert](glossary://observe) deze wijziging en werkt de weergave bij met de nieuwe waarde. Je gebruik een `if`-instructie in de [body](glossary://body) van je weergave om de weergave weer te geven als `isOn` de waarde `true` heeft en om de weergave te verbergen als `isOn` de waarde `false` heeft.
no: Ta deg tid til å reflektere over hvordan visningen oppdateres når du trykker på knappen. Når du trykker på `Button`, endrer du [statusen](glossary://state) til `isOn`. SwiftUI [observerer](glossary://observe) denne endringen og oppdaterer visningen med den nye verdien. I visningens [visningsinnhold](glossary://body) bruker du et `if`-uttrykk til å vise visningen hvis `isOn` er `true` og skjule den hvis det er `false`.
pt: Reflita sobre como o toque no botão atualiza a visualização. Quando você toque no `Button`, você altera o [estado](glossary://state) de `isOn`. A SwiftUI [observa](glossary://observe) essa alteração e atualiza a visualização com o novo valor. No [corpo](glossary://body) da visualização, use uma instrução `if` para mostrar a visualização se `isOn` for `true` e ocultá‑la se for `false`.
sv: Ägna ett ögonblick åt att reflektera över hur vyn uppdateras när du trycker på knappen. När du trycker på `Button` ändrar du [statusen](glossary://state) för `isOn`. SwiftUI [observerar](glossary://observe) den här ändringen och uppdaterar vyn med det nya värdet. I vyns [body](glossary://body) använder du ett `if`-uttryck till att visa vyn ifall `isOn` är `true` och gömma den ifall det är `false`.
th: ใช้เวลาสักครู่เพื่อพิจารณาว่าการแตะปุ่มจะอัปเดตมุมมองได้อย่างไร เมื่อคุณแตะ `Button` คุณจะเปลี่ยน[สถานะ](glossary://state)ของ `isOn` SwiftUI จะ[สังเกต](glossary://observe)การเปลี่ยนแปลงนี้และอัปเดตมุมมองโดยใช้ค่าใหม่ ใน[เนื้อหา](glossary://body)ของมุมมอง คุณจะใช้ชุดคำสั่ง `if` เพื่อแสดงมุมมองหาก `isOn` เป็น `true` และซ่อนมุมมองหากเป็น `false`
tr: Bir dakika dur ve düğmeye dokunmanın görüntüyü nasıl güncelleyeceğini düşün. Düğmeye (`Button`) dokunduğunda, `isOn`’un [durumunu](glossary://state) değiştirirsin. SwiftUI bu değişikliği [gözlemler](glossary://observe) ve yeni değeri kullanarak görüntüyü günceller. Görüntünün [gövdesinde](glossary://body) `isOn` `true` ise görüntüyü göstermek, `false` ise gizlemek için bir `if` ifadesi kullanırsın.
vi: Hãy dành giây lát để suy nghĩ xem bằng cách nào mà việc chạm vào nút sẽ cập nhật chế độ xem. Khi bạn chạm vào `Button`, bạn thay đổi [trạng thái](glossary://state) của `isOn`. SwiftUI [quan sát](glossary://observe) thay đổi này và cập nhật chế độ xem bằng giá trị mới. Trong [phần thân](glossary://body) của chế độ xem, bạn sử dụng một câu lệnh `if` để hiển thị chế độ xem nếu `isOn` là `true` và ẩn chế độ xem nếu là `false`.
zh_cn: 花点时间回想一下，轻点按钮是如何更新视图的。轻点 `Button` 时，你更改了 `isOn` 的[状态](glossary://state)。SwiftUI [观测](glossary://observe)到了这个更改，并使用新值更新视图。在视图[主体](glossary://body)中，你使用了 `if` 语句，在 `isOn` 为 `true` 时显示视图，在它为 `false` 时隐藏视图。
zh_tw: 花點時間思考一下，點按按鈕時會如何更新顯示區。當你點按 `Button` 時，你改變了 `isOn` 的[狀態](glossary://state)。SwiftUI 會[觀察](glossary://observe)此一變化，並使用新的值更新顯示區。在你的顯示區[主體](glossary://body)中，你會使用 `if` 語句在 `isOn` 為 `true` 時顯示顯示區，並在 `false` 時隱藏顯示區。

# GuideBook..Guide0..StepModifying State..TaskaddElse..Page9..Paragraph23
source: Instead of showing no views when `isOn` is `false`, you can display a custom view.
de: Anstatt keine Ansichten anzuzeigen, wenn `isOn` den Wert `false` hat, kannst du eine angepasste Ansicht anzeigen.
es: En lugar de no mostrar ninguna vista cuando `isOn` es `false`, puedes mostrar una vista personalizada.
es_419: En lugar de no mostrar ninguna visualización cuando `isOn` es `false`, puedes mostrar una visualización personalizada.
fr: Plutôt que de ne montrer aucune vue lorsque `isOn` est `false`, tu peux afficher une vue personnalisée.
it: Invece di non mostrare alcuna vista quando `isOn` è `false`, puoi visualizzarne una personalizzata.
nl: In plaats van de weergave te verbergen als `isOn` de waarde `false` heeft, kun je ook een aangepaste weergave tonen.
no: I stedet for å vise ingen visninger når `isOn` er `false`, kan du vise en tilpasset visning.
pt: Em vez de não mostrar nenhuma visualização quando `isOn` for `false`, você pode mostrar uma visualização personalizada.
sv: Istället för att inte visa några vyer när `isOn` är `false` kan du visa en anpassad vy.
th: แทนที่จะไม่แสดงมุมมองเมื่อ `isOn` เป็น `false` คุณสามารถแสดงมุมมองแบบกำหนดเองได้
tr: `isOn` `false` olduğunda hiçbir görüntü göstermemek yerine özel bir görüntü gösterebilirsin.
vi: Thay vì không hiển thị chế độ xem nào khi `isOn` là `false`, bạn có thể hiển thị một chế độ xem tùy chỉnh.
zh_cn: 你可以在 `isOn` 为 `false` 时显示自定视图，而非不显示视图。
zh_tw: 當 `isOn` 為 `false` 時，你可以顯示自訂的顯示區，而非不將其顯示。

# GuideBook..Guide0..StepModifying State..TaskaddElse..Page9..Paragraph24
source: After the `if` statement, add an `else` statement that shows a `Circle` of a different color.
de: Füge nach der `if`-Anweisung eine `else`-Anweisung ein, die den `Circle` mit einer anderen Farbe anzeigt.
es: Después de la sentencia `if`, añade una sentencia `else` que muestre un círculo (`Circle`) de otro color.
es_419: Después de la declaración `if`, agrega una declaración `else` (si no) que muestre una visualización `Circle` de un color diferente.
fr: Après l’instruction `if`, ajoute une instruction `else` qui affiche un `Circle` d’une autre couleur.
it: Dopo l'istruzione `if`, aggiungi un'istruzione `else` che mostra un `Circle` di un colore diverso.
nl: Voeg na de `if`-instructie een `else`-instructie toe waarmee je een `Circle` met een andere kleur weergeeft.
no: Legg til et `else`-uttrykk som viser en `Circle`-visning med en annen farge, etter `if`-uttrykket.
pt: Depois da instrução `if`, adicione uma instrução `else` que mostra um `Circle` de cor diferente.
sv: Lägg till ett `else`-uttryck som visar en `Circle`-vy med en annan färg efter `if`-uttrycket.
th: หลังชุดคำสั่ง `if` ให้เพิ่มชุดคำสั่ง `else` ที่แสดง `Circle` สีอื่น
tr: `if` ifadesinden sonra farklı bir renge ait bir `Circle` gösteren `else` ifadesi ekle.
vi: Sau câu lệnh `if`, hãy thêm một câu lệnh `else` hiển thị một `Circle` có màu khác.
zh_cn: 在 `if` 语句后，添加显示不同颜色 `Circle` 的 `else` 语句。
zh_tw: 在 `if` 語句後方加入一個 `else` 語句，讓 `Circle` 顯示不同的顏色。

# GuideBook..Guide0..StepModifying State..TaskaddElse..Page10..Paragraph25
source: Add an `else` statement using the following syntax, then add a `Circle` view and specify its color.
de: Füge mit der folgenden Syntax eine `else`-Anweisung hinzu, füge dann die Ansicht `Circle` (Kreis) hinzu und lege eine Farbe fest.
es: Añade una sentencia `else` usando la siguiente sintaxis y, a continuación, añade una vista `Circle` (círculo) y especifica su color.
es_419: Agrega una declaración `else` (si no) utilizando la siguiente sintaxis, y luego agrega una visualización `Circle` (círculo) y especifica su color.
fr: Ajoute une instruction `else` avec la syntaxe suivante, puis ajoute une vue `Circle` et indique sa couleur.
it: Aggiungi un'istruzione `else` con la sintassi mostrata di seguito, quindi aggiungi una vista `Circle` specificandone il colore.
nl: Voeg een `else`-instructie toe met de volgende syntaxis. Voeg vervolgens een `Circle`-weergave toe en geef de kleur van de weergave op.
no: Legg til et `else`-uttrykk med følgende syntaks, og legg deretter til en `Circle`-visning og angi fargen dens.
pt: Adicione uma instrução `else` usando a sintaxe seguinte e, em seguida, adicione uma visualização `Circle` e especifique sua cor.
sv: Lägg till ett `else`-uttryck med följande syntax och lägg sedan till en `Circle`-vy och ange dess färg.
th: เพิ่มชุดคำสั่ง `else` โดยใช้ไวยากรณ์ต่อไปนี้ จากนั้นเพิ่มมุมมอง `Circle` แล้วระบุสี
tr: Aşağıdaki söz dizimini kullanarak bir `else` ifadesi ekle, ardından bir `Circle` görüntüsü ekle ve rengini belirt.
vi: Thêm một câu lệnh `else` bằng cú pháp sau đây, sau đó thêm một chế độ xem `Circle` và chỉ định màu.
zh_cn: 使用以下语法添加 `else` 语句，然后添加 `Circle` 视图并为它指定颜色。
zh_tw: 使用以下語法加入一個 `else` 語句，然後加入一個 `Circle` 顯示區並指定其顏色。

# GuideBook..Guide0..StepModifying State..TaskcustomizeConditionalViews..title
source: Add detail to the on and off views
de: Details zu den ein- und ausgeblendeten Ansichten hinzufügen
es: Añadir detalles a las vistas activadas y desactivadas
es_419: Agregar detalles a las visualizaciones para encender y apagar
fr: Ajouter des détails aux vues on et off
it: Aggiungere dettagli alle viste attive e a quelle non attive
nl: Details toevoegen aan de weergaven “aan” en “uit”
no: Legg til detaljer i av- og på-visninger
pt: Adicione detalhes às visualizações ligada e desligada
sv: Lägg till detaljer i av- och på-vyer
th: เพิ่มรายละเอียดไปยังมุมมอง “on” และ “off”
tr: Açık ve kapalı görüntülere ayrıntı ekleme
vi: Thêm chi tiết vào các chế độ xem bật và tắt
zh_cn: 给打开和关闭视图添加细节
zh_tw: 在開啟和關閉的顯示區中加入詳細資訊

source: Now that you have two views, customize them to make it clear which view is “on” and which is “off”.
de: Da du nun zwei Ansichten hast, passe sie entsprechend an, um deutlich zu machen, welche davon ein- oder ausgeschaltet ist.
es: Ahora que tienes dos vistas, personalízalas para que quede claro qué vista está “activada” y cuál está “desactivada”.
es_419: Ahora que tienes dos visualizaciones, personalízalas para que quede claro cuál es para “encender” y cuál es para “apagar”.
fr: Maintenant que tu disposes de deux vues, personnalise-les pour qu’il soit facile de voir laquelle est « on » et laquelle est « off ».
it: Ora che hai due viste, personalizzale per chiarire qual è quella “attiva” e qual è quella “non attiva”.
nl: Nu je twee weergaven hebt, kun je ze aanpassen om duidelijk te maken welke weergave “aan” is en welke “uit”.
no: Nå når du har to visninger, kan du tilpasse dem så det blir tydelig hvilken visning som er «på» og hvilken som er «av».
pt: Agora que você tem duas visualizações, personalize‑as para deixar claro qual está “ligada” e qual está “desligada”.
sv: Nu när du har två vyer kan du anpassa dem så att det blir tydligt vilken vy som är ”på” och vilken som är ”av”.
th: ตอนนี้เมื่อคุณมีสองมุมมองแล้ว กำหนดให้ชัดเจนว่ามุมมองใดคือ “on” และมุมมองใดคือ “off”
tr: Artık iki görüntün olduğuna göre, bunları hangi görüntünün “açık”, hangisinin “kapalı” olduğunu netleştirmek üzere özelleştir.
vi: Bây giờ bạn có hai chế độ xem, hãy tùy chỉnh chúng để làm rõ chế độ xem nào là “bật” và chế độ xem nào là “tắt”.
zh_cn: 现在你有两个视图了。自定视图以清楚地指示哪个视图为“打开”，哪个视图为“关闭”。
zh_tw: 現在你有兩個顯示區，請自定它們來確定哪一個顯示區是「開啟」，哪一個是「關閉」的。
