Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Use the `.animation(_:value:)` modifier to animate any changes to the `isScaled` variable. Try using the `.spring(response:dampingFraction:blendDuration:)` animation, and passing in a value of `0.5` for each parameter.
de: Verwende den Modifikator `.animation(_:value:)`, um sämtliche Änderungen an der Variable `isScaled` zu animieren. Du kannst zum Beispiel die Animation `.spring(response:dampingFraction:blendDuration:)` verwenden und einen Wert von `0.5` für jeden Parameter übergeben.
es: Usa el modificador `.animation(_:value:)` para animar los cambios a la variable `isScaled`. Prueba a usar la animación `.spring(response:dampingFraction:blendDuration:)` y a pasarle un valor de `0.5` para cada parámetro.
es_419: Usa el modificador `.animation(_:value:)` para animar cualquier cambio en la variable `isScaled`. Intenta usar la animación `.spring(response:dampingFraction:blendDuration:)`, y pasa un valor de `0.5` para cada parámetro.
fr: Utilise le modificateur `.animation(_:value:)` pour animer toute modification apportée à la variable `isScaled`. Essaie d’utiliser l’animation `.spring(response:dampingFraction:blendDuration:)` et de transmettre une valeur de `0.5` pour chaque paramètre.
it: Usa il modificatore `.animation(_:value:)` per animare tutti i cambiamenti della variabile `isScaled`. Prova a utilizzare l'animazione `.spring(response:dampingFraction:blendDuration:)` e a passare un valore di `0.5` per ciascun parametro.
nl: Gebruik de modifier `.animation(_:value:)` om een animatie te maken van de wijzigingen van de variabele `isScaled`. Probeer de animatie `.spring(response:dampingFraction:blendDuration:)` te gebruiken en een waarde van `0.5` voor elke parameter door te geven.
no: Bruk modifikatoren `.animation(_:value:)` til å animere endringer av variabelen `isScaled`. Prøv å bruke animasjonen `.spring(response:dampingFraction:blendDuration:)`, og overfør en verdi på `0.5` for hver parameter.
pt: Use o modificador `.animation(_:value:)` para animar as suas alterações à variável `isScaled`. Tente usar a animação `.spring(response:dampingFraction:blendDuration:)` e passar um valor de `0.5` para cada parâmetro.
sv: Använd modifieraren `.animation(_:value:)` till att animera förändringar av variabeln `isScaled`. Prova att använda animeringen `.spring(response:dampingFraction:blendDuration:)` och överföra ett värde på `0.5` för varje parameter.
th: ใช้ปุ่มปรับค่า `.animation(_:value:)` เพื่อทำให้การเปลี่ยนแปลงใดๆ ที่ทำกับตัวแปร `isScaled` เคลื่อนไหวได้ ลองใช้ภาพเคลื่อนไหว `.spring(response:dampingFraction:blendDuration:)` แล้วส่งผ่านค่า `0.5` สำหรับแต่ละพารามิเตอร์
tr: `isScaled` değişkenindeki tüm değişiklikleri canlandırmak için `.animation(_:value:)` niteleyicisini kullan. `.spring(response:dampingFraction:blendDuration:)` canlandırmasını kullanmayı ve her parametre için `0.5` değerini geçirmeyi dene.
vi: Sử dụng trình sửa đổi `.animation(_:value:)` để tạo hiệu ứng bất kỳ thay đổi nào với biến `isScaled`. Hãy thử sử dụng hiệu ứng chuyển động `.spring(response:dampingFraction:blendDuration:)` và chuyển vào một giá trị bằng `0.5` cho từng tham số.
zh_cn: 使用 `.animation(_:value:)` 修饰符给 `isScaled`（缩放）变量的更改赋予动画效果。尝试使用 `.spring(response:dampingFraction:blendDuration:)` 动画，并给每个参数传入值 `0.5`。
zh_tw: 使用 `.animation(_:value:)` 修飾符對 `isScaled` 變數的任何更動進行動畫處理。嘗試使用 `.spring(response:dampingFraction:blendDuration:)` 動畫，並為每個參數傳入 `0.5` 的值。

source: Use `isScaled` to Rotate Your View
de: Mit `isScaled` die Ansicht rotieren
es: Usar `isScaled` para girar la vista
es_419: Usar `isScaled` para girar tu visualización
fr: Utiliser `isScaled` pour faire pivoter la vue
it: Utilizzare `isScaled` per ruotare la vista
nl: `isScaled` gebruiken om je weergave te roteren
no: Bruk `isScaled` til å rotere visningen
pt: Use `isScaled` para Girar a Visualização
sv: Använd `isScaled` till att rotera vyn
th: ใช้ `isScaled` เพื่อหมุนมุมมองของคุณ
tr: Görüntünü Döndürmek İçin `isScaled`’i Kullanma
vi: Sử dụng `isScaled` để xoay chế độ xem của bạn
zh_cn: 使用 `isScaled` 旋转视图
zh_tw: 使用 `isScaled` 來旋轉你的顯示區

source: To add a final little flair, create a conditional value in the `.rotation3DEffect` modifier’s `angle` parameter, then set it to `Angle(degrees: 0)` if `isScaled` is `true`, or `Angle(degrees: 360)` if `false`.
de: Jetzt wollen wir das Ganze etwas aufpeppen. Erstelle einen bedingten Wert im Parameter `angle` (Winkel) des Modifikators `.rotation3DEffect` und lege ihn auf `Angle(degrees: 0)` fest, wenn `isScaled` den Wert `true` hat, und auf `Angle(degrees: 360)`, wenn der Wert `false` ist.
es: Para añadir un último toque, crea un valor condicional en el parámetro `angle` (ángulo) del modificador `.rotation3DEffect` y luego ajústalo en `Angle(degrees: 0)` si `isScaled` es `true` (verdadero) o en `Angle(degrees: 360)` si es `false` (falso).
es_419: Para agregar el toque final, crea un valor condicional en el parámetro `angle` del modificador `.rotation3DEffect`, y luego establécelo a `Angle(degrees: 0)` si `isScaled` es `true`, o a `Angle(degrees: 360)` si es `false`.
fr: Pour ajouter une dernière petite touche, crée une valeur conditionnelle dans le paramètre `angle` du modificateur `.rotation3DEffect`, puis définis-le sur `Angle(degrees: 0)` si `isScaled` est `true`, et sur `Angle(degrees: 360)` s’il est `false`.
it: Per rendere il codice un po' più interessante, crea un valore condizionale nel parametro `angle` del modificatore `.rotation3DEffect`, quindi impostalo su `Angle(degrees: 0)` se `isScaled` è `true` oppure su `Angle(degrees: 360)` se è `false`.
nl: Voeg ten slotte nog iets extra's toe. Maak een voorwaardelijke waarde aan in de parameter `angle` van de modifier `.rotation3DEffect` en stel deze in op `Angle(degrees: 0)` als `isScaled` de waarde `true` heeft of op `Angle(degrees: 360)` als `isScaled` de waarde `false` heeft.
no: Legg til en siste, lille piff ved å opprette en betinget verdi i `.rotation3DEffect`-modifikatorens `angle`-parameter, og angi den deretter til `Angle(degrees: 0)` hvis `isScaled` er `true` eller `Angle(degrees: 360)` hvis den er `false`.
pt: Para acrescentar um toque final, crie um valor condicional em `.rotation3DEffect` no parâmetro `angle` do modificador e o defini como `Angle(degrees: 0)` se `isScaled` for `true` ou `Angle(degrees: 360)` se for `false`.
sv: Lägg till en sista liten piff genom att skapa ett villkorligt värde i `.rotation3DEffect`-modifierarens `angle`-parameter och ställa in den på `Angle(degrees: 0)` om `isScaled` är `true` eller `Angle(degrees: 360)` om den är `false`.
th: ในการเพิ่มลูกเล่นสุดท้ายเล็กน้อย ให้สร้างค่าเงื่อนไขในพารามิเตอร์ `angle` ของปุ่มปรับค่า `.rotation3DEffect` จากนั้นตั้งค่าให้เป็น`Angle(degrees: 0)` หาก `isScaled` เป็น `true` หรือ `Angle(degrees: 360)` หากเป็น `false`
tr: Son bir beceri eklemek için `.rotation3DEffect` niteleyicisinin `angle` parametresinde bir koşullu değer yarat, sonra `isScaled` değeri `true` ise onu `Angle(degrees: 0)` olarak veya `false` ise `Angle(degrees: 360)` olarak ayarla.
vi: Để thêm một chi tiết nhỏ cuối cùng, hãy tạo ra một giá trị điều kiện trong tham số `angle` của trình sửa đổi `.rotation3DEffect`, sau đó đặt thành `Angle(degrees: 0)` nếu `isScaled` là `true` hoặc `Angle(degrees: 360)` nếu là `false`.
zh_cn: 若要再加入最后一点小功能，在 `.rotation3DEffect` 修饰符的 `angle` 参数中创建一个条件值，然后将它设成 `isScaled` 为 `true` 时使用 `Angle(degrees: 0)`，为 `false` 时使用 `Angle(degrees: 360)`。
zh_tw: 加入一項最後的小天賦，在 `.rotation3DEffect` 修飾符的 `angle` 參數中建立一個條件值，如果 `isScaled` 為 `true`，則將其設定為 `Angle(degrees: 0)`，如果為 `false` 則設定為 `Angle(degrees: 360)`。

source: You’ll use the [ternary conditional operator](glossary://ternary%20conditional%20operator) to do this.
de: Dafür verwendest du den [dreigliedrigen bedingten Operator](glossary://ternary%20conditional%20operator).
es: Para hacer esto usarás el [operador condicional ternario](glossary://ternary%20conditional%20operator).
es_419: Usarás el [operador condicional ternario](glossary://ternary%20conditional%20operator) para hacer esto.
fr: Pour cela, tu utiliseras l’[opérateur conditionnel ternaire](glossary://ternary%20conditional%20operator).
it: Potrai personalizzare la tua vista utilizzando l'[operatore condizionale ternario](glossary://ternary%20conditional%20operator).
nl: Je gaat de [driedelige voorwaardelijke operator](glossary://ternary%20conditional%20operator) gebruiken om dit te doen.
no: Du bruker den [tredoble betingede operatoren](glossary://ternary%20conditional%20operator) for å gjøre dette.
pt: Para fazer isso, você vai usar o [operador condicional ternário](glossary://ternary%20conditional%20operator).
sv: Du använder den [trefaldiga villkorliga operatorn](glossary://ternary%20conditional%20operator) till att göra detta.
th: คุณจะใช้[ตัวดำเนินการเงื่อนไขแบบสามส่วน](glossary://ternary%20conditional%20operator)เพื่อทำสิ่งนี้
tr: Bunu yapmak için [üçlü koşullu işleci](glossary://ternary%20conditional%20operator) kullanacaksın.
vi: Bạn sẽ sử dụng [toán tử điều kiện tam phân](glossary://ternary%20conditional%20operator) để thực hiện việc này.
zh_cn: 你将使用[三元条件运算符](glossary://ternary%20conditional%20operator)来完成这个任务。
zh_tw: 你將使用 [三元條件運算子](glossary://ternary%20conditional%20operator)來執行此操作。

# GuideBook..Guide0..StepAdd a `CreatureDetail` view..TaskcustomizeCreature..title
source: Customize your `CreatureDetail` view
de: Ansicht `CreatureDetail` anpassen
es: Personalizar la vista `CreatureDetail`
es_419: Personalizar la visualización `CreatureDetail`
fr: Personnaliser la vue `CreatureDetail`
it: Personalizzare la vista `CreatureDetail`
nl: De `CreatureDetail`-weergave aanpassen
no: Tilpass `CreatureDetail`-visningen
pt: Personalize a visualização `CreatureDetail`
sv: Anpassa `CreatureDetail`-vyn
th: กำหนดมุมมอง `CreatureDetail` ของคุณ
tr: `CreatureDetail` görüntünü özelleştirme
vi: Tùy chỉnh chế độ xem `CreatureDetail` của bạn
zh_cn: 自定 `CreatureDetail` 视图
zh_tw: 自定你的 `CreatureDetail` 顯示區

source: Now that you’ve got the hang of customizing views with [user interaction](glossary://user%20interaction), try adding one more [built-in view](glossary://built-in%20view) so people can modify the `Text` view.
de: Das Anpassen von Ansichten mit der [Benutzerinteraktion](glossary://user%20interaction) hast du mittlerweile raus. Versuche nun, eine weitere [integrierte Ansicht](glossary://built-in%20view) hinzuzufügen, um es Benutzer:innen zu erlauben, die `Text`-Ansicht zu ändern.
es: Ahora que ya has aprendido a personalizar las vistas con [interacción del usuario](glossary://user%20interaction), prueba a añadir una [vista integrada](glossary://built-in%20view) más para que las personas puedan modificar la vista `Text` (texto).
es_419: Ahora que ya sabes cómo personalizar las visualizaciones con la [interacción del usuario](glossary://user%20interaction), intenta agregar otra [visualización integrada](glossary://built-in%20view) que permita a las personas modificar la visualización `Text`.
fr: Maintenant que tu as compris la personnalisation des vues avec l’[interaction utilisateur](glossary://user%20interaction), essaie d’ajouter une autre [vue intégrée](glossary://built-in%20view) pour permettre à des utilisateurs de modifier la vue `Text`.
it: Adesso che hai acquisito le basi per personalizzare le viste con l'[interazione utente](glossary://user%20interaction), prova ad aggiungere una o più [viste integrate](glossary://built-in%20view) per consentire alle persone di modificare la vista `Text`.
nl: Nu je weet hoe je weergaven aanpast via [gebruikersinteractie](glossary://user%20interaction), kun je nog een [ingebouwde weergave](glossary://built-in%20view) toevoegen waarmee gebruikers de `Text`-weergave kunnen wijzigen.
no: Nå når du kan tilpasse visninger med [brukerinteraksjon](glossary://user%20interaction), skal du prøve å legge til én [innebygd visning](glossary://built-in%20view) til som gjør det mulig for personer å endre `Text`-visningen.
pt: Agora que você pegou o jeito de personalizar visualizações com a [interação do usuário](glossary://user%20interaction), tente adicionar mais uma [visualização integrada](glossary://built-in%20view) para que as pessoas possam modificar a visualização `Text`.
sv: Nu när du kan anpassa vyer med [användarinteraktion](glossary://user%20interaction) ska du prova att lägga till ytterligare en [inbyggd vy](glossary://built-in%20view) som gör det möjligt för personer att ändra `Text`-vyn.
th: ตอนนี้เมื่อคุณเข้าใจการกำหนดมุมมองเองด้วย[การโต้ตอบของผู้ใช้](glossary://user%20interaction)แล้ว ให้ลองเพิ่ม[มุมมองในตัว](glossary://built-in%20view)อีกหนึ่งมุมมองเพื่อให้ผู้คนสามารถแก้ไขมุมมอง `Text` ได้
tr: [Kullanıcı etkileşimi](glossary://user%20interaction) ile görüntüleri özelleştirmeyi kavradığına göre kişilerin `Text` görüntüsünü değiştirebilmeleri için bir tane daha [yerleşik görüntü](glossary://built-in%20view) eklemeyi dene.
vi: Bây giờ bạn đã hiểu cách tùy chỉnh các chế độ xem với [tương tác của người dùng](glossary://user%20interaction), hãy thử thêm một [chế độ xem tích hợp](glossary://built-in%20view) nữa để mọi người có thể sửa đổi chế độ xem `Text`.
zh_cn: 现在你掌握了使用[用户交互](glossary://user%20interaction)自定视图的诀窍，那么尝试再添加一个[内建视图](glossary://built-in%20view)，这样用户可以修改 `Text` 视图。
zh_tw: 現在你已經掌握了透過[使用者互動](glossary://user%20interaction)自訂顯示區的訣竅，請試著再加入一個[內建顯示區](glossary://built-in%20view)來讓使用者修改 `Text` 顯示區。

source: You could use a `Slider` to change the view’s width, height, blur, contrast, or saturation, a `Button` to enable a `RotationEffect`, or some other effect that you think of. Try tinkering around to see what effects you can create.
de: Du könntest den Schieberegler `Slider` verwenden, um Breite, Höhe, Weichzeichnen, Kontrast oder Sättigung der Ansicht zu ändern, die Taste `Button` nutzen, um den `RotationEffect` zu aktivieren, oder einen anderen gewünschten Effekt einsetzen. Experimentiere ein wenig herum, um herauszufinden, welche Effekte du erstellen kannst.
es: Puedes usar un `Slider` (regulador) para cambiar la anchura, la altura, el desenfoque, el contraste o la saturación de la vista, un `Button` (botón) para activar `RotationEffect`o cualquier otro efecto que se te ocurra. Prueba a trastear para ver qué efectos puedes crear.
es_419: Podrías usar el parámetro `Slider` para modificar el ancho, la altura, el difuminado, el contraste o la saturación de la visualización; o un parámetro `Button` para activar un efecto `RotationEffect`, o cualquier otro efecto que se te ocurra. Tómate un momento para explorar y descubrir qué efectos puedes crear.
fr: Tu peux utiliser un `Slider` pour modifier la largeur, la hauteur, le flou, le contraste ou la saturation de la vue, un `Button` pour activer un `RotationEffect` ou tout autre effet auquel tu peux penser. Essaie de bricoler pour voir quels effets tu peux créer.
it: Potresti usare uno `Slider` per modificare la larghezza, l'altezza, la sfocatura, il contrasto o la saturazione della vista; un `Button` per abilitare `RotationEffect` o qualsiasi altro effetto che tu voglia applicare. Prova a sperimentare per scoprire gli effetti a cui puoi dare vita.
nl: Je kunt een `Slider` gebruiken om de breedte, de hoogte, de vervaging, het contrast of de verzadiging van de weergave te wijzigen en een `Button` om een `RotationEffect` of een ander effect in te schakelen. Experimenteer om te kijken welke effecten je kunt aanmaken.
no: Du kan bruke `Slider` for å endre visningens bredde, høyde, uskarphet, kontrast eller metning, `Button` for å aktivere en `RotationEffect` eller en annen effekt du kommer på. Prøv forskjellige ting for å se hvilke effekter du kan lage.
pt: Você pode usar um `Slider` para alterar a largura, altura, desfoque, contraste ou saturação da visualização, um `Button` para ativar um `RotationEffect` ou algum outro efeito que você possa imaginar. Tente mexer por aí para ver quais efeitos você pode criar.
sv: Du kan använda `Slider` till att ändra vyns bredd, höjd, oskärpa, kontrast eller mättnad, `Button` till att aktivera `RotationEffect` eller någon annan effekt du kommer på. Prova olika saker för att se vilka effekter du kan skapa.
th: คุณอาจใช้ `Slider` เพื่อเปลี่ยนแปลงความกว้าง ความสูง ความเบลอ ความต่างระดับสี หรือความอิ่มตัวของมุมมอง, `Button` เพื่อเปิดใช้งาน `RotationEffect` หรือเอฟเฟ็กต์อื่นๆ ที่คุณคิดออก ลองดัดแปลงสิ่งต่างๆ เพื่อดูว่าคุณสามารถสร้างเอฟเฟ็กต์ใดได้บ้าง
tr: Görüntünün genişliğini, yüksekliğini, bulanıklığını, kontrastını veya doygunluğunu değiştirmek için bir `Slider`, `RotationEffect`’i veya aklına gelen başka efektleri etkinleştirmek için bir `Button` kullanabilirsin. Hangi efektleri yaratabileceğini görmek için biraz kurcalamayı dene.
vi: Bạn có thể sử dụng `Slider` để thay đổi chiều rộng, chiều cao, độ mờ, độ tương phản hay độ bão hòa của chế độ xem, một `Button` để bật một `RotationEffect` hoặc một hiệu ứng nào khác mà bạn nghĩ đến. Hãy thử thay đổi một chút để xem bạn có thể tạo ra những hiệu ứng nào.
zh_cn: 你可以使用 `Slider` 来更改视图的宽度、高度、模糊度、对比度或饱和度，使用 `Button` 来启用 `RotationEffect`（旋转效果），还可以使用一些你想要的其他效果。试着摸索一下，看看有什么你可以创建的效果。
zh_tw: 你可以使用 `Slider` 來更改顯示區的寬度、高度、模糊、對比或飽和度，使用 `Button` 來啟用 `RotationEffect` 或是你想到的其他效果。試著摸索一下，看看有什麼你可以製作的效果。

# GuideBook..Guide0..StepAdd a `CreatureDetail` view..SuccessMessage..Paragraph333
source: Excellent Work!
de: Gut gemacht!
es: ¡Buen trabajo!
es_419: ¡Excelente trabajo!
fr: Excellent travail !
it: Ottimo lavoro!
nl: Goed gedaan!
no: Bra jobbet!
pt: Excelente Trabalho!
sv: Bra jobbat!
th: เจ๋งมาก!
tr: Harika İş!
vi: Bạn thật xuất sắc!
zh_cn: 做得不错！
zh_tw: 做得好！

# GuideBook..Guide0..StepAdd a `CreatureDetail` view..SuccessMessage..Paragraph334
source: You’ve created a full-fledged app that allows you to view, add, delete, dance with, and modify creatures. Pat yourself on the back, because this was no small feat.
de: Du hast eine vollwertige App erstellt, mit der du Charaktere anzeigen, hinzufügen, löschen, ändern und tanzen lassen kannst. Du kannst stolz auf dich sein, denn das war keine leichte Aufgabe.
es: Has creado una app completa que te permite ver, añadir, eliminar, bailar con criaturas y modificarlas. Ya puedes felicitarte, porque no ha sido poca cosa.
es_419: Creaste una app completa que te permite visualizar, agregar, eliminar, hacer bailar, y modificar criaturas. Date una palmadita en la espalda, porque esto es una gran hazaña.
fr: Tu as créé une app complète qui te permet de voir, d’ajouter, de supprimer et de modifier des créatures, ainsi que de danser avec elles. Tu peux te féliciter, car ce n’est pas un mince exploit.
it: Hai creato un'app a tutto tondo che ti consente di visualizzare, aggiungere, eliminare, modificare le creature e persino di ballare con loro. Devi riconoscere che hai superato una bella sfida, ti meriti una pacca sulla spalla!
nl: Je hebt een volledig functionele app gemaakt waarmee je wezens kunt bekijken, toevoegen, verwijderen, laten dansen en aanpassen. Geef jezelf een schouderklopje want dat is een hele prestatie.
no: Du har laget en fullverdig app som gjør det mulig å vise, legge til, slette, danse med og endre skapninger. Gi deg selv en klapp på skulderen, for dette var ikke lett.
pt: Você criou um app completo que permite visualizar, adicionar, apagar, modificar criaturas e dançar com elas. Parabenize-se pois isso não foi uma tarefa fácil.
sv: Du har skapat en fullfjädrad app som gör det möjligt att visa, lägga till, radera, dansa med och ändra varelser. Ge dig själv en klapp på axeln, för det här var inte lätt.
th: คุณได้สร้างแอปที่สมบูรณ์ซึ่งคุณสามารถดู เพิ่ม ลบ เต้นรำ และแก้ไขสิ่งมีชีวิตได้ ดีใจกับตัวเองหน่อยเพราะนี่ไม่ใช่ความสำเร็จเล็กๆ เลย
tr: Yaratıkları görüntülemene, eklemene, silmene, değiştirmene ve onlarla dans etmene olanak sağlayan tam teşekküllü bir uygulama yarattın. Kendinle gurur duy, hiç de kolay değildi.
vi: Bạn đã tạo ra một ứng dụng đầy đủ chức năng, cho phép bạn xem, thêm, xóa, khiêu vũ và sửa đổi các sinh vật. Hãy dành cho chính bạn một sự khen ngợi, vì đây là một thành tích không hề nhỏ.
zh_cn: 你已经创建了一个成熟的 App，可让你查看、添加、删除和修改动物，以及与它们共舞。表扬一下自己吧，这可不是一件小事。
zh_tw: 你已經製作了一個成熟的 App，能讓你檢視、加入、刪除、與生物共舞和修改生物。鼓勵一下自己吧，因為這可不是一件小事呢。
