Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Create a view that uses a built-in `Slider` to change the width of a `Rectangle` view. To accomplish this, you’ll need to define a new [state property](glossary://state%20property), and pass it into the `Slider` as a [binding](glossary://binding).
de: Erstelle eine Ansicht, die den integrierten `Slider` verwendet, um die Breite einer `Rectangle`-Ansicht zu ändern. Dafür musst du eine neue [Statuseigenschaft](glossary://state%20property) definieren und diese als eine [Bindung](glossary://binding) an `Slider` übergeben.
es: Crea una vista que use una vista `Slider` integrada para cambiar la anchura de un rectángulo (`Rectangle`). Para ello, deberás definir una nueva [propiedad de estado](glossary://state%20property) y pasarla a `Slider` como una [vinculación](glossary://binding).
es_419: Crea una visualización que use un `Slider` (regulador) integrado para cambiar el ancho de una visualización `Rectangle`. Para lograr esto, necesitarás definir una nueva [propiedad de estado](glossary://state%20property), y pasarla al `Slider` como una [ligadura](glossary://binding).
fr: Crée une vue qui utilise un `Slider` intégré pour changer la largeur d’une vue `Rectangle`. Pour accomplir cela, tu dois définir une nouvelle [propriété d’état](glossary://state%20property) et la transmettre au `Slider` en tant qu’[association](glossary://binding).
it: Crea una vista che utilizza lo `Slider` integrato per modificare la larghezza di una vista `Rectangle`. Per fare questo dovrai definire una nuova [proprietà di stato](glossary://state%20property) e trasmetterla nello `Slider` come [vincolo](glossary://binding).
nl: Maak een weergave aan die een ingebouwde `Slider` gebruikt om de breedte van een `Rectangle`-weergave te wijzigen. Om dit te kunnen doen, moet je een nieuwe [statuseigenschap](glossary://state%20property) definiëren en deze doorgeven aan de `Slider` als een [binding](glossary://binding).
no: Opprett en visning som bruker en innebygd `Slider` til å endre bredden på en `Rectangle`-visning. For å kunne gjøre dette må du definere en ny [statusegenskap](glossary://state%20property) og overføre den til `Slider` som en [binding](glossary://binding).
pt: Crie uma visualização que use um `Slider` integrado para mudar a largura de uma visualização `Rectangle`. Para conseguir isso, você precisa definir uma nova [propriedade de estado](glossary://state%20property) e passá‑la para o `Slider` como um [vínculo](glossary://binding).
sv: Skapa en vy som använder en inbyggd `Slider` till att ändra bredden på en `Rectangle`-vy. För att kunna göra detta måste du definiera en ny [statusegenskap](glossary://state%20property) och överföra den till `Slider` som en [koppling](glossary://binding).
th: สร้างมุมมองที่ใช้ `Slider` ในตัวเพื่อเปลี่ยนความกว้างของมุมมอง `Rectangle` ในการทำสิ่งนี้ให้สำเร็จ คุณจะต้องกำหนด[คุณสมบัติสถานะ](glossary://state%20property)ใหม่ แล้วส่งผ่านไปยัง `Slider` เป็น[การรวม](glossary://binding)
tr: `Rectangle` görüntüsünün genişliğini değiştirmek için yerleşik `Slider` kullanan bir görüntü yarat. Bunu başarmak için yeni bir [durum özelliği](glossary://state%20property) tanımlaman ve `Slider`’a [bağlama](glossary://binding) olarak geçirmen gerekecek.
vi: Tạo ra một chế độ xem sử dụng một `Slider` tích hợp để thay đổi chiều rộng của chế độ xem `Rectangle`. Để hoàn thành việc này, bạn sẽ cần định nghĩa một [thuộc tính trạng thái](glossary://state%20property) mới và chuyển thuộc tính đó vào `Slider` dưới dạng một [ràng buộc](glossary://binding).
zh_cn: 创建一个使用内建 `Slider` 更改 `Rectangle` 视图宽度的视图。若要这样做，你需要定义新的[状态属性](glossary://state%20property)，然后将它作为[绑定](glossary://binding)传入 `Slider`。
zh_tw: 製作一個使用內建 `Slider` 的顯示區來更改 `Rectangle` 顯示區的寬度。為此，你需要定義一個新的[狀態屬性](glossary://state%20property)，並將它傳入 `Slider` 作為[綁定](glossary://binding)。

source: You can change a view’s width with the `.frame(width:)` modifier. Note: This modifier accepts a [Double](doc://com.apple.documentation/documentation/swift/double) value (a special [type](glossary://type) of number value), so define your state property as a `Double`.
de: Du kannst die Breite einer Ansicht mit dem Modifikator `.frame(width:)` ändern. Hinweis: Dieser Modifikator akzeptiert einen [Double](doc://com.apple.documentation/documentation/swift/double)-Wert (einen speziellen Zahlenwert-[Typ](glossary://type)). Definiere deine Statuseigenschaft am besten als `Double`.
es: Puedes cambiar la anchura de una vista con el modificador `.frame(width:)`. Nota: Este modificador acepta un valor [doble](doc://com.apple.documentation/documentation/swift/double) (un [tipo](glossary://type) especial de valor numérico), así que define tu propiedad de estado como `Double` (doble).
es_419: Puedes cambiar el ancho de una visualización con el modificador `.frame(width:)`. Nota: este modificador acepta un valor [Double](doc://com.apple.documentation/documentation/swift/double) (un [tipo](glossary://type) especial de valor numérico), así que debes definir la propiedad de estado como `Double`.
fr: Tu peux modifier la largeur d’une vue avec le modificateur `.frame(width:)`. Remarque : ce modificateur accepte une valeur [Double](doc://com.apple.documentation/documentation/swift/double) (un [type](glossary://type) spécial de valeur numérique), alors définis ta propriété d’état comme un `Double`.
it: Puoi modificare la larghezza di una vista utilizzando il modificatore `.frame(width:)`. Nota: questo modificatore accetta un valore [Double](doc://com.apple.documentation/documentation/swift/double) (un [tipo](glossary://type) speciale di valore numerico). Definisci dunque la proprietà di stato come un `Double`.
nl: Je kunt de breedte van een weergave wijzigen met de modifier `.frame(width:)`. Opmerking: deze modifier ontvangt een waarde van het type [Double](doc://com.apple.documentation/documentation/swift/double) (een speciaal [type](glossary://type) getal), dus definieer je statuseigenschap als een `Double`.
no: Du kan endre en visnings bredde med modifikatoren `.frame(width:)`. Merk: Denne modifikatoren godtar en [Double](doc://com.apple.documentation/documentation/swift/double)-verdi (en bestemt [type](glossary://type) tallverdi), så definer statusegenskapen som en `Double`.
pt: É possível mudar a largura de uma visualização com o modificador `.frame(width:)`. Note que esse modificador aceita um valor [Double](doc://com.apple.documentation/documentation/swift/double) (um [tipo](glossary://type) especial de valor numérico), portanto, defina a propriedade de estado como `Double`.
sv: Du kan ändra en vys bredd med modifieraren `.frame(width:)`. Obs! Den här modifieraren tar emot ett [Double](doc://com.apple.documentation/documentation/swift/double)-värde (en särskild [typ](glossary://type) av numeriskt värde), så definiera statusegenskapen som en `Double`.
th: คุณสามารถเปลี่ยนความกว้างของมุมมองได้ด้วยปุ่มปรับค่า `.frame(width:)` หมายเหตุ: ปุ่มปรับค่านี้ยอมรับค่า [Double](doc://com.apple.documentation/documentation/swift/double) (ค่าตัวเลข[ประเภท](glossary://type)พิเศษ) ดังนั้นให้กำหนดคุณสมบัติสถานะของคุณเป็น `Double`
tr: Bir görüntünün genişliğini `.frame(width:)` niteleyicisi ile değiştirebilirsin. Not: Bu niteleyici, bir [Double](doc://com.apple.documentation/documentation/swift/double) değerini (sayı değerinin özel bir [tipi](glossary://type)) kabul ediyor; o nedenle durum özelliğini `Double` olarak tanımla.
vi: Bạn có thể thay đổi chiều rộng của một chế độ xem bằng trình sửa đổi `.frame(width:)`. Lưu ý: Trình sửa đổi này chấp nhận một giá trị [Double](doc://com.apple.documentation/documentation/swift/double) (một [kiểu](glossary://type) giá trị số đặc biệt), nên bạn hãy định nghĩa thuộc tính trạng thái dưới dạng một `Double`.
zh_cn: 你可以使用 `.frame(width:)`（边框宽度）修饰符更改视图的宽度。请注意，这个修饰符接受 [Double](doc://com.apple.documentation/documentation/swift/double) 值（一个特殊的数值[类型](glossary://type)），因此，将你的状态属性定义为 `Double`。
zh_tw: 你可以使用 `.frame(width:)` 修飾符來更改顯示區的寬度。請注意：此修飾符接受 [Double](doc://com.apple.documentation/documentation/swift/double) 值（特殊的[類型](glossary://type)數值）。因此，請將你的狀態屬性定義為 `Double`。

source: Take a moment to try this out on your own, using the following hints if you get stuck.
de: Nimm dir einen Moment Zeit und probiere es alleine. Wenn du nicht weiterkommst, kannst du diese Tipps verwenden.
es: Tómate un momento para probarlo por tu cuenta, usando las siguientes pistas si te atascas.
es_419: Tómate un momento para intentar hacerlo por tu cuenta, y usa las siguientes pistas si tienes problemas.
fr: Prends un moment pour essayer de faire cela par toi-même, en utilisant les astuces suivantes si tu es bloqué.
it: Prenditi del tempo per provare a sviluppare questo codice autonomamente. Se non riesci ad andare avanti puoi utilizzare i suggerimenti di seguito.
nl: Neem even de tijd om dit zelf te proberen. Gebruik de volgende tips als je vast komt te zitten.
no: Ta deg tid til å prøve dette på egen hånd, og bruk følgende hint hvis du sitter fast.
pt: Tire um tempo para experimentar isso por conta própria e use as dicas a seguir caso não consiga sair do lugar.
sv: Ägna en stund åt att prova det här på egen hand och använd följande tips ifall du kör fast.
th: ใช้เวลาสักครู่เพื่อลองทำสิ่งนี้ด้วยตัวคุณเองโดยใช้คำใบ้ต่อไปนี้หากคุณไปต่อไม่ได้
tr: Bir dakika dur ve bunu kendi başına dene, sıkışırsan aşağıdaki ipuçlarını kullan.
vi: Hãy dành giây lát để cố gắng tự mình thực hiện việc này, sử dụng các gợi ý sau đây nếu bạn bị vướng mắc.
zh_cn: 自己花点时间尝试一下，遇到困难时可使用以下提示。
zh_tw: 花一點時間自己嘗試一下，如果遇到困難，請使用以下提示。

source: Define a state property of type `Double` above the `body` of the view. This is your local [source of truth](glossary://source%20of%20truth).
de: Definiere eine Statuseigenschaft des Typs `Double` über dem Hauptteil `body` der Ansicht. Dies ist deine lokale [Wahrheitsquelle](glossary://source%20of%20truth).
es: Define una propiedad de estado de tipo `Double` (doble) encima del cuerpo (`body`) de la vista. Esta es tu [fuente de datos](glossary://source%20of%20truth) local.
es_419: Define una propiedad de estado del tipo `Double` encima del `body` de la visualización. Esta es tu [fuente de la verdad](glossary://source%20of%20truth) local.
fr: Définis une propriété d’état de type `Double` au-dessus du `body` de la vue. Il s’agit de ta [source de vérité](glossary://source%20of%20truth) locale.
it: Definisci la proprietà di stato di tipo `Double` sopra il `body` della vista. Questa è la tua [sorgente univoca](glossary://source%20of%20truth) locale.
nl: Definieer een statuseigenschap van het type `Double` boven de `body` van de weergave. Dit is je lokale [bron van waarheid](glossary://source%20of%20truth).
no: Definer en statusegenskap av typen `Double` ovenfor `body` i visningen. Dette er den lokale [sannhetskilden](glossary://source%20of%20truth).
pt: Defina uma propriedade de estado do tipo `Double` acima do `body` (corpo) da visualização. Esta é a sua [fonte da verdade](glossary://source%20of%20truth) local.
sv: Definiera en statusegenskap av typen `Double` ovanför `body` i vyn. Det här är den lokala [sanningskällan](glossary://source%20of%20truth).
th: กำหนดคุณสมบัติสถานะของประเภท `Double` เหนือ `body` ของมุมมอง นี่จะเป็น[แหล่งข้อมูลจริง](glossary://source%20of%20truth)ภายในของคุณ
tr: Görüntünün gövdesinin (`body`) üstündeki `Double` tipinin durum özelliğini tanımla. Bu senin yerel [gerçeklik kaynağındır](glossary://source%20of%20truth).
vi: Định nghĩa một thuộc tính trạng thái thuộc kiểu `Double` phía trên `body` của chế độ xem. Đây là [nguồn chân lý](glossary://source%20of%20truth) cục bộ của bạn.
zh_cn: 在视图的 `body` 上方定义一个 `Double` 类型的状态属性。这是你的本地[可信源](glossary://source%20of%20truth)。
zh_tw: 在顯示區的 `body` 上方定義一個 `Double` 類型的狀態屬性。這是你的區域[真實來源](glossary://source%20of%20truth)。

source: Create your `Slider`, using the initializer `Slider(value:)`. Pass in a [binding](glossary://binding) to your [state property](glossary://state%20property).
de: Erstelle den `Slider` mit der Initialisierung `Slider(value:)`. Übergib eine [Bindung](glossary://binding) an die [Statuseigenschaft](glossary://state%20property).
es: Crea tu regulador (`Slider`), usando el inicializador `Slider(value:)`. Pasa una [vinculación](glossary://binding) a tu [estado de propiedad](glossary://state%20property).
es_419: Crea tu `"Slider"`, utilizando el inicializador `"Slider(value:)"`, y pasa una [ligadura](glossary://binding) a tu [propiedad de estado](glossary://state%20property).
fr: Crée ton `Slider` en utilisant l’initialiseur `Slider(value:)`. Transmets une [association](glossary://binding) à ta [propriété d’état](glossary://state%20property).
it: Crea il tuo `Slider`, utilizzando l'inizializzatore `Slider(value:)`. Trasmetti un [vincolo](glossary://binding) alla tua [proprietà di stato](glossary://state%20property).
nl: Maak de `Slider` aan met behulp van de initializer `Slider(value:)`. Geef een [binding](glossary://binding) door aan je [statuseigenschap](glossary://state%20property).
no: Opprett en `Slider` med initialisereren `Slider(value:)`. Overfør en [binding](glossary://binding) til [statusegenskapen](glossary://state%20property).
pt: Crie o seu `Slider` usando o inicializador `Slider(value:)`. Passe um [vínculo](glossary://binding) para a sua [propriedade de estado](glossary://state%20property).
sv: Skapa en `Slider` med initieraren `Slider(value:)`. Överför en [koppling](glossary://binding) till [statusegenskapen](glossary://state%20property).
th: สร้าง `Slider` ของคุณโดยใช้ตัวเริ่มต้น `Slider(value:)` ส่งผ่าน[การรวม](glossary://binding)ไปยัง[คุณสมบัติสถานะ](glossary://state%20property)ของคุณ
tr: `Slider(value:)` ilk değer atayıcısını kullanarak `Slider`'ını yarat. [Durum özelliğine](glossary://state%20property) bir [bağlama](glossary://binding) geçir.
vi: Tạo ra `Slider` của bạn, sử dụng trình khởi tạo `Slider(value:)`. Chuyển vào một [ràng buộc](glossary://binding) cho [thuộc tính trạng thái](glossary://state%20property) của bạn.
zh_cn: 使用构造器 `Slider(value:)`（滑块值）创建 `Slider`。将[绑定](glossary://binding)传入[状态属性](glossary://state%20property)。
zh_tw: 使用初始化程式 `Slider(value:)` 建立你的 `Slider`。將[綁定](glossary://binding)傳入你的[狀態屬性](glossary://state%20property)。

source: Create a `Rectangle` and add the `.frame(width:)` modifier to it. Since the value of a default slider ranges from `0` to `1`, multiply the width by a larger number so you can notice the changes to the value.
de: Erstelle mit `Rectangle` ein Rechteck und füge den Modifikator `.frame(width:)` zu ihm hinzu. Da der Wert eines Standardschiebereglers von `0` bis `1` reicht, solltest du die Breite mit einer größeren Zahl multiplizieren, damit du die Wertänderungen auch bemerkst.
es: Crea un rectángulo (`Rectangle`) y añádele el modificador `.frame(width:)`. Dado que el valor por omisión de un regulador está entre `0` y `1`, multiplica la anchura por un número mayor para que puedas notar los cambios en el valor.
es_419: Crea una visualización `Rectangle` y agrégale el modificador `.frame(width:)`. Dado que el valor de un regulador predeterminado varía entre `0` y `1`, multiplica el ancho por un número mayor para que puedas ver los cambios en el valor.
fr: Crée un `Rectangle` et ajoute-lui le modificateur `.frame(width:)`. Puisque la valeur d’un curseur par défaut est comprise entre `0` et `1`, multiplie la largeur par un nombre plus grand pour que tu puisses remarquer les changements de la valeur.
it: Crea un `Rectangle` e aggiungi il modificatore `.frame(width:)`. Poiché il valore di un cursore di default è compreso tra `0` e `1`, moltiplica la larghezza per un numero più grande, in modo che i cambiamenti del valore siano più evidenti.
nl: Maak een `Rectangle` aan en voeg de modifier `.frame(width:)` er aan toe. Omdat de waarde van een standaardschuifknop varieert van `0` tot `1`, moet je de breedte met een groter getal vermenigvuldigen om de verandering van de waarde te kunnen zien.
no: Opprett en `Rectangle`, og legg til modifikatoren `.frame(width:)` i den. Siden verdien for en standard skyveknapp varierer fra `0` til `1`, bør du multiplisere bredden med et større tall, slik at du legger merke til endringer av verdien.
pt: Crie um `Rectangle` e adicione o modificador `.frame(width:)` a ele. Já que o valor de um controle deslizante padrão varia de `0` a `1`, multiplique a largura por um número maior para que você possa notar mudanças no valor.
sv: Skapa en `Rectangle` och lägg till modifieraren `.frame(width:)` i den. Eftersom värdet för ett förvalt reglage varierar från `0` till `1` bör du multiplicera bredden med ett större tal så att du lägger märke till ändringar av värdet.
th: สร้าง `Rectangle` แล้วเพิ่มปุ่มปรับค่า `.frame(width:)` เนื่องจากค่าของแถบเลื่อนเริ่มต้นอยู่ระหว่าง `0` ถึง `1` ให้คูณความกว้างด้วยตัวเลขที่มากกว่าเพื่อให้คุณสังเกตการเปลี่ยนแปลงของค่าได้
tr: Bir `Rectangle` yarat ve ona `.frame(width:)` niteleyicisini ekle. Saptanmış sürgü değeri `0` ila `1` aralığında olduğundan değerdeki değişiklikleri fark edebilmen için genişliği daha büyük bir sayıyla çarp.
vi: Tạo ra một `Rectangle` và thêm trình sửa đổi `.frame(width:)` vào đó. Vì giá trị của thanh trượt mặc định nằm trong phạm vi từ `0` đến `1` nên hãy nhân chiều rộng với một số lớn hơn để bạn có thể nhận thấy những sự thay đổi đối với giá trị.
zh_cn: 创建 `Rectangle` 并给它添加 `.frame(width:)` 修饰符。由于默认滑块值的范围是 `0` 到 `1`，你可以将宽度乘以一个较大的数值，这样更容易看出值的更改。
zh_tw: 建立一個 `Rectangle` 並為它加入一個 `.frame(width:)` 修飾符。由於預設滑桿的值介於 `0` 到 `1` 之間，所以請將寬度乘以較大的數字，以便你能夠發現到值的變化。

source: Create a story
de: Eine Geschichte erstellen
es: Crear una historia
es_419: Crear una historia
fr: Créer une histoire
it: Creare una storia
nl: Een verhaal maken
no: Opprett en historie
pt: Crie uma história
sv: Skapa en berättelse
th: สร้างเรื่องราว
tr: Hikâye yaratma
vi: Tạo ra một câu chuyện
zh_cn: 创建故事
zh_tw: 創作故事

source: Here’s another experiment for you to try:
de: Hier ist ein weiteres Experiment für dich:
es: Aquí tienes otro experimento para que lo pruebes:
es_419: Puedes intentar el siguiente experimento:
fr: Voici une autre expérience que tu peux essayer :
it: Ecco un altro esperimento da provare:
nl: Hier is nog een experiment dat je kunt proberen:
no: Her er et annet eksperiment du kan prøve:
pt: Aqui está mais um experimento para você fazer:
sv: Här är ett annat experiment du kan prova:
th: นี่เป็นอีกการทดลองหนึ่งให้คุณได้ลอง:
tr: İşte denemen için başka bir deney daha:
vi: Đây là một thử nghiệm khác để bạn thử:
zh_cn: 这里有另一个你可以尝试的试验：
zh_tw: 這裡有另一個你可以嘗試的實驗：

source: You can use the SwiftUI [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) to change `String` values based upon the characters a person types into the field.
de: Du kannst das SwiftUI-[TextField](doc://com.apple.documentation/documentation/swiftui/textfield) verwenden, um `String`-Werte auf Basis der Zeichen zu ändern, die Benutzer:innen in das Feld eingeben.
es: Puedes usar [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) de SwiftUI para cambiar los valores de `String` en función de los caracteres que una persona escriba en el campo.
es_419: Puedes usar la visualización [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) de SwiftUI para cambiar valores del tipo `String` según los caracteres que una persona ingrese en los campos.
fr: Tu peux utiliser la commande [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) de SwiftUI pour changer les valeurs `String` en fonction des caractères qu’une personne saisit dans le champ.
it: Puoi utilizzare [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) di SwiftUI per cambiare i valori di `String` sulla base dei caratteri che una persona digita nel campo.
nl: Je kunt het [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) van SwiftUI gebruiken om `String`-waarden te wijzigen op basis van de tekens die een [gebruiker](glossary://user) in het veld typt.
no: Du kan bruke SwiftUIs [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) til å endre `String`-verdier basert på tegnene som en person skriver i feltet.
pt: Você pode usar o [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) da SwiftUI para mudar os valores de `String` com base nos caracteres que uma pessoa digita no campo.
sv: Du kan använda SwiftUI:s [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) till att ändra `String`-värden baserade på de tecken som en person skriver i fältet.
th: คุณสามารถใช้ [TextField](doc://com.apple.documentation/documentation/swiftui/textfield)ของ SwiftUI เพื่อเปลี่ยนค่า `String` ตามอักขระที่คนป้อนลงในช่องได้
tr: `String` değerlerini bir kişinin alana yazdığı karakterlere göre değiştirmek için SwiftUI [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) öğesini kullanabilirsin.
vi: Bạn có thể sử dụng [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) của SwiftUI để thay đổi các giá trị `String` dựa trên các ký tự mà một người nhập vào trường.
zh_cn: 你可以使用 SwiftUI [TextField](doc://com.apple.documentation/documentation/swiftui/textfield)，根据用户键入到栏中的字符来更改 `String` 值。
zh_tw: 你可以使用 SwiftUI [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) 依據使用者在欄位中輸入的字元來更改 `String` 值。
