Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Create a customizable story by defining multiple [state properties](glossary://state%20property) along with corresponding `TextField` views to allow someone to enter data like their name, a hobby, and a favorite food.
de: Erstelle eine anpassbare Geschichte, indem du mehrere [Statuseigenschaften](glossary://state%20property) zusammen mit den zugehörigen `TextField`-Ansichten definierst, um Benutzer:innen das Eingeben von Daten zu ermöglichen, z. B. Namen, Hobbys und Lieblingsessen.
es: Crea una historia personalizable definiendo varias [propiedades de estado](glossary://state%20property) junto con las correspondientes vistas `TextField` para permitir que alguien introduzca datos como su nombre, una afición y una comida favorita.
es_419: Crea una historia personalizable definiendo varias [propiedades de estado](glossary://state%20property) junto con las visualizaciones `TextField` correspondientes que permitan a una persona ingresar datos, como su nombre, pasatiempos y comida favorita.
fr: Crée une histoire personnalisable en définissant plusieurs [propriétés d’état](glossary://state%20property) ainsi que les vues `TextField` correspondantes pour autoriser quelqu’un à entrer des données telles que son nom, un passe-temps et un aliment préféré.
it: Crea una storia personalizzabile definendo più [proprietà di stato](glossary://state%20property) insieme alle viste `TextField` corrispondenti, per consentire di inserire dati come il nome, un hobby e il cibo preferito.
nl: Maak een verhaal dat kan worden aangepast door meerdere [statuseigenschappen](glossary://state%20property) en corresponderende `TextField`-weergaven te definiëren waarmee gebruikers gegevens zoals hun naam, een hobby en hun favoriete gerecht kunnen invoeren.
no: Opprett en tilpassbar historie ved å definere flere [statusegenskaper](glossary://state%20property) sammen med tilsvarende `TextField`-visninger, slik at noen kan legge inn data, for eksempel navnet sitt, en hobby og favorittmat.
pt: Crie uma história personalizável. Para fazer isso, defina várias [propriedades de estado](glossary://state%20property) junto com as visualizações `TextField` correspondentes para permitir que uma pessoa digite dados como nome, um hobby e uma comida preferida.
sv: Skapa en anpassningsbar berättelse genom att definiera flera [statusegenskaper](glossary://state%20property) tillsammans med motsvarande `TextField`-vyer så att någon kan mata in data, exempelvis sitt namn, en hobby och favoritmat.
th: สร้างเรื่องราวที่กำหนดเองได้โดยกำหนด[คุณสมบัติสถานะ](glossary://state%20property)หลายรายการพร้อมกับมุมมอง `TextField` ที่เกี่ยวข้องเพื่อให้คนสามารถป้อนข้อมูลต่างๆ เช่น ชื่อ งานอดิเรก และอาหารโปรดของตัวเองได้
tr: Bir kişinin adı, hobisi ve en sevdiği yiyecek gibi verileri girmesine izin vermek için karşılık gelen `TextField` görüntülerinin yanı sıra birden fazla [durum özelliği](glossary://state%20property) tanımlayarak özelleştirilebilir bir hikâye yarat.
vi: Tạo ra một câu chuyện có thể tùy chỉnh bằng cách định nghĩa nhiều [thuộc tính trạng thái](glossary://state%20property) cùng với các chế độ xem `TextField` tương ứng để cho phép một người nào đó nhập dữ liệu như tên, sở thích và món ăn ưa thích của họ.
zh_cn: 定义多个[状态属性](glossary://state%20property)以及相应的 `TextField` 视图来创建一个自定故事，以允许用户输入名字、爱好和爱吃的食物等数据。
zh_tw: 定義多個[狀態屬性](glossary://state%20property)和相應的 `TextField` 顯示區來創作可自訂的故事，並允許使用者輸入他們的姓名、嗜好和最喜歡的食物等資料。

source: Below the text fields, create a `Text` view that merges all of the values together using [string interpolation](glossary://string%20interpolation) to create a story. It might look something like this:
de: Erstelle unter den Textfeldern eine `Text`-Ansicht, die alle Werte per [Stringinterpolation](glossary://string%20interpolation) zusammenführt, um eine Geschichte zu erzeugen. Das Ganze könnte ungefähr so aussehen:
es: Debajo de los campos de texto, crea una vista `Text` que combine todos los valores usando la [interpolación de cadenas](glossary://string%20interpolation) para crear una historia. Podría ser algo así:
es_419: Debajo de los campos de texto, crea una visualización `Text` que fusione todos los valores utilizando la [interpolación de strings](glossary://string%20interpolation) para crear una historia. Podría verse más o menos así:
fr: Sous les champs de texte, crée une vue `Text` qui fusionne toutes les valeurs ensemble avec une [interpolation de chaîne](glossary://string%20interpolation) pour créer une histoire. Voilà à quoi cela peut ressembler :
it: Sotto i campi di testo, crea una vista `Text` che unisca tutti i valori utilizzando l'[interpolazione stringa](glossary://string%20interpolation) per creare una storia. Il risultato potrebbe essere simile a questo:
nl: Maak onder de tekstvelden een `Text`-weergave aan waarin alle waarden worden samengevoegd met behulp van [stringinterpolatie](glossary://string%20interpolation) om een verhaal te maken. Dit kan er bijvoorbeeld zo uitzien:
no: Nedenfor tekstfeltene oppretter du en `Text`-visning som slår sammen alle verdiene ved hjelp av [strenginterpolering](glossary://string%20interpolation) for å lage en historie. Det kan se ut omtrent som dette:
pt: Abaixo dos campos de texto, crie uma visualização `Text` que combine todos os valores usando [interpolação de string](glossary://string%20interpolation) para criar uma história. Mais ou menos assim:
sv: Nedanför textfälten skapar du en `Text`-vy som slår ihop alla värden med hjälp av [sträng­interpolering](glossary://string%20interpolation) för att skapa en berättelse. Det kan se ut ungefär så här:
th: ใต้ช่องข้อความ ให้สร้างมุมมอง `Text` ที่ผสานค่าทั้งหมดเข้าด้วยกันโดยใช้[การสอดแทรกสตริง](glossary://string%20interpolation)เพื่อสร้างเรื่องราว ซึ่งอาจมีลักษณะดังนี้:
tr: Metin alanlarının altında, hikâye yaratmak için [dizgiye ara değer eklemeyi](glossary://string%20interpolation) kullanarak tüm değerleri birleştiren bir `Text` görüntüsü yarat. Şunun gibi görünebilir:
vi: Bên dưới các trường văn bản, hãy tạo ra một chế độ xem `Text` hợp nhất tất cả các giá trị cùng nhau bằng [nội suy chuỗi](glossary://string%20interpolation) để tạo ra một câu chuyện. Chế độ xem đó có thể trông giống như sau:
zh_cn: 在文本栏下方，创建一个 `Text` 视图，它使用[字符串插值](glossary://string%20interpolation)将所有值合并在一起以创建故事。它看起来应该像这样：
zh_tw: 在文字欄位下方製作一個 `Text` 顯示區，這個顯示區使用[字串插值](glossary://string%20interpolation)將所有的值合併在一起來創作故事。它看起來可能像這樣：

source: Text("Hello, my name is \(name), my favorite hobby is \(hobby) and I can't stop eating \(favoriteFood)!")
de: Text("Hallo, mein Name ist \(name), mein Lieblingshobby ist \(hobby) und ich kann von \(favoriteFood) nicht genug bekommen!")
es: Text("Hola, me llamo \(name), mi afición favorita es \(hobby) ¡y no puedo dejar de comer \(favoriteFood)!")
es_419: Text("Hola, mi nombre es \(name), mi pasatiempo favorito es \(hobby) y no puedo parar de comer \(favoriteFood)!")
fr: Text("Bonjour, je m’appelle \(name), mon passe-temps préféré est \(hobby) et j’adore manger \(favoriteFood) !")
it: Text("Ciao, mi chiamo \(name), il mio hobby è \(hobby) e mangio \(favoriteFood) in quantità!")
nl: Text("Hallo, ik heet \(name), mijn favoriete hobby is \(hobby) en ik eet graag \(favoriteFood)!")
no: Text("Hei, jeg heter \(name), favoritthobbyen min er \(hobby), og jeg klarer ikke å la være å spise \(favoriteFood)!")
pt: Text("Olá, me chamo \(name), meu hobby favorito é \(hobby) e adoro comer \(favoriteFood)!")
sv: Text("Hej! Jag heter \(name), min favorithobby är \(hobby) och jag vill bara äta \(favoriteFood)!")
th: Text("สวัสดี ฉันชื่อ \(name) งานอดิเรกของฉันคือ \(hobby) และฉันหยุดกิน \(favoriteFood) ไม่ได้เลย!")
tr: Text("Merhaba, adım \(name), en sevdiğim hobi \(hobby) ve yemeden duramıyorum \(favoriteFood)!")
vi: Text("Xin chào, tên tôi là \(name), sở thích của tôi là \(hobby) và tôi rất thích ăn \(favoriteFood)!")
zh_cn: Text("你好，我的名字叫\(name)，我的爱好是\(hobby)，我超喜欢吃\(favoriteFood)！")
zh_tw: Text("哈囉，我的名字是 \(name)，我最喜歡的嗜好是 \(hobby)，我無法停止吃 \(favoriteFood)！")

source: Bonus: Add a `Button` or `Toggle` view that shows the story when you tap it.
de: Bonus: Füge eine `Button`- oder `Toggle`-Ansicht hinzu, die die Geschichte anzeigt, wenn du darauf tippst.
es: Extra: Añade una vista `Button` o `Toggle` que muestre la historia cuando la toques.
es_419: Bonus: agrega una visualización `"Button"` o `"Toggle"` que muestre la historia cuando la toques.
fr: Bonus : Ajoute une vue `Button` ou `Toggle` qui montre l’histoire lorsque tu le touches.
it: Bonus: aggiungi una vista `Button` o `Toggle` che mostri la storia quando la tocchi.
nl: Extraatje: voeg een `Button`- of `Toggle`-weergave toe waarmee je het verhaal weergeeft wanneer je erop tikt.
no: Bonus: Legg til en `Button`- eller `Toggle`-visning som viser historien når du trykker på den.
pt: Bônus: adicione uma visualização `Button` ou `Toggle` que mostre a história quando você tocar nela.
sv: Bonus: Lägg till en `Button`- eller `Toggle`-vy som visar berättelsen när du trycker på den.
th: โบนัส: เพิ่มมุมมอง `Button` หรือ `Toggle` ที่แสดงเรื่องราวเมื่อคุณแตะ
tr: Bonus: Dokunduğunda hikayeyi gösteren bir `Button` veya `Toggle` görüntüsü ekle.
vi: Bổ sung: Thêm một chế độ xem `Button` hoặc `Toggle` hiển thị câu chuyện khi bạn chạm vào.
zh_cn: 奖励：添加一个 `Button` 或 `Toggle` 视图，在你轻点它时显示故事。
zh_tw: 額外挑戰：加入一個 `Button` 或 `Toggle` 顯示區，在你點按它時顯示故事。

source: You’re getting this!
de: Gut gemacht!
es: ¡Le estás cogiendo el truco a esto!
es_419: ¡Ya le estás entendiendo!
fr: Tu apprends vite !
it: Sei sulla buona strada!
nl: Je begint het onder de knie te krijgen!
no: Du begynner å få taket på dette!
pt: Você está entendendo bem!
sv: Du börjar få kläm på det här!
th: คุณเข้าใจเรื่องนี้มากขึ้นแล้ว!
tr: Başarıyorsun!
vi: Bạn đang làm rất tốt!
zh_cn: 就快成功了！
zh_tw: 你已經掌握到技巧了！

source: You can now handle state changes locally using state properties, and between two views using bindings.
de: Du kannst jetzt Statusänderungen lokal mit Statuseigenschaften verarbeiten und sie zwischen zwei Ansichten mit Bindungen nutzen.
es: Ahora puedes controlar los cambios de estado localmente usando las propiedades de estado y pasar de una vista a otra usando vinculaciones.
es_419: Ahora puedes usar las manijas para cambiar el estado localmente usando propiedades de estado, y entre dos visualizaciones usando ligaduras.
fr: Tu peux maintenant gérer des modifications d’état localement avec des propriétés d’état, et entre deux vues avec des associations.
it: Ora puoi gestire i cambiamenti di stato in locale utilizzando le proprietà di stato e tra due viste utilizzando i vincoli.
nl: Je kunt nu statuswijzigingen lokaal verwerken met behulp van statuseigenschappen en tussen twee weergaven verwerken met behulp van bindingen.
no: Nå kan du håndtere statusendringer lokalt med statusegenskaper og mellom to visninger med bindinger.
pt: Agora você pode controlar mudanças de estado localmente usando propriedades de estado, e entre duas visualizações usando vínculos.
sv: Nu kan du hantera statusändringar lokalt med statusegenskaper och mellan två vyer med kopplingar.
th: ตอนนี้คุณสามารถจัดการกับการเปลี่ยนสถานะภายในโดยใช้คุณสมบัติสถานะ และระหว่างสองมุมมองโดยใช้การรวมได้แล้ว
tr: Artık durum özelliklerini kullanarak ve bağlamaları kullanarak iki görüntü arasında durum değişikliklerini yerel olarak işleyebilirsin.
vi: Bây giờ, bạn có thể xử lý các thay đổi trạng thái cục bộ bằng các thuộc tính trạng thái và giữa hai chế độ xem bằng các ràng buộc.
zh_cn: 你现在可以使用状态属性以及在两个视图间使用绑定来在本地处理状态更改。
zh_tw: 你現在可以使用狀態屬性來局部處理狀態更動，也可以使用綁定在兩個顯示區之間處理狀態更動。

source: Next, you’ll find out how to create data that you can use across every view of your app.
de: Als Nächstes erfährst du, wie du Daten erstellst, die in allen Ansichten der App verwendet werden können.
es: A continuación, aprenderás a crear datos que puedes usar en todas las vistas de tu app.
es_419: A continuación, descubrirás cómo crear datos que puedes usar en todas las visualizaciones de tu app.
fr: Ensuite, tu découvriras comment créer des données que tu peux utiliser dans toutes les vues de ton app.
it: Nella prossima attività, scoprirai come creare dati che puoi utilizzare in tutte le viste della tua app.
nl: Nu ga je ontdekken hoe je gegevens aanmaakt die je in elke weergave van je app kunt gebruiken.
no: Nå skal du lære deg å opprette data som kan brukes i alle visninger i en app.
pt: A seguir, você descobrirá como criar dados que podem ser usados em todas as visualizações do app.
sv: Härnäst lär du dig att skapa data som kan användas i alla vyer i en app.
th: ถัดไป คุณจะได้เรียนรู้วิธีสร้างข้อมูลที่คุณสามารถใช้ได้กับทุกมุมมองของแอป
tr: Sonra, uygulamanın tüm görüntülerinde kullanabileceğin verileri nasıl yaratacağını öğreneceksin.
vi: Tiếp theo, bạn sẽ tìm hiểu cách tạo ra dữ liệu mà bạn có thể sử dụng trên mỗi chế độ xem của ứng dụng.
zh_cn: 下一步，你将学会如何创建可在 App 的每个视图中使用的数据。
zh_tw: 接下來，你將瞭解如何製作可在 App 的每個顯示區中使用的資料。

# GuideBook..Guide0..StepNavigating in SwiftUI..title
source: Navigating in SwiftUI
de: In SwiftUI navigieren
es: Navegar por SwiftUI
es_419: Navegar en SwiftUI
fr: Navigation dans SwiftUI
it: Gestire la navigazione in SwiftUI
nl: In SwiftUI navigeren
no: Navigere i SwiftUI
pt: Navegando na SwiftUI
sv: Navigera i SwiftUI
th: การนำทางใน SwiftUI
tr: SwiftUI’da Dolaşma
vi: Điều hướng trong SwiftUI
zh_cn: 在 SwiftUI 中导航
zh_tw: 在 SwiftUI 中導覽

source: Now that you’re getting the hang of how to manage state within a single SwiftUI view, it’s time to start thinking bigger.
de: Da du dich mit dem Verwalten eines Status in einer SwiftUI-Ansicht langsam auskennst, ist es an der Zeit, den nächsten Schritt zu machen.
es: Ahora que ya sabes cómo gestionar el estado dentro de una sola vista de SwiftUI, es hora de empezar a pensar a lo grande.
es_419: Ahora que ya sabes cómo administrar el estado dentro de una sola visualización de SwiftUI, es hora de empezar a pensar en algo más grande.
fr: Maintenant que tu as compris comment gérer l’état dans une vue SwiftUI unique, il est temps de commencer à voir les choses en grand.
it: Adesso che stai iniziando a capire come gestire lo stato all'interno di una singola vista in SwiftUI, è arrivato il momento di iniziare a pensare più in grande.
nl: Nu je weet hoe je de status beheert in een afzonderlijke SwiftUI-weergave, is het tijd om groter te gaan denken.
no: Nå når du begynner å få taket på hvordan du håndterer status inni én SwiftUI-visning, er det på tide å begynne å tenke større.
pt: Agora que você está pegando o jeito de como gerenciar o estado dentro de uma única visualização de SwiftUI, é hora de começar a pensar mais longe.
sv: Nu när du börjar få kläm på hur du hanterar status inuti en enda SwiftUI-vy är det dags att börja tänka större.
th: ตอนนี้เมื่อคุณเข้าใจวิธีจัดการสถานะภายในมุมมอง SwiftUI เดียวแล้ว ก็ถึงเวลาที่จะเริ่มคิดการใหญ่มากขึ้น
tr: Tek bir SwiftUI görüntüsü içinde durumu yönetmeyi kavradığına göre, daha büyük düşünmeye başlamanın zamanı geldi.
vi: Vì bạn đã nắm được cách quản lý trạng thái bên trong một chế độ xem SwiftUI đơn nhất nên đã đến lúc bắt đầu suy nghĩ rộng hơn.
zh_cn: 既然你掌握了如何在单个 SwiftUI 视图中管理状态的诀窍，是时候思考一些更复杂的东西了。
zh_tw: 現在你已經掌握了如何在單一 SwiftUI 顯示區中管理狀態的訣竅，是時候開始思考更大的問題了。

source: In some cases when you build an app, you’ll have data that you want to share across two or more views, so even a [binding](glossary://binding) won’t be enough to handle that. You shouldn’t try to replicate the data in each new view, as this would be very difficult to keep track of, and it could lead to bugs in your app. Instead, you’ll learn how to create and maintain a single [data model](glossary://data%20model) that multiple views of your app can use.
de: In manchen Fällen hast du beim Erstellen einer App Daten, die du mit zwei oder mehreren Ansichten teilen möchtest. Um das zu ermöglichen, reicht eine [Bindung](glossary://binding) nicht aus. Du solltest nicht versuchen, die Daten in jede neue Ansicht zu kopieren, da dies schwer nachzuverfolgen ist und zu Bugs in deiner App führen kann. Du lernst stattdessen, wie du ein einzelnes [Datenmodell](glossary://data%20model) erstellst und verwaltest, das von mehreren Ansichten in der App verwendet werden kann.
es: En algunos casos, cuando creas una app, tendrás datos que quieres compartir en dos o más vistas, algo que incluso una [vinculación](glossary://binding) no es capaz de gestionar. No deberías tratar de replicar los datos en cada nueva vista, ya que esto sería muy difícil de controlar, y podría provocar errores en tu app. En su lugar, aprenderás a crear y mantener un único [modelo de datos](glossary://data%20model) que pueden usar varias vistas de la app.
es_419: En algunos casos, cuando creas una app, tendrás datos que querrás compartir en dos o más visualizaciones, por lo que incluso una [ligadura](glossary://binding) no será suficiente. No se recomienda intentar repetir los datos en cada nueva visualización, ya que esto sería muy difícil de controlar y podría ocasionar errores en tu app. En lugar de esto, aprenderás a crear y mantener un único [modelo de datos](glossary://data%20model) disponible para varias visualizaciones en tu app.
fr: Dans certains cas lorsque tu crées une app, tu disposes de données que tu veux partager entre deux vues ou davantage, et même une [association](glossary://binding) ne sera pas suffisante pour gérer cela. Tu ne dois pas essayer de répliquer les données dans chaque nouvelle vue, car il serait très difficile d’en assurer le suivi et cela pourrait entraîner des bogues dans ton app. À la place, tu apprendras comment créer et maintenir un [modèle de données](glossary://data%20model) unique que plusieurs vues de ton app peuvent utiliser.
it: Durante la creazione di un'app, ti succederà di avere dati da condividere tra due o più viste. In questi casi, non sarà sufficiente utilizzare un [vincolo](glossary://binding). Cercare di replicare i dati in tutte le viste nuove non è consigliabile, perché sarebbe troppo difficile da monitorare e potrebbe causare bug nell'app. Ti mostreremo invece come creare e aggiornare un [modello di dati](glossary://data%20model) unico che può essere utilizzato da più viste nella tua app.
nl: Als je een app bouwt, kan het voorkomen dat je gegevens met twee of meer weergaven wilt delen. Een [binding](glossary://binding) is hiervoor niet geschikt. Het is niet verstandig om de gegevens in elke nieuwe weergave te repliceren, omdat dit moeilijk bij te houden is en tot bugs in je app kan leiden. In plaats daarvan ga je leren hoe je één [gegevensmodel](glossary://data%20model) aanmaakt en onderhoudt dat door meerdere weergaven in je app kan worden gebruikt.
no: I noen tilfeller når du bygger en app, har du data som du vil dele mellom to eller flere visninger, så en [binding](glossary://binding) er ikke tilstrekkelig for å håndtere dette. Du bør ikke prøve å replikere data i hver nye visning, siden det blir vanskelig å holde oversikt over dem og det kan forårsake bugger i appen. I stedet kommer du til å lære hvordan du lager og administrerer én [datamodell](glossary://data%20model) som flere visninger i appen kan bruke.
pt: Em alguns casos, quando você criar um app, você terá dados que deseja compartilhar entre duas ou mais visualizações, de modo que nem mesmo um [vínculo](glossary://binding) poderá cuidar disso. Você não deve tentar replicar os dados em cada nova visualização, pois isso seria muito difícil de rastrear e poderia causar bugs no app. Em vez disso, você aprenderá a criar e manter um único [modelo de dados](glossary://data%20model) que pode ser usado por diversas visualizações do app.
sv: I vissa fall när du bygger en app har du data som du vill dela mellan två eller fler vyer, så en [koppling](glossary://binding) är inte tillräckligt för att hantera det. Du bör inte försöka att replikera data i varje ny vy eftersom det blir svårt att hålla koll på dem och kan orsaka buggar i appen. Instället kommer du att lära dig hur du skapar och administrerar en enda [datamodell](glossary://data%20model) som flera vyer i appen kan använda.
th: ในบางกรณีเมื่อคุณสร้างแอป คุณจะมีข้อมูลที่คุณต้องการแชร์กับสองมุมมองขึ้นไป ซึ่งแม้แต่[การรวม](glossary://binding)ก็ไม่เพียงพอที่จัดการได้ คุณไม่ควรพยายามทำซ้ำข้อมูลในมุมมองใหม่แต่ละมุมมองเนื่องจากจะทำให้ติดตามได้ยากมาก และอาจนำไปสู่บั๊กต่างๆ ในแอปของคุณ แทนที่จะทำเช่นนั้น คุณจะได้เรียนรู้วิธีสร้างและรักษา[โมเดลข้อมูล](glossary://data%20model)เดียวที่หลายมุมมองในแอปของคุณสามารถใช้ได้
tr: Bir uygulama oluşturduğun bazı durumlarda, iki veya daha fazla görüntü genelinde paylaşmak istediğin verilere sahip olacaksın; o nedenle bir [bağlama](glossary://binding) bile bunları işlemeye yeterli olmayacak. Her yeni görüntüde verileri kopyalamayı denememelisin, bunu izlemek çok zor olacaktır ve uygulamanda hatalara neden olabilir. Bunun yerine, uygulamanda birden fazla görüntünün kullanabileceği tek bir [veri modelini](glossary://data%20model) yaratıp yönetmeyi öğreneceksin.
vi: Trong một số trường hợp khi xây dựng ứng dụng, bạn sẽ có dữ liệu mà bạn muốn chia sẻ trong hai hoặc nhiều chế độ xem, do vậy một [ràng buộc](glossary://binding) sẽ không đủ để xử lý việc đó. Bạn không nên cố gắng sao chép dữ liệu trong từng chế độ xem mới, vì việc này sẽ rất khó theo dõi và có thể dẫn đến các lỗi trong ứng dụng của bạn. Thay vào đó, bạn sẽ học cách tạo ra và duy trì một [mô hình dữ liệu](glossary://data%20model) đơn nhất mà nhiều chế độ xem của ứng dụng có thể sử dụng.
zh_cn: 有时在构建 App 时，你会想让数据在两个或更多视图中共享，这样一来，可能没法使用[绑定](glossary://binding)完成。尝试在每个新视图中重复这些数据的做法是不可取的，因为这样会让数据跟踪变得十分困难，而且可能会导致 App 出现程序错误。因此，你将学习如何创建和维护单个[数据模型](glossary://data%20model)，让它可被 App 中的多个视图使用。
zh_tw: 在某些情況下，當你建構 App 時，你會有想要在 2 個或更多顯示區之間共享的資料。因此，即使是[綁定](glossary://binding)也不足以處理這個問題。你不應該嘗試在每個新顯示區中複製資料，因為這樣會很難追蹤，並可能導致你的 App 出錯。相反地，你要學習如何建立和維護單一的[資料模型](glossary://data%20model)，供 App 的多個顯示區使用。
