Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Try selecting a color from the `ColorPicker` in the preview. Notice that the picker color changes, but nothing else in your UI does. This is because your state property isn’t connected to any other [local](glossary://local%20scope) views.
de: Versuche, in der Vorschau eine Farbe aus `ColorPicker` auszuwählen. Ist dir aufgefallen, dass sich zwar die Farbe der Auswahl, aber sonst nichts auf der Benutzeroberfläche verändert hat? Der Grund hierfür ist, dass deine Statuseigenschaft mit keiner anderen [lokalen](glossary://local%20scope) Ansicht verbunden ist.
es: Prueba a seleccionar un color del selector de colores (`ColorPicker`) en la vista previa. Observa que el color del selector cambia, pero no cambia nada más en tu IU. Esto se debe a que tu propiedad de estado no está conectada a ninguna otra vista [local](glossary://local%20scope).
es_419: Intenta seleccionar un color del selector `ColorPicker` en la vista previa. Observa que sólo el color del selector cambia, pero nada más cambia en tu UI. Esto se debe a que tu propiedad de estado no está conectada a ninguna otra visualización [local](glossary://local%20scope).
fr: Essaie de sélectionner une couleur depuis le `ColorPicker` dans l’aperçu. Tu remarqueras que la couleur du sélecteur change, mais rien d’autre ne se passe dans ton interface utilisateur. La raison est que ta propriété d’état n’est connectée à aucune autre vue [locale](glossary://local%20scope).
it: Nell'anteprima, prova a selezionare un colore da `ColorPicker`. Vedrai che l'unico elemento dell'interfaccia utente che cambia è il colore del selettore. Questo avviene perché la tua proprietà di stato non è connessa a nessun'altra vista [locale](glossary://local%20scope).
nl: Selecteer een kleur in de `ColorPicker` in de voorvertoning. Zoals je ziet, verandert de kleur van de kiezer, maar de rest van de gebruikersinterface niet. Dit komt omdat de statuseigenschap niet aan andere [lokale](glossary://local%20scope) weergaven is gekoppeld.
no: Prøv å velge en farge fra `ColorPicker` i forhåndsvisningen. Velgerfargen endres, men ingenting i brukergrensesnittet endres. Det er fordi statusegenskapen ikke er koblet til noen andre [lokale](glossary://local%20scope) visninger.
pt: Tente selecionar uma cor no `ColorPicker` na pré-visualização. Note que a cor do seletor muda, mas nada mais muda na sua IU. Isso ocorre porque a sua propriedade de estado não está conectada a nenhuma outra visualização [local](glossary://local%20scope).
sv: Prova att välja en färg från `ColorPicker` i förhandsvisningen. Väljarfärgen ändras, men inget i UI:t ändras. Det beror på att statusegenskapen inte är ansluten till några andra [lokala](glossary://local%20scope) vyer.
th: ลองเลือกสีจาก `ColorPicker` ในการแสดงตัวอย่าง สังเกตว่าสีตัวเลือกเปลี่ยนไป แต่สิ่งอื่นใน UI ของคุณไม่เปลี่ยนแปลง นี่เป็นเพราะคุณสมบัติสถานะของคุณไม่ได้เชื่อมต่อกับมุมมอง[ภายใน](glossary://local%20scope)อื่นๆ
tr: Önizlemede `ColorPicker`'dan bir renk seçmeyi dene. Seçici renginin değiştiğini, ancak kullanıcı arayüzünde başka hiçbir şeyin değişmediğini fark edeceksin. Bunun nedeni, durum özelliğinin başka herhangi bir [yerel](glossary://local%20scope) görüntüye bağlı olmamasıdır.
vi: Thử chọn một màu từ `ColorPicker` trong bản xem trước. Hãy lưu ý rằng màu của bộ chọn thay đổi, nhưng UI của bạn không có gì thay đổi. Điều này là vì thuộc tính trạng thái của bạn không được kết nối với bất kỳ chế độ xem [cục bộ](glossary://local%20scope) nào.
zh_cn: 尝试从预览中的 `ColorPicker` 选择一种颜色。你注意到了吗？选择器中的颜色发生了更改，但 UI 中却没有变化。这是因为你的状态属性没有与其他任何[本地](glossary://local%20scope)视图连接。
zh_tw: 試著從預覽中的 `ColorPicker` 選擇一種顏色。請注意，選擇器顏色會發生變化，但你的 UI 中沒有其他任何變化。這是因為你的狀態屬性未連接到任何其他[區域](glossary://local%20scope)顯示區。

source: Now change the color of the image view to update to the color from the picker.
de: Ändere jetzt die Farbe der Bildansicht, um auf die Farbe in der Farbauswahl zu aktualisieren.
es: Ahora cambia el color de la vista de imagen para que se actualice al color del selector.
es_419: Ahora cambia el color de la visualización `Image` para que se actualice según el color del selector.
fr: À présent, modifie la couleur de la vue de l’image pour qu’elle se mette à jour selon la couleur du sélecteur.
it: Ora modifica il colore della vista immagine affinché venga aggiornato con il colore che hai scelto nel selettore.
nl: Werk de kleur van de `Image`-weergave nu bij naar de kleur uit de kiezer.
no: Endre nå fargen i bildevisningen, slik at den oppdateres til fargen fra velgeren.
pt: Agora altere a cor da visualização de imagem para atualizá-la conforme a cor do seletor.
sv: Ändra nu färgen i bildvyn så att den uppdateras till färgen från väljaren.
th: ตอนนี้ให้เปลี่ยนสีของมุมมองภาพเพื่ออัปเดตสีจากตัวเลือก
tr: Şimdi, seçicideki rengi güncellemek için resim görüntüsünün rengini değiştir.
vi: Bây giờ, hãy thay đổi màu của chế độ xem hình ảnh để cập nhật thành màu từ bộ chọn.
zh_cn: 现在，将图像视图的颜色更新为选择器中的颜色。
zh_tw: 現在更改影像顯示區的顏色來更新為選擇器中的顏色。

source: To change the color of the `Image` view, add a `.foregroundColor(_:)` modifier and pass in your state property for color as an argument.
de: Um die Farbe der `Image`-Ansicht zu ändern, füge den Modifikator `.foregroundColor(_:)` (Vordergrundfarbe) hinzu und übergib die Statuseigenschaft für die Farbe als Argument.
es: Para cambiar el color de la vista `Image`, añade un modificador `.foregroundColor(_:)` y pasa tu propiedad de estado para el color como argumento.
es_419: Para cambiar el color de la visualización `Image`, agrega un modificador `.foregroundColor(_:)` y pasa tu propiedad de estado para el color como un argumento.
fr: Pour modifier la couleur de la vue `Image`, ajoute un modificateur `.foregroundColor(_:)` et transmets ta propriété d’état pour la couleur en tant qu’argument.
it: Per modificare il colore della vista `Image`, aggiungi un modificatore `.foregroundColor(_:)` e trasmetti come argomento la tua proprietà di stato per il colore.
nl: Om de kleur van de `Image`-weergave te wijzigen, voeg je de modifier `.foregroundColor(_:)` toe en geef je de statuseigenschap voor kleur door als een argument.
no: Du endrer fargen i `Image`-visningen ved å legge til en `.foregroundColor(_:)`-modifikator og overføre statusegenskapen for farge som et argument.
pt: Para alterar a cor da visualização `Image`, adicione um modificador `.foregroundColor(_:)` e passe a sua propriedade de estado de cor como um argumento.
sv: Du ändrar färgen i `Image`-vyn genom att lägga till en `.foregroundColor(_:)`-modifierare och överföra statusegenskapen för färg som ett argument.
th: ในการเปลี่ยนสีของมุมมอง `Image` ให้เพิ่มปุ่มปรับค่า `.foregroundColor(_:)` แล้วส่งผ่านคุณสมบัติสถานะสำหรับสีของคุณเป็นอาร์กิวเมนต์
tr: `Image` görüntüsünün rengini değiştirmek için bir `.foregroundColor(_:)` niteleyicisi ekle ve renk için durum özelliğini bir argüman olarak geçir.
vi: Để thay đổi màu của chế độ xem `Image`, hãy thêm một trình sửa đổi `.foregroundColor(_:)` và chuyển vào thuộc tính trạng thái của bạn cho màu dưới dạng một đối số.
zh_cn: 若要更改 `Image` 视图的颜色，添加一个 `.foregroundColor(_:)` 修饰符，然后传入颜色的状态属性作为实参。
zh_tw: 若要更改 `Image` 顯示區的顏色，請加入 `.foregroundColor(_:)` 修飾符並傳入顏色的狀態屬性作為引數。

source: Now select a color from the color picker. Does your `Image` change color as well?
de: Wähle eine Farbe aus der Farbauswahl aus. Ändert sich auch die Farbe von `Image`?
es: Ahora selecciona un color del selector de colores. ¿Cambia también `Image` de color?
es_419: Ahora selecciona un color con el selector de color. ¿Necesitarás cambiar el color de tu visualización `Image` también?
fr: Maintenant, sélectionne une couleur dans le sélecteur de couleur. La couleur de ton `Image` change-t-elle aussi ?
it: Ora scegli un colore dal selettore. Viene modificato anche il colore della vista `Image`?
nl: Selecteer nu een kleur in de kleurenkiezer. Verandert `Image` ook van kleur?
no: Velg nå en farge fra fargevelgeren. Endrer `Image` også farge?
pt: Agora selecione uma cor do seletor de cor. Será que a sua `Image` também muda de cor?
sv: Välj nu en färg från färgväljaren. Ändrar `Image` också färg?
th: ตอนนี้ให้เลือกสีจากตัวเลือกสี แล้วดูว่า `Image` ของคุณเปลี่ยนสีด้วยหรือไม่
tr: Şimdi, renk seçiciden bir renk seç. Resminizin (`Image`) de rengi değişti mi?
vi: Bây giờ, hãy chọn một màu từ bộ chọn màu. `Image` của bạn cũng thay đổi màu chứ?
zh_cn: 现在，从颜色选择器中选择一种颜色。`Image` 的颜色也发生变化了吗？
zh_tw: 現在，從顏色選擇器中選擇一個顏色。你的 `Image` 有隨之改變顏色嗎？

# GuideBook..Guide0..StepSwiftUI Built-in Views..TaskaddATextView..title
source: Create a `Text` view that changes its color when you select a new color
de: `Text`-Ansicht erstellen, die beim Auswählen einer neuen Farbe die Farbe ändert
es: Crear una vista `Text` (texto) que cambie su color cuando selecciones un nuevo color
es_419: Crear una visualización `Text` que cambie de color cuando se seleccione otro
fr: Créer une vue `Text` qui change de couleur quand tu sélectionnes une nouvelle couleur
it: Creare una vista `Text` che cambia colore quando ne selezioni uno nuovo
nl: Een `Text`-weergave aanmaken die van kleur verandert wanneer je een nieuwe kleur selecteert
no: Opprett en `Text`-visning som endrer farge når du velger en ny farge
pt: Crie uma visualização `Text` que mude de cor quando você seleciona uma nova cor
sv: Skapa en `Text`-vy som ändrar färg när du väljer en ny färg
th: สร้างมุมมอง `Text` ที่จะเปลี่ยนสีเมื่อคุณเลือกสีใหม่
tr: Yeni bir renk seçtiğinde rengi değişen bir `Text` görüntüsü yaratma
vi: Tạo ra một chế độ xem `Text` thay đổi màu khi bạn chọn một màu mới
zh_cn: 创建一个选择了新颜色时会更改自己颜色的 `Text` 视图
zh_tw: 建立一個當你選取了新的顏色時，即會改變其顏色的 `Text` 顯示區

source: Add a `Text` view that changes color when you select a new color from the color picker. You can use the `.foregroundColor(_:)` modifier to do this, just as for the image.
de: Füge eine `Text`-Ansicht hinzu, die die Farbe ändert, wenn eine neue Farbe in der Farbauswahl ausgewählt wird. Du kannst dafür den Modifikator `.foregroundColor(_:)` verwenden – wie auch für das Bild.
es: Añade una vista `Text` que cambie de color cuando selecciones un nuevo color en el selector de colores. Puedes usar el modificador `.foregroundColor(_:)` para hacerlo, al igual que para la imagen.
es_419: Agrega una visualización `Text` que cambie de color cuando se selecciona uno diferente en el selector de color. Puedes usar el modificador `.foregroundColor(_:)` para hacer esto, igual que con la imagen.
fr: Ajoute une vue `Text` qui change de couleur lorsque tu sélectionnes une nouvelle couleur dans le sélecteur de couleur. Tu peux utiliser le modificateur `.foregroundColor(_:)` pour ce faire, exactement comme pour l’image.
it: Aggiungi una vista `Text` il cui colore cambia quando selezioni un nuovo colore dal selettore colori. Per farlo, puoi usare il modificatore `.foregroundColor(_:)`, proprio come hai fatto per l'immagine.
nl: Voeg een `Text`-weergave toe die van kleur verandert wanneer je een nieuwe kleur in de kleurenkiezer selecteert. Je kunt hiervoor de modifier `.foregroundColor(_:)` gebruiken, net als voor de `Image`.
no: Legg til en `Text`-visning som endrer farge når du velger en ny farge fra fargevelgeren. Du kan bruke modifikatoren `.foregroundColor(_:)` til å gjøre dette, akkurat som for bildet.
pt: Adicione uma visualização `Text` que muda de cor quando você seleciona uma nova cor no seletor de cores. Você pode usar o modificador `.foregroundColor(_:)` para fazer isso, da mesma maneira como na imagem.
sv: Lägg till en `Text`-vy som ändrar färg när du väljer en ny färg från färgväljaren. Du kan använda modifieraren `.foregroundColor(_:)` till att göra detta, precis som för bilden.
th: เพิ่มมุมมอง `Text` ที่เปลี่ยนสีเมื่อคุณเลือกสีใหม่จากตัวเลือกสี คุณสามารถใช้ปุ่มปรับค่า `.foregroundColor(_:)` เพื่อทำสิ่งนี้ได้เช่นเดียวกับภาพ
tr: Renk seçiciden yeni bir renk seçtiğinde renk değiştiren bir `Text` görüntüsü ekle. Tıpkı görüntü için olduğu gibi bunu yapmak için de `.foregroundColor(_:)` niteleyicisini kullanabilirsin.
vi: Thêm một chế độ xem `Text` thay đổi màu khi bạn chọn một màu mới từ bộ chọn màu. Bạn có thể sử dụng trình sửa đổi `.foregroundColor(_:)` để thực hiện việc này, giống như với hình ảnh.
zh_cn: 添加一个 `Text` 视图，当你从颜色选择器中选择了新颜色时，视图的颜色会发生更改。你可以使用 `.foregroundColor(_:)` 修饰符来完成，就像处理图像视图一样。
zh_tw: 加入一個 `Text` 顯示區，當你從顏色選擇器中選取一個新的顏色時，該顯示區就會改變顏色。你可以使用 `.foregroundColor(_:)` 修飾符來執行此操作，如同影像一樣。

source: Choose a larger font for the `Text` view using the [.font](doc://com.apple.documentation/documentation/swiftui/font) modifier and passing in `.largeTitle`.
de: Wähle eine größere Schrift für die `Text`-Ansicht aus, indem du den Modifikator [.font](doc://com.apple.documentation/documentation/swiftui/font) verwendest und `.largeTitle` übergibst.
es: Elige un tipo de letra más grande para la vista `Text` usando el modificador [.font](doc://com.apple.documentation/documentation/swiftui/font) y pasando `.largeTitle`.
es_419: Elige un tipo de letra grande para la visualización `Text` utilizando el modificador [.font](doc://com.apple.documentation/documentation/swiftui/font) y pasando `.largeTitle`.
fr: Choisis une police plus grande pour la vue `Text` en utilisant le modificateur [.font](doc://com.apple.documentation/documentation/swiftui/font) et en transmettant `.largeTitle`.
it: Scegli un font più grande per la vista `Text` utilizzando il modificatore [.font](doc://com.apple.documentation/documentation/swiftui/font) e trasmettendo il valore `.largeTitle`.
nl: Kies een groter lettertype voor de `Text`-weergave door de modifier [.font](doc://com.apple.documentation/documentation/swiftui/font) te gebruiken en hier `.largeTitle` aan door te geven.
no: Velg en større font for `Text`-visningen med modifikatoren [.font](doc://com.apple.documentation/documentation/swiftui/font) og overfør `.largeTitle`.
pt: Escolha uma fonte maior para a visualização `Text` usando o modificador [.font](doc://com.apple.documentation/documentation/swiftui/font) e passando `.largeTitle`.
sv: Välj ett större typsnitt för `Text`-vyn med modifieraren [.font](doc://com.apple.documentation/documentation/swiftui/font) och överför `.largeTitle`.
th: เลือกแบบอักษรขนาดใหญ่ขึ้นสำหรับมุมมอง `Text` โดยใช้ปุ่มปรับค่า [.font](doc://com.apple.documentation/documentation/swiftui/font) และส่งผ่าน `.largeTitle`
tr: [.font](doc://com.apple.documentation/documentation/swiftui/font) niteleyicisini kullanarak ve `.largeTitle`’ı geçirerek `Text` görüntüsü için daha büyük bir font seç.
vi: Chọn một phông chữ lớn hơn cho chế độ xem `Text` bằng trình sửa đổi [.font](doc://com.apple.documentation/documentation/swiftui/font) và chuyển vào `.largeTitle`.
zh_cn: 使用 [.font](doc://com.apple.documentation/documentation/swiftui/font)（字体）修饰符，并传入 `.largeTitle`（大标题），为 `Text` 视图选取更大的字体。
zh_tw: 使用 [.font](doc://com.apple.documentation/documentation/swiftui/font) 修飾符並傳入 `.largeTitle` 來為 `Text` 顯示區選擇更大的字體。

source: Add `.padding()` to your views to create fixed space between one view and all of the views around it. You can also add a `Spacer()`, which is an invisible view that shrinks and expands variably to occupy the available space between views.
de: Füge `.padding()` (Randabstand) zu den Ansichten hinzu, um einen festen Abstand zwischen einer Ansicht und den umliegenden Ansichten zu erstellen. Du kannst auch die unsichtbare Ansicht `Spacer()` (Abstandshalter) hinzufügen, die sich entsprechend vergrößert oder verkleinert, um den verfügbaren Platz zwischen den Ansichten zu füllen.
es: Añade `.padding()` a tus vistas para crear un espacio fijo entre una vista y todas las vistas que la rodean. También puedes añadir `Spacer()`, que es una vista invsible que se encoge y expande de forma variable para ocupar el espacio disponible entre las vistas.
es_419: Agrega `.padding()` a tus visualizaciones para crear espacio fijo entre una visualización y todas las que la rodean. También puedes agregar `Spacer()`, que es una visualización invisible que se encoge y expande de forma variable para ocupar el espacio disponible entre las visualizaciones.
fr: Ajoute `.padding()` à tes vues pour créer un espace fixe entre une vue et toutes celles qui l’entourent. Tu peux également ajouter un `Spacer()`, qui est une vue invisible qui se réduit ou s’étend de manière variable pour occuper l’espace disponible entre les vues.
it: Aggiungi `.padding()` alla tua vista per creare spazio fisso tra una vista e tutte quelle che la circondano. Puoi anche aggiungere uno `Spacer()`, ossia una vista invisibile che si rimpicciolisce e si allarga in modo variabile per occupare lo spazio disponibile tra le viste.
nl: Voeg `.padding()` aan je weergaven toe om een vaste ruimte tussen een weergave en de omringende weergaven aan te brengen. Je kunt ook een `Spacer()` toevoegen. Dit is een onzichtbare weergave die op een variabele manier krimpt en uitzet om de beschikbare ruimte tussen weergaven te vullen.
no: Legg til `.padding()` i visninger hvis du vil lage et fast mellomrom mellom en visning og alle visningene rundt den. Du kan også legge til en `Spacer()`, som er en usynlig visning som krymper og vokser etter behov så den fyller det tilgjengelige rommet mellom visninger.
pt: Adicione `.padding()` às visualizações para criar um espaço fixo entre uma visualização e todas as visualizações ao redor dela. Você também pode adicionar um `Spacer()`, uma visualização invisível que encolhe e expande variavelmente para ocupar o espaço disponível entre visualizações.
sv: Lägg till `.padding()` i vyer om du vill skapa ett fast mellanrum mellan en vy och alla vyerna runt den. Du kan också lägga till en `Spacer()` som är en osynlig vy som krymper och växer efter behov så att den fyller det tillgängliga utrymmet mellan vyer.
th: เพิ่ม `.padding()` ไปยังมุมมองของคุณเพื่อสร้างพื้นที่ว่างแบบคงที่ระหว่างมุมมองหนึ่งและมุมมองทั้งหมดรอบๆ มุมมองนั้น คุณยังสามารถเพิ่ม `Spacer()` ซึ่งเป็นมุมมองที่มองไม่เห็นที่หดและขยายตามตัวแปรเพื่อใช้พื้นที่ว่างระหว่างมุมมองได้อีกด้วย
tr: Bir görüntü ile onun etrafındaki tüm görüntülerin arasında sabit bir boşluk yaratmak için görüntülerine `.padding()` ekle. Görüntüler arasındaki kullanılabilir alanı doldurmak için değişken bir biçimde daralan ve genişleyen görünmez bir görüntü olan `Spacer()` da ekleyebilirsin.
vi: Thêm `.padding()` vào các chế độ xem của bạn để tạo ra khoảng trống cố định giữa một chế độ xem và tất cả các chế độ xem xung quanh. Bạn cũng có thể thêm một `Spacer()`, là một chế độ xem vô hình thu hẹp và mở rộng biến thiên để chiếm khoảng trống có sẵn giữa các chế độ xem.
zh_cn: 将 `.padding()`（填补）添加到视图中，可在视图与它周围的所有视图之间创建固定空间。你还可以添加 `Spacer()`（留白器），它是一个不可见的视图，会动态缩小和增大来占用视图之间的可用空间。
zh_tw: 將 `.padding()` 加入你的顯示區中，來在一個顯示區和它周圍的所有顯示區之間建立固定的空間。你還可以加入一個 `Spacer()`，這是一個隱形的顯示區，可以變化性地收縮和擴展來使用顯示區之間的可用空間。
