Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: To pass in a binding, use your SwiftUI-managed [state property](glossary://state%20property) with a `$` in front of it. Pass in `$isOn` to indicate that any time `Toggle` changes the value remotely, the [binding](glossary://binding) modifies the source of truth, `isOn`.
de: Um eine Bindung zu übergeben, verwende die von SwiftUI verwaltete [Statuseigenschaft](glossary://state%20property) mit `$` vor der Eigenschaft. Übergib `$isOn`, um anzuzeigen, dass jedes Mal, wenn `Toggle` den Wert aus der Ferne ändert, die [Bindung](glossary://binding) die Wahrheitsquelle `isOn` ändert.
es: Para pasar una vinculación, usa tu [propiedad de estado](glossary://state%20property) gestionada por SwiftUI con `$` delante. Pasa `$isOn` para indicar que en cualquier momento que `Toggle` cambie el valor de forma remota, la [vinculación](glossary://binding) modifica la fuente de datos, `isOn`.
es_419: Para pasar una ligadura, usa tu [propiedad de estado](glossary://state%20property) administrada por SwiftUI con un símbolo `$` al inicio. Pasa `$isOn` para indicar que cada vez que `Toggle` cambie el valor de forma remota, la [ligadura](glossary://binding) modificará la fuente única de información `isOn`.
fr: Pour transmettre une association, utilise ta [propriété d’état](glossary://state%20property) gérée par SwiftUI, avec un `$` devant celle-ci. Transmets `$isOn` pour indiquer que chaque fois que `Toggle` change la valeur à distance, l’[association](glossary://binding) modifie la source de vérité, `isOn`.
it: Per trasmettere un vincolo, utilizza la [proprietà di stato](glossary://state%20property) gestita da SwiftUI preceduta dal simbolo `$`. Trasmetti `$isOn` per indicare che, ogni volta che `Toggle` cambia il valore in remoto, il [vincolo](glossary://binding) modifica la sorgente univoca `isOn`.
nl: Om een binding door te geven, gebruik je de door SwiftUI beheerde [statuseigenschap](glossary://state%20property) met een `$` ervoor. Geef `$isOn` door om aan te geven dat de [binding](glossary://binding) de bron van waarheid voor `isOn` wijzigt wanneer `Toggle` de waarde op afstand wijzigt.
no: Du overfører en binding med en SwiftUI-håndtert [statusegenskap](glossary://state%20property) med `$` foran den. Overfør `$isOn` for å vise at [bindingen](glossary://binding) endrer sannhetskilden `isOn` når `Toggle` endrer verdien eksternt.
pt: Para passar um vínculo, use a [propriedade de estado](glossary://state%20property) gerenciada pela SwiftUI com um `$` na frente. Passe `$isOn` para indicar que sempre que `Toggle` muda de valor remotamente, o [vínculo](glossary://binding) modifica a fonte da verdade, `isOn`.
sv: Du överför en koppling med en SwiftUI-hanterad [statusegenskap](glossary://state%20property) med `$` framför den. Överför `$isOn` för att visa att [kopplingen](glossary://binding) ändrar sanningskällan `isOn` när `Toggle` ändrar värdet på distans.
th: ในการส่งผ่านการรวม ให้ใช้[คุณสมบัติสถานะ](glossary://state%20property)ที่จัดการด้วย SwiftUI ของคุณโดยให้มี `$` อยู่ด้านหน้า ส่งผ่าน `$isOn` เพื่อระบุว่าทุกครั้งที่ `Toggle` เปลี่ยนแปลงค่าจากระยะไกล [การรวม](glossary://binding)จะแก้ไขแหล่งข้อมูลจริง `isOn`
tr: Bir bağlamayı geçirmek için önünde bir `$` olan ve SwiftUI tarafından yönetilen [durum özelliğini](glossary://state%20property) kullan. `Toggle`, değeri uzaktan her değiştirdiğinde [bağlamanın](glossary://binding) `isOn` gerçeklik kaynağını değiştireceğini belirtmek için `$isOn`’u geçir.
vi: Để chuyển vào một ràng buộc, hãy sử dụng [thuộc tính trạng thái](glossary://state%20property) được quản lý bởi SwiftUI của bạn với một ký hiệu `$` ở phía trước. Chuyển vào `$isOn` để biểu thị rằng bất kỳ lúc nào `Toggle` thay đổi giá trị từ xa, [ràng buộc](glossary://binding) sẽ sửa đổi nguồn chân lý, `isOn`.
zh_cn: 若要传入绑定，使用由 SwiftUI 管理的[状态属性](glossary://state%20property)，并在它的前面加上 `$`。传入 `$isOn` 表示只要 `Toggle` 远程更改值，[绑定](glossary://binding)就会修改可信源 `isOn`。
zh_tw: 若要傳入綁定，請使用 SwiftUI 管理的[狀態屬性](glossary://state%20property)，並在它的前面加上 `$`。傳入 `$isOn` 表示任何時候 `Toggle` 都能從遠端更改數值，[綁定](glossary://binding)會修改真實來源 `isOn`。

# GuideBook..Guide0..StepSwiftUI Built-in Views..TaskaddAStateVar..title
source: Add a new state property, of type `Color`
de: Neue Statuseigenschaft des Typs `Color` hinzufügen
es: Añadir una nueva propiedad de estado, de tipo `Color`
es_419: Agregar una propiedad de estado nueva del tipo `Color`
fr: Ajouter une nouvelle propriété d’état de type `Color`
it: Aggiungere una nuova proprietà di stato di tipo `Color`
nl: Voeg een nieuwe statuseigenschap van het type `Color` toe
no: Legg til en ny statusegenskap av typen `Color`
pt: Adicione uma nova propriedade de estado do tipo `Color`
sv: Lägg till en ny statusegenskap av typen `Color`
th: เพิ่มคุณสมบัติสถานะใหม่ของปะเภท `Color`
tr: `Color` tipinde yeni bir durum özelliği ekleme
vi: Thêm một thuộc tính trạng thái mới thuộc kiểu `Color`
zh_cn: 添加 `Color` 类型的新状态属性
zh_tw: 加入一個 `Color` 類型的新狀態屬性

source: Next, try using a built-in `ColorPicker` view along with a [binding](glossary://binding) to change the color of the battery `Image` view.
de: Als Nächstes verwendest du die integrierte `ColorPicker`-Ansicht zusammen mit einer [Bindung](glossary://binding), um die Farbe der `Image`-Batterieansicht zu ändern.
es: A continuación, prueba a usar una vista `ColorPicker` integrada junto con una [vinculación](glossary://binding) para cambiar el color de la vista `Image` de la batería.
es_419: A continuación, intenta usar una visualización integrada `ColorPicker` junto con una [ligadura](glossary://binding) para cambiar el color de la visualización `Image` de la batería.
fr: Ensuite, essaie d’utiliser une vue `ColorPicker` intégrée avec une [association](glossary://binding) pour modifier la couleur de la vue `Image` de la batterie.
it: Nella prossima attività, proverai a utilizzare una vista integrata `ColorPicker` combinata a un [vincolo](glossary://binding) per cambiare il colore della vista `Image` della batteria.
nl: Nu ga je een ingebouwde `ColorPicker`-weergave gebruiken in combinatie met een [binding](glossary://binding) om de kleur van de `Image`-weergave van de batterij te wijzigen.
no: Nå skal du prøve å bruke en innebygd `ColorPicker`-visning sammen med en [binding](glossary://binding) for å endre fargen på batteriets `Image`-visning.
pt: Em seguida, tente usar uma visualização `ColorPicker` integrada junto com um [vínculo](glossary://binding) para alterar a cor da visualização `Image` da bateria.
sv: Härnäst ska du prova att använda en inbyggd `ColorPicker`-vy tillsammans med en [koppling](glossary://binding) för att ändra färgen på batteriets `Image`-vy.
th: ถัดไป ให้ลองใช้มุมมอง `ColorPicker` ในตัวพร้อมกับ[การรวม](glossary://binding)เพื่อเปลี่ยนสีของมุมมอง `Image` แบตเตอรี่
tr: Sonra, pil `Image` görüntüsünün rengini değiştirmek için bir [bağlama](glossary://binding) ile birlikte yerleşik bir `ColorPicker` görüntüsü kullanmayı dene.
vi: Tiếp theo, hãy thử sử dụng chế độ xem `ColorPicker` tích hợp cùng với một [ràng buộc](glossary://binding) để thay đổi màu của chế độ xem `Image` pin.
zh_cn: 下一步，尝试使用内建 `ColorPicker`（颜色选择器）视图及[绑定](glossary://binding)来更改电池 `Image` 视图的颜色。
zh_tw: 接下來，嘗試使用內建的 `ColorPicker` 顯示區和[綁定](glossary://binding)來更改電池 `Image` 顯示區的顏色。

source: To do this, first create a [state property](glossary://state%20property) to act as your source of truth for a `Color` value. Give it an initial value of `Color.primary`.
de: Dafür erstellst du als Erstes eine [Statuseigenschaft](glossary://state%20property), die als Wahrheitsquelle für den `Color`-Wert dient. Gib ihr den Ausgangswert von `Color.primary`.
es: Para ello, crea primero una [propiedad de estado](glossary://state%20property) que sirva de fuente de datos para un valor de `Color`. Dale un valor inicial de `Color.primary`.
es_419: Para hacer esto, primero crea una [propiedad de estado](glossary://state%20property), para que funcione como tu fuente de la verdad de un valor `Color`. Dale un valor inicial de `Color.primary`.
fr: Pour ce faire, commence par créer une [propriété d’état](glossary://state%20property) pour agir en tant que source de vérité pour une valeur `Color`. Donne-lui la valeur initiale `Color.primary`.
it: Prima di tutto crea una [proprietà di stato](glossary://state%20property) che fungerà da sorgente univoca per un valore `Color`. Assegnale un valore iniziale di `Color.primary`.
nl: Om dit te doen, maak je eerst een [statuseigenschap](glossary://state%20property) aan die fungeert als je bron van waarheid voor een `Color`-waarde. Wijs er een beginwaarde van `Color.primary` aan toe.
no: Du gjør dette ved å først opprette en [statusegenskap](glossary://state%20property) som fungerer som en sannhetskilde for en `Color`-verdi. Gi den den innledende verdien `Color.primary`.
pt: Para fazer isso, primeiro crie uma [propriedade de estado](glossary://state%20property) para funcionar como fonte da verdade para um valor `Color`. Dê a ela um valor inicial de `Color.primary`.
sv: Du gör det genom att först skapa en [statusegenskap](glossary://state%20property) som fungerar som en sanningskälla för ett `Color`-värde. Ge den det inledande värdet `Color.primary`.
th: ในการทำเช่นนี้ ก่อนอื่นให้สร้าง[คุณสมบัติสถานะ](glossary://state%20property)เพื่อทำหน้าที่เป็นแหล่งข้อมูลจริงสำหรับค่า `Color` โดยให้ค่าเริ่มต้นเป็น `Color.primary`
tr: Bunu yapmak için öncelikle bir `Color` değeri için gerçeklik kaynağın olarak görev yapacak bir [durum özelliği](glossary://state%20property) yarat. Ona `Color.primary` ilk değerini ver.
vi: Để thực hiện việc này, trước tiên hãy tạo ra một [thuộc tính trạng thái](glossary://state%20property) để đóng vai trò là nguồn chân lý của bạn cho giá trị `Color`. Hãy cung cấp một giá trị ban đầu của `Color.primary`.
zh_cn: 若要这样做，首先创建[状态属性](glossary://state%20property)，用作 `Color` 值的可信源。给它赋予 `Color.primary`（基础颜色）的初始值。
zh_tw: 為此，首先建立一個[狀態屬性](glossary://state%20property) 作為你的 `Color` 值的真實來源。為它指定一個初始值 `Color.primary`。

source: Try this on your own, using the following hints if you get stuck.
de: Löse das Beispiel auf eigene Faust. Wenn du nicht weiterkommst, kannst du diese Tipps verwenden.
es: Prueba a hacer esto por tu cuenta, usando las siguientes pistas si te atascas.
es_419: Intenta hacerlo por tu cuenta, y usa las siguientes pistas si tienes problemas.
fr: Essaie de faire cela par toi-même, en utilisant les astuces suivantes si tu es bloqué.
it: Prova a farlo autonomamente. Se non riesci ad andare avanti puoi utilizzare i suggerimenti di seguito.
nl: Probeer dit zelf te doen. Gebruik de volgende tips als je vast komt te zitten.
no: Prøv å gjøre dette på egen hånd, og bruk følgende hint hvis du sitter fast.
pt: Tente fazer isso por conta própria e use as dicas seguintes caso não consiga sair do lugar.
sv: Försök att göra det här på egen hand och använd följande tips om du fastnar.
th: ลองทำสิ่งนี้ด้วยตัวคุณเองโดยใช้คำใบ้ต่อไปนี้หากคุณไปต่อไม่ได้
tr: Bunu kendi başına dene, sıkışırsan aşağıdaki ipuçlarını kullan.
vi: Hãy cố gắng tự mình thực hiện việc này, sử dụng các gợi ý sau đây nếu bạn bị vướng mắc.
zh_cn: 自己尝试一下，遇到困难时可使用以下提示。
zh_tw: 嘗試自己執行此操作，如果遇到困難，請使用以下提示。

source: Define a [property](glossary://property) with the `@State` [property wrapper](glossary://property%20wrapper) and [assign](glossary://assignment) it an initial value of `Color.primary`.
de: Definiere mit dem [Eigenschaftswrapper](glossary://property%20wrapper) `@State` eine [Eigenschaft](glossary://property) und [weise](glossary://assignment) ihr den Ausgangswert von `Color.primary` zu.
es: Define una [propiedad](glossary://property) con el [contenedor de propiedades](glossary://property%20wrapper) `@State` y [asígnale](glossary://assignment) un valor inicial de `Color.primary`.
es_419: Define una [propiedad](glossary://property) con el [contenedor de propiedades](glossary://property%20wrapper) `@State` y [asígnale](glossary://assignment) un valor inicial de `Color.primary`.
fr: Définis une [propriété](glossary://property) avec le [wrapper de propriété](glossary://property%20wrapper) `@State` et [attribue](glossary://assignment)-lui la valeur initiale `Color.primary`.
it: Definisci una [proprietà](glossary://property) con il [wrapper di proprietà](glossary://property%20wrapper) `@State` e [assegnale](glossary://assignment) un valore iniziale di `Color.primary`.
nl: Definieer een [eigenschap](glossary://property) met de [eigenschapwrapper](glossary://property%20wrapper) `@State`. Vervolgens moet je hier een beginwaarde van `Color.primary` aan [toewijzen](glossary://assignment).
no: Definer en [egenskap](glossary://property) med [egenskapsinnpakningen](glossary://property%20wrapper) `@State`, og [tildel](glossary://assignment) den den innledende verdien `Color.primary`.
pt: Defina uma [propriedade](glossary://property) com o [empacotador de propriedade](glossary://property%20wrapper) `@State` e [atribua-lhe](glossary://assignment) um valor inicial de `Color.primary`.
sv: Definiera en [egenskap](glossary://property) med [egenskapspaketeraren](glossary://property%20wrapper) `@State` och [tilldela](glossary://assignment) den det inledande värdet `Color.primary`.
th: กำหนด[คุณสมบัติ](glossary://property)ด้วย[ตัวหุ้มคุณสมบัติ](glossary://property%20wrapper) `@State` และ[กำหนดค่า](glossary://assignment)เริ่มต้นของตัวหุ้มเป็น `Color.primary`
tr: `@State` [özellik sarmalayıcı](glossary://property%20wrapper) ile bir [özellik](glossary://property) tanımla ve ona `Color.primary` ilk değerini [ata](glossary://assignment).
vi: Định nghĩa một [thuộc tính](glossary://property) bằng [trình đóng gói thuộc tính](glossary://property%20wrapper) `@State` và [gán](glossary://assignment) thuộc tính đó làm giá trị ban đầu của `Color.primary`.
zh_cn: 使用 `@State` [属性包装器](glossary://property%20wrapper)定义[属性](glossary://property)，并给它[分配](glossary://assignment) `Color.primary` 的初始值。
zh_tw: 使用 `@State` [屬性包覆](glossary://property%20wrapper)來定義一個[屬性](glossary://property)，並為它[指定](glossary://assignment)一個 `Color.primary` 初始值。

# GuideBook..Guide0..StepSwiftUI Built-in Views..TaskaddAColorPicker..title
source: Create a `ColorPicker` and pass in your binding value
de: Mit `ColorPicker` eine Farbauswahl erstellen und den gebundenen Wert übergeben
es: Crear un `ColorPicker` (selector de colores) y pasar el valor de tu vinculación
es_419: Crear una visualización `ColorPicker` y pasar un valor de ligadura
fr: Créer un `ColorPicker` et transmettre ta valeur d’association
it: Creare un `ColorPicker` e trasmettere il tuo valore vincolante
nl: Maak een `ColorPicker` aan en geef je bindingswaarde door
no: Opprett en `ColorPicker` og overfør bindingsverdien
pt: Crie um `ColorPicker` e passe o valor de vínculo
sv: Skapa en `ColorPicker` och överför ditt kopplingsvärde
th: สร้าง `ColorPicker` แล้วส่งผ่านค่าการรวมของคุณ
tr: `ColorPicker` yaratma ve bağlama değerini geçirme
vi: Tạo ra một `ColorPicker` và chuyển vào giá trị ràng buộc của bạn
zh_cn: 创建 `ColorPicker` 并传入绑定值
zh_tw: 建立一個 `ColorPicker` 並傳入你的綁定值

source: Below your `Toggle` view, create a `ColorPicker` using the following initializer. Add the arguments yourself, using `Toggle` as an example.
de: Erstelle unter der `Toggle`-Ansicht mit der folgenden Initialisierung die Farbauswahl `ColorPicker`. Füge die Argumente selbst hinzu. Du kannst `Toggle` als Beispiel verwenden.
es: Debajo de tu vista `Toggle`, crea un `ColorPicker` (selector de colores) usando el siguiente inicializador. Añade tú mismo los argumentos, utilizando `Toggle` como ejemplo.
es_419: Debajo de tu visualización `Toggle`, crea una visualización `ColorPicker` utilizando el siguiente inicializador. Agrega los argumentos usando `Toggle` como ejemplo.
fr: Sous ta vue `Toggle`, crée un `ColorPicker` à l’aide de l’initialiseur suivant. Ajoute les arguments toi-même, en utilisant `Toggle` comme exemple.
it: Sotto la vista `Toggle`, crea un `ColorPicker` utilizzando l'inizializzatore di seguito. Aggiungi gli argomenti in autonomia, utilizzando `Toggle` come esempio.
nl: Maak onder de weergave `Toggle` een `ColorPicker` aan met behulp van de volgende initializer. Voeg zelf de argumenten toe en gebruik `Toggle` als voorbeeld.
no: Nedenfor `Toggle`-visningen oppretter du en `ColorPicker` med følgende initialiserer. Legg selv til argumentene med `Toggle` som et eksempel.
pt: Abaixo da visualização `Toggle`, crie um `ColorPicker` com o inicializador a seguir. Adicione os argumentos por sua conta, usando `Toggle` como exemplo.
sv: Nedanför `Toggle`-vyn skapar du en `ColorPicker` med följande initierare. Lägg själv till argumenten med `Toggle` som ett exempel.
th: ด้านล่างมุมมอง `Toggle` ของคุณ ให้สร้าง `ColorPicker` โดยใช้ตัวเริ่มต้นต่อไปนี้ เพิ่มอาร์กิวเมนต์ด้วยตัวคุณเองโดยใช้ `Toggle` เป็นตัวอย่าง
tr: `Toggle` görüntünün altında, aşağıdaki ilk değer atayıcıyı kullanarak bir `ColorPicker` yarat. `Toggle`’ı örnek olarak kullanarak argümanları kendin ekle.
vi: Bên dưới chế độ xem `Toggle` của bạn, hãy tạo ra một `ColorPicker` bằng trình khởi tạo sau đây. Hãy tự mình thêm các đối số, sử dụng `Toggle` làm ví dụ.
zh_cn: 在 `Toggle` 视图下方，使用以下构造器创建 `ColorPicker`。参照 `Toggle` 的例子，自己独立添加实参。
zh_tw: 在你的 `Toggle` 顯示區下方使用以下初始化程式建立一個 `ColorPicker`。使用 `Toggle` 作為範例，自己加入引數。

source: Pass in a `String` for the title, such as “Select a Color”.
de: Übergib einen `String` für den Titel, z. B. „Wähle eine Farbe“.
es: Pasa un elemento `String` para el título, como “Selecciona un color”.
es_419: Pasa una propiedad del tipo `String` para el título, como, por ejemplo, “Selecciona un color”.
fr: Transmets une `String` pour le titre, par exemple « Sélectionnez une couleur ».
it: Trasmetti una `String` per il titolo, come “Seleziona un colore”.
nl: Geef een `String` voor de titel door, zoals “Selecteer een kleur”.
no: Overfør en `String` for tittelen, for eksempel «Velg en farge».
pt: Passe uma `String` como título, como por exemplo, “Selecionar uma Cor”.
sv: Överför en `String` för titeln, exempelvis ”Välj en färg”.
th: ส่งผ่าน `String` สำหรับชื่อ เช่น “Select a Color”
tr: Başlık için “Bir Renk Seç” gibi bir `String` geçir.
vi: Chuyển vào một `String` cho tiêu đề, ví dụ như “Chọn một màu”.
zh_cn: 为标题传入 `String`（字符串），如“选择一种颜色”。
zh_tw: 為標題傳入一個 `String`，例如「選擇一個顏色」。

source: Pass in your binding value to `selection`, adding a `$` before the color [state property](glossary://state%20property).
de: Übergib den gebundenen Wert an `selection` und füge vor der [Statuseigenschaft](glossary://state%20property) der Farbe ein `$` ein.
es: Pasa el valor de tu vinculación a `selection`, añadiendo `$` antes de la [propiedad de estado](glossary://state%20property) del color.
es_419: Pasa tu valor de ligadura a `selection`, agregando el símbolo `$` antes de la [propiedad de estado](glossary://state%20property) de color.
fr: Transmets ta valeur d’association à `selection`, en ajoutant un `$` avant la [propriété d’état](glossary://state%20property) de couleur.
it: Trasmetti un valore vincolante a `selection`, aggiungendo il segno `$` davanti alla [proprietà di stato](glossary://state%20property) del colore.
nl: Geef je bindingswaarde door aan `selection` en voeg een `$` toe vóór de [statuseigenschap](glossary://state%20property) voor kleur.
no: Overfør bindingsverdien til `selection`, og legg til en `$` før fargens [statusegenskap](glossary://state%20property).
pt: Passe o valor de vínculo para `selection`, adicionando um `$` antes da [propriedade de estado](glossary://state%20property) de cor.
sv: Överför kopplingsvärdet till `selection` och lägg till `$` före färgens [statusegenskap](glossary://state%20property).
th: ส่งผ่านค่าการรวมของคุณไปยัง `selection` แล้วเพิ่ม `$` ก่อน[คุณสมบัติสถานะ](glossary://state%20property)สี
tr: Renk [durum özelliğinden](glossary://state%20property) önce bir `$` ekleyerek bağlama değerini `selection`'a geçir.
vi: Chuyển vào giá trị ràng buộc của bạn cho `selection`, thêm một `$` vào phía trước [thuộc tính trạng thái](glossary://state%20property) màu.
zh_cn: 通过在颜色[状态属性](glossary://state%20property)前添加 `$`，将你的绑定值传入到 `selection`（所选内容）。
zh_tw: 傳入你的綁定值到 `selection`，在顏色[狀態屬性](glossary://state%20property)前面加上一個 `$`。

source: If you would like to test the `Bindings` view in your app, temporarily add it to your `ContentView`.
de: Wenn du die `Bindings`-Ansicht in deiner App testen möchtest, füge sie vorübergehend zu deiner `ContentView`-Ansicht hinzu.
es: Si quieres probar la vista `Bindings` en tu app, añádela temporalmente a la vista de contenido (`ContentView`).
es_419: Si quieres probar la visualización `"Bindings"` en tu app, agrégala temporalmente a tu visualización `"ContentView"`.
fr: Si tu veux essayer la vue `Bindings` dans ton app, ajoute-la temporairement à `ContentView`.
it: Per testare la vista `Bindings` nell'app, aggiungila temporaneamente a `ContentView`.
nl: Als je de `Bindings`-weergave in je app wilt testen, voeg je deze tijdelijk toe aan je `ContentView`.
no: Hvis du vil teste visningen `Bindings` i appen, kan du legge den til midlertidig i `ContentView`.
pt: Se quiser testar a visualização `Bindings` no seu app, adicione-a temporariamente a `ContentView`.
sv: Om du vill testa vyn `Bindings` i appen kan du tillfälligt lägga till den i `ContentView`.
th: ถ้าคุณต้องการทดสอบมุมมอง `Bindings` ในแอปของคุณ ให้เพิ่มมุมมองไปยัง `ContentView` ของคุณชั่วคราว
tr: Uygulamandaki `Bindings` görüntüsünü test etmek istersen onu geçici olarak `ContentView`’a ekle.
vi: Nếu bạn muốn kiểm tra chế độ xem `Bindings` trong ứng dụng của mình, hãy thêm tạm thời vào `ContentView`.
zh_cn: 如果你想在 App 中测试 `Bindings` 视图，可以将它暂时添加到 `ContentView` 中。
zh_tw: 如果你要在你的 App 中測試 `Bindings` 顯示區，請將它暫時加入 `ContentView`。

source: ColorPicker("Select a Color", selection: $color)
de: ColorPicker("Wähle eine Farbe", selection: $color)
es: ColorPicker("Selecciona un color", selection: $color)
es_419: ColorPicker("Selecciona un color", selection: $color)
fr: ColorPicker("Sélectionnez une couleur", selection: $color)
nl: ColorPicker("Selecteer een kleur", selection: $color)
sv: ColorPicker("Välj en färg", selection: $color)
tr: ColorPicker("Bir Renk Seç", selection: $color)
vi: ColorPicker("Chọn một màu", selection: $color)
zh_cn: ColorPicker("选择一种颜色", selection: $color)

# GuideBook..Guide0..StepSwiftUI Built-in Views..TaskaddAColorModifier..title
source: Set the color of the `Image` to your color state property
de: Farbe von `Image` auf die Statuseigenschaft der Farbe festlegen
es: Establecer el color de la vista `Image` en el color de tu propiedad de estado
es_419: Establecer el color de `Image` según el valor de tu propiedad de estado de color
fr: Définir la couleur de la vue `Image` sur ta propriété d’état de couleur
it: Impostare il colore di `Image` sulla tua proprietà di stato colore
nl: Stel de kleur van `Image` in op de statuseigenschap voor kleur
no: Angi fargen på `Image` som fargestatusegenskapen
pt: Defina a cor de `Image` com a propriedade de estado de cor
sv: Ställ in färgen på `Image` som färgstatusegenskapen
th: ตั้งค่าสีของ `Image` เป็นคุณสมบัติสถานะสีของคุณ
tr: `Image` rengini renk durum özelliğin olarak ayarlama
vi: Đặt màu của `Image` thành thuộc tính trạng thái màu của bạn
zh_cn: 将 `Image` 的颜色设为你的颜色状态属性
zh_tw: 將 `Image` 的顏色設定為你的狀態屬性
