Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: There’s a great opportunity for you to improve your code here. You can simplify the code in this view by replacing the entire `HStack` inside of the [ForEach](glossary://ForEach) structure with a [composed view](glossary://composed%20view), `CreatureRow`.
de: Hier gibt es eine tolle Möglichkeit, deinen Code zu verbessern. Du kannst den Code in dieser Ansicht nämlich vereinfachen, indem du den gesamten `HStack` in der [ForEach](glossary://ForEach)-Struktur durch die [zusammengesetzte Ansicht](glossary://composed%20view) `CreatureRow` (Charakterzeile) ersetzt.
es: Aquí tienes una gran oportunidad de mejorar tu código. Puedes simplificar el código de esta vista sustituyendo toda la pila `HStack` dentro de la estructura [ForEach](glossary://ForEach) por una [vista compuesta](glossary://composed%20view), `CreatureRow`.
es_419: Aquí tienes una excelente oportunidad para mejorar tu código. Puedes simplificar el código en esta visualización al reemplazar toda la pila `HStack` dentro de la estructura [`ForEach`](glossary://ForEach) con una [visualización compuesta](glossary://composed%20view), `CreatureRow`.
fr: Tu as ici une formidable occasion d’améliorer ton code. Tu peux simplifier le code de cette vue en remplaçant toute la `HStack` à l’intérieur de la structure [ForEach](glossary://ForEach) par une [vue composée](glossary://composed%20view), `CreatureRow`.
it: In questa attività, ti viene offerta un buona occasione per migliorare il tuo codice. Puoi semplificare il codice nella vista sostituendo l'intero `HStack` all'interno della struttura [ForEach](glossary://ForEach) con una [vista composta](glossary://composed%20view), `CreatureRow`.
nl: Je hebt hier een geweldige kans om je code te verbeteren. Je kunt de code in deze weergave vereenvoudigen door de hele `HStack` in de [ForEach](glossary://ForEach)-structuur te vervangen door de [samengestelde weergave](glossary://composed%20view) `CreatureRow`.
no: Dette er en god mulighet til å forbedre koden din. Du kan forenkle koden i denne visningen ved å erstatte hele `HStack` inni [ForEach](glossary://ForEach)-strukturen med den [sammenstilte visningen](glossary://composed%20view) `CreatureRow`.
pt: Aqui está uma grande oportunidade de melhorar o seu código. Você pode simplificar o código nesta visualização ao substituir todo o `HStack` dentro da estrutura [ForEach](glossary://ForEach) por uma [visualização composta](glossary://composed%20view), `CreatureRow`.
sv: Här har du en fantastisk möjlighet att förbättra din kod. Du kan förenkla koden i den här vyn genom att ersätta hela `HStack` inuti [ForEach](glossary://ForEach)-strukturen med den [sammanställda vyn](glossary://composed%20view) `CreatureRow`.
th: มีโอกาสที่ดีในการปรับปรุงโค้ดในส่วนนี้ คุณสามารถลดความซับซ้อนของโค้ดในมุมมองนี้ได้โดยแทนที่ `HStack` ทั้งหมดภายในโครงสร้าง [ForEach](glossary://ForEach) ด้วย[มุมมองที่ถูกประกอบ](glossary://composed%20view) `CreatureRow`
tr: Burada kodunu iyileştirmen için harika bir fırsat var. [ForEach](glossary://ForEach) yapısının içindeki tüm `HStack`’i `CreatureRow` adlı [oluşturulmuş görüntü](glossary://composed%20view) ile değiştirerek bu görüntüdeki kodu sadeleştirebilirsin.
vi: Có một cơ hội tuyệt vời để bạn cải thiện mã của mình tại đây. Bạn có thể đơn giản hóa mã trong chế độ xem này bằng cách thay thế toàn bộ `HStack` bên trong cấu trúc [ForEach](glossary://ForEach) bằng một [chế độ xem tổ hợp](glossary://composed%20view), `CreatureRow`.
zh_cn: 这里是你改进代码的大好机会。你可以在这个视图中简化代码：使用[组合视图](glossary://composed%20view) `CreatureRow` 替换 [ForEach](glossary://ForEach) 结构体内的整个 `HStack`。
zh_tw: 你有一個很好的機會來改進你的程式碼。你可以用[組合式顯示區](glossary://composed%20view)`CreatureRow` 來取代 [ForEach](glossary://ForEach) 架構內的整個 `HStack`，藉此簡化這個顯示區中的代碼。

source: Delete the contents of the `HStack` inside the `ForEach` and replace it with `CreatureRow(creature: creature)`.
de: Lösche den Inhalt von `HStack` in `ForEach` und ersetze ihn durch `CreatureRow(creature: creature)`.
es: Borra el contenido de la pila `HStack` dentro de `ForEach` y sustitúyelo por `CreatureRow(creature: creature)`.
es_419: Reemplaza el contenido de `HStack` dentro de `ForEach` con `CreatureRow(creature: creature)`.
fr: Supprime le contenu de la `HStack` à l’intérieur du `ForEach` et remplace-le par `CreatureRow(creature: creature)`.
it: Elimina i contenuti di `HStack` all'interno della struttura `ForEach` e sostituiscili con `CreatureRow(creature: creature)`.
nl: Verwijder de inhoud van de `HStack` in de `ForEach` en vervang deze door `CreatureRow(creature: creature)`.
no: Slett innholdet i `HStack` inni `ForEach`, og erstatt det med `CreatureRow(creature: creature)`.
pt: Apague o conteúdo de `HStack` dentro de `ForEach` e substitua-o por `CreatureRow(creature: creature)`.
sv: Radera innehållet i `HStack` inuti `ForEach` och ersätt det med `CreatureRow(creature: creature)`.
th: ลบเนื้อหาของ `HStack` ภายใน `ForEach` แล้วแทนที่ด้วย `CreatureRow(creature: creature)`
tr: `ForEach`’in içindeki `HStack`’in içeriğini sil ve `CreatureRow(creature: creature)` ile değiştir.
vi: Xóa nội dung của `HStack` bên trong `ForEach` và thay thế bằng `CreatureRow(creature: creature)`.
zh_cn: 删除 `ForEach` 内的 `HStack` 内容，然后将它替换成 `CreatureRow(creature: creature)`。
zh_tw: 刪除 `ForEach` 中 `HStack` 的內容，並且用 `CreatureRow(creature: creative)` 來取代它。

source: Take a look in `CreatureRow.swift` – it contains the same code as you had in the `ForEach` except with a [property](glossary://property) storing a `Creature` value.
de: Wirf einen Blick in `CreatureRow.swift`. Dort findest du denselben Code wie in `ForEach`, nur dass hier eine [Eigenschaft](glossary://property) einen `Creature`-Wert speichert.
es: Echa un vistazo a `CreatureRow.swift`: contiene el mismo código que tenías en `ForEach`, solo que tiene una [propiedad](glossary://property) que almacene un valor de `Creature`.
es_419: Échale un vistazo a `CreatureRow.swift`, pues ahí encontrarás el mismo código que tenías en `ForEach`, excepto con una [propiedad](glossary://property) que contiene un valor de `Creature`.
fr: Jette un œil dans `CreatureRow.swift`, il contient le même code que celui que tu avais dans le `ForEach`, mais avec une [propriété](glossary://property) stockant une valeur `Creature`.
it: Dai un'occhiata al file `CreatureRow.swift`: contiene lo stesso codice che avevi nella struttura `ForEach`, con l'unica differenza che presenta una [proprietà](glossary://property) che corrisponde a un valore `Creature`.
nl: Kijk maar eens in `CreatureRow.swift`; het bevat dezelfde code als in de `ForEach`, maar dan met een [eigenschap](glossary://property) waarin een `Creature`-waarde wordt opgeslagen.
no: Ta en titt i `CreatureRow.swift` – den inneholder den samme koden som du hadde i `ForEach`, med unntak av en [egenskap](glossary://property) som lagrer en `Creature`-verdi.
pt: Dê uma olhada em `CreatureRow.swift` — ele contém o mesmo código que você tinha em `ForEach`, exceto por uma [propriedade](glossary://property) que armazena um valor `Creature`.
sv: Ta en titt i `CreatureRow.swift` – den innehåller samma kod som du hade i `ForEach` förutom med en [egenskap](glossary://property) som lagrar ett `Creature`-värde.
th: ลองดูใน `CreatureRow.swift` ซึ่งมีโค้ดเดียวกันกับที่คุณมีใน `ForEach` ยกเว้น[คุณสมบัติ](glossary://property)ที่จัดเก็บค่า `Creature`
tr: `CreatureRow.swift`’e bir göz at; `Creature` değerini saklayan bir [özellik](glossary://property) dışında, `ForEach`’te sahip olduğun kodun aynısını içerir.
vi: Hãy nhìn vào `CreatureRow.swift` – phần này chứa mã giống như bạn có trong `ForEach`, trừ một [thuộc tính](glossary://property) đang lưu trữ giá trị `Creature`.
zh_cn: 观察一下 `CreatureRow.swift`，它包含了 `ForEach` 中具有的相同代码，除了不包含储存 `Creature` 值的[属性](glossary://property)。
zh_tw: 看一下 `CreatureRow.swift`，它包含與你在 `ForEach` 中使用的相同程式碼，除了儲存 `Creature` 值的[屬性](glossary://property)。

source: Now that you have `CreatureRow` as its own view, it’s easier to modify and test separately from `ContentView`. Composing a view like this improves your code [modularity](glossary://modularity), a fundamental principle of creating apps.
de: Da `CreatureRow` jetzt eine eigene Ansicht ist, kannst du leichter unabhängig von der Inhaltsansicht `ContentView` Änderungen vornehmen und testen. Wenn du auf diese Weise eine Ansicht zusammensetzt, wird die [Modularität](glossary://modularity) des Codes, die ein Kernprinzip bei der Erstellung von Apps ist, verbessert.
es: Ahora que tienes `CreatureRow` como su propia vista, es más fácil de modificar y probar por separado de `ContentView`. Componer una vista así mejora la [modularidad](glossary://modularity) de tu código, un principio fundamental de la creación de apps.
es_419: Ahora que tienes el valor `CreatureRow` en una visualización propia, es más fácil modificarlo y probarlo por separado de `ContentView`. Componer una visualización como esta mejora la [modularidad](glossary://modularity) de tu código, el cual representa un principio fundamental del desarrollo de apps.
fr: Maintenant que `CreatureRow` est une vue à part entière, il est plus facile de la modifier et de la tester séparément de `ContentView`. Composer une vue de cette manière améliore la [modularité](glossary://modularity) de ton code, un principe fondamental de la création d’apps.
it: Adesso che hai inserito `CreatureRow` come una vista a se stante, è più facile modificare il codice e testarlo separatamente da `ContentView`. La composizione di una vista come questa migliora la [modularità](glossary://modularity) del codice, uno dei principi fondamentali per la creazione di app.
nl: Nu `CreatureRow` een eigen weergave heeft, kan deze gemakkelijker afzonderlijk van `ContentView` worden aangepast en getest. Door een dergelijke weergave samen te stellen, verbeter je de [modulariteit](glossary://modularity) van je code. Dit is een basisprincipe voor het aanmaken van apps.
no: Nå når du har `CreatureRow` som en egen visning, blir den enklere å endre og teste separat fra `ContentView`. Ved å sammenstille en visning på denne måten forbedrer du kodens [modularitet](glossary://modularity), noe som er et grunnleggende prinsipp ved appbygging.
pt: Agora que você tem `CreatureRow` como sua própria visualização, é mais fácil modificar e testar separadamente de `ContentView`. Compor uma visualização como essa melhora a [modularidade](glossary://modularity) do seu código, um princípio fundamental da criação de apps.
sv: Nu när du har `CreatureRow` som en egen vy blir den enklare att ändra och testa separat från `ContentView`. Genom att sammanställa en vy på det här sättet förbättrar du kodens [modularitet](glossary://modularity), vilket är en grundläggande princip vid appbyggen.
th: ตอนนี้เมื่อคุณมี `CreatureRow` เป็นมุมมองในตัวเองแล้ว การแก้ไขและทดสอบแยกจาก `ContentView` ก็ทำได้ง่ายขึ้น การเขียนมุมมองแบบนี้ช่วยปรับปรุง[สภาพโมดูลาร์](glossary://modularity)ของโค้ด ซึ่งเป็นหลักการพื้นฐานของการสร้างแอป
tr: Artık `CreatureRow`’a kendi görüntüsü olarak sahip olduğundan, `ContentView`’dan değiştirmek ve ayrıca test etmek daha kolaydır. Bunun gibi bir görüntü oluşturmak, uygulama yaratmanın temel prensibi olan kod [modülerliğini](glossary://modularity) iyileştirir.
vi: Bây giờ bạn có `CreatureRow` dưới dạng chế độ xem riêng, việc sửa đổi và kiểm tra riêng biệt với `ContentView` trở nên dễ dàng hơn. Việc biên soạn một chế độ xem như thế này cải thiện [tính mô-đun](glossary://modularity) của mã, một nguyên tắc cơ bản trong việc tạo ra các ứng dụng.
zh_cn: 既然你有 `CreatureRow`（动物行）作为它自己的视图，就更容易将它与 `ContentView` 分离开来进行修改和测试了。像这样组合视图可以改进代码的[模块化](glossary://modularity)，这是创建 App 的基本准则。
zh_tw: 現在你有 `CreatureRow` 作為它自己的顯示區，它就能更容易地與 `ContentView` 分開修改和測試。組合出這樣的顯示區可以改進你的程式碼[模組化](glossary://modularity)，這是製作 App 的基本原則。

# GuideBook..Guide0..StepSharing Data Between Views..SuccessMessage..Paragraph210
source: Nice!
de: Super!
es: ¡Bien!
es_419: ¡Bien!
fr: Super !
it: Grande!
nl: Mooi!
no: Kult!
pt: Legal!
sv: Snyggt!
th: สวย!
tr: Güzel!
vi: Tuyệt!
zh_cn: 赞！
zh_tw: 太棒了！

# GuideBook..Guide0..StepSharing Data Between Views..SuccessMessage..Paragraph211
source: By passing an observable object into the app environment, you give access to that data to the entire [view hierarchy](glossary://view%20hierarchy). This enables any other views in your app to use the same [source of truth](glossary://source%20of%20truth), instead of trying to re-create data in multiple places.
de: Indem du ein beobachtbares Objekt an die App-Umgebung übergibst, ermöglichst du der gesamten [Ansichtenhierarchie](glossary://view%20hierarchy) den Zugriff auf diese Daten. Dadurch kann jede Ansicht in der App dieselbe [Wahrheitsquelle](glossary://source%20of%20truth) verwenden. So ist es nicht notwendig, die Daten an mehreren Stellen nachzubilden.
es: Al pasar un objeto observable al entorno de la app, permites que toda la [jerarquía de vistas](glossary://view%20hierarchy) tenga acceso a esos datos. Esto permite que todas las demás vistas de tu app usen la misma [fuente de datos](glossary://source%20of%20truth), en lugar de intentar volver a crear los datos en varios lugares.
es_419: Al pasar un objeto observable al entorno de la app, permites que toda la [jerarquía de visualizaciones](glossary://view%20hierarchy) acceda a sus datos. Esto permite que otras visualizaciones de tu app usen la misma [fuente única de información](glossary://source%20of%20truth), en lugar de intentar recrear los datos en varios lugares.
fr: En transmettant un objet observable dans l’environnement de l’app, tu donnes accès à ces données à l’ensemble de la [hiérarchie de vue](glossary://view%20hierarchy). Cela permet à toutes les autres vues de ton app d’utiliser la même [source de vérité](glossary://source%20of%20truth), plutôt que d’essayer de recréer des données à plusieurs endroits.
it: Trasmettendo un oggetto osservabile nell'ambiente dell'app, consentirai ai dati di accedere all'intera [gerarchia di viste](glossary://view%20hierarchy). In questo modo, tutte le altre viste dell'app potranno utilizzare la stessa [sorgente univoca](glossary://source%20of%20truth), invece di tentare di ricreare dati in più posti.
nl: Door een observeerbaar object door te geven aan de appomgeving, geef je de hele [weergavehiërarchie](glossary://view%20hierarchy) toegang tot deze gegevens. Zo kunnen alle andere weergaven in je app dezelfde [bron van waarheid](glossary://source%20of%20truth) gebruiken en hoeven ze niet te proberen om gegevens te reproduceren op meerdere plaatsen.
no: Ved å overføre et observerbart objekt til appmiljøet gir du hele [visningshierarkiet](glossary://view%20hierarchy) tilgang til disse dataene. Dette gjør det mulig for alle visninger i appen til å bruke samme [sannhetskilde](glossary://source%20of%20truth), i stedet for å prøve å gjenskape data på flere steder.
pt: Ao passar um objeto observável para dentro do ambiente do app, você dá acesso a esses dados para toda a [hierarquia de visualização](glossary://view%20hierarchy). Isso permite que qualquer outra visualização do app use a mesma [fonte da verdade](glossary://source%20of%20truth), em vez de tentar recriar dados em vários lugares.
sv: Genom att överföra ett observerbart objekt till appmiljön ger du hela [vyhierarkin](glossary://view%20hierarchy) tillgång till dessa data. Det gör det möjligt för alla vyer i appen att använda samma [sanningskälla](glossary://source%20of%20truth) istället för att försöka återskapa data på flera ställen.
th: เมื่อส่งผ่านวัตถุที่สังเกตเห็นได้ไปยังสภาพแวดล้อมแอป คุณจะให้สิทธิ์เข้าถึงข้อมูลนั้นกับ[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)ทั้งหมด การทำเช่นนี้จะทำให้มุมมองอื่นๆ ทั้งหมดในแอปของคุณสามารถใช้[แหล่งข้อมูลจริง](glossary://source%20of%20truth)เดียวกันได้ แทนที่จะพยายามสร้างข้อมูลใหม่ในหลายๆ ที่
tr: Uygulama ortamına gözlemlenebilir bir nesne geçirerek bu verilerin tüm [görüntü hiyerarşisine](glossary://view%20hierarchy) erişimine izin verirsin. Bu, uygulamandaki diğer görüntülerin birden fazla yerde verileri yeniden yaratmayı denemek yerine aynı [gerçeklik kaynağını](glossary://source%20of%20truth) kullanmasını sağlar.
vi: Bằng việc chuyển một đối tượng có thể quan sát vào môi trường ứng dụng, bạn cấp quyền truy cập vào dữ liệu đó cho toàn bộ [phân cấp xem](glossary://view%20hierarchy). Việc này cho phép bất kỳ chế độ xem nào khác trong ứng dụng của bạn sử dụng cùng một [nguồn chân lý](glossary://source%20of%20truth), thay vì cố gắng tái tạo dữ liệu tại nhiều nơi.
zh_cn: 通过将可观测对象传入 App 环境，你授予了这些数据访问整个[视图层次](glossary://view%20hierarchy)的权限。这可让 App 中的其他视图都使用同一个[可信源](glossary://source%20of%20truth)，而不是尝试在多个地方重新创建数据。
zh_tw: 藉由將一個可觀察的物件傳入到 App 環境中，你可以將該項資料的取用權限授予整個[顯示區階層](glossary://view%20hierarchy)。這能讓你的 App 中的任何其他顯示區都可以使用相同的[真實來源](glossary://source%20of%20truth)，而不是嘗試在多個位置中重新建立資料。

# GuideBook..Guide0..StepCreate a New View To Share Data..title
source: Create a New View To Share Data
de: Neue Ansicht zum Teilen von Daten erstellen
es: Crear una nueva vista para compartir datos
es_419: Crear una nueva visualización para compartir datos
fr: Créer une vue pour partager des données
it: Creare una nuova vista per condividere dati
nl: Een nieuwe weergave aanmaken voor het delen van gegevens
no: Opprett en ny visning for å dele data
pt: Crie uma Nova Visualização para Compartilhar Dados
sv: Skapa en ny vy för att dela data
th: สร้างมุมมองใหม่เพื่อแชร์ข้อมูล
tr: Veri Paylaşmak İçin Yeni Görüntü Yaratma
vi: Tạo một chế độ xem mới để chia sẻ dữ liệu
zh_cn: 创建新视图来共享数据
zh_tw: 製作一個新的顯示區來共享資料

source: Now that you’ve successfully shared data with one view, it’s time to use that same data in other views.
de: Du hast schon erfolgreich Daten mit einer Ansicht geteilt. Jetzt ist es an der Zeit, dieselben Daten in anderen Ansichten zu verwenden.
es: Ahora que has compartido los datos con una vista correctamente, es hora de utilizar esos mismos datos en otras vistas.
es_419: Ahora que lograste compartir datos con una visualización, es hora de usar esos datos en otras visualizaciones.
fr: Maintenant que tu as réussi à partager des données avec une vue, il est temps d’utiliser ces mêmes données dans d’autres vues.
it: Adesso che hai imparato a condividere i dati con una vista, è arrivato il momento di usare gli stessi dati in altre viste.
nl: Nu het je is gelukt om gegevens te delen met één weergave, is het tijd om dezelfde gegevens in andere weergaven te gebruiken.
no: Nå når du har lykkes med å dele data med én visning, er det på tide å bruke de samme dataene i andre visninger.
pt: Agora que você conseguiu compartilhar dados com uma visualização, está na hora de usar esses mesmos dados em outras visualizações.
sv: Nu när du har lyckats dela data med en vy är det dags att använda samma data i andra vyer.
th: ตอนนี้เมื่อคุณได้แชร์ข้อมูลกับมุมมองหนึ่งสำเร็จแล้ว ก็ถึงเวลาใช้ข้อมูลเดียวกันนั้นในมุมมองอื่นๆ
tr: Verileri bir görüntü ile başarılı bir şekilde paylaştığına göre, artık aynı verileri diğer görüntülerde kullanmanın zamanı geldi.
vi: Bây giờ bạn đã chia sẻ thành công dữ liệu với một chế độ xem, đã đến lúc sử dụng cùng dữ liệu đó trong các chế độ xem khác.
zh_cn: 成功与一个视图共享数据后，现在尝试在其他视图中使用这些相同的数据吧。
zh_tw: 現在你已經成功地與一個顯示區共享資料，是時候在其他顯示區中使用相同的資料了。

source: To do this, you need to do two things:
de: Dafür musst du zwei Dinge tun:
es: Para ello, tienes que hacer dos cosas:
es_419: Para lograrlo, necesitas hacer dos cosas:
fr: Pour ce faire, tu dois effectuer deux choses :
it: Per raggiungere questo obiettivo, devi fare due cose:
nl: Om dit te doen, moet je twee dingen doen:
no: Du må gjøre to ting for å gjøre dette:
pt: Para isso, você precisa de duas coisas:
sv: Du behöver göra två saker för att göra detta:
th: ในการทำเช่นนี้ คุณจะต้องทำสองสิ่ง:
tr: Bunu yapmak için iki şey yapman gerekir:
vi: Để thực hiện việc này, bạn cần làm hai việc:
zh_cn: 你需要做两件事来完成这个操作：
zh_tw: 為此，你需要做兩件事：
