Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Next, you need to add a `Button` that people can tap to add their new creature.
de: Als Nächstes musst du mit `Button` eine Taste hinzufügen, die gedrückt werden kann, um einen neuen Charakter hinzuzufügen.
es: A continuación, necesitas añadir un botón (`Button`) que las personas pueden tocar para añadir su nueva criatura.
es_419: Después, necesitas agregar un botón (`Button`) que las personas puedan tocar para agregar sus propias criaturas.
fr: Ensuite, tu as besoin d’ajouter un `Button` qui sert à ajouter une nouvelle créature.
it: Adesso ti serve un `Button` che l'utente può toccare per aggiungere nuove creature.
nl: Vervolgens heb je een `Button` nodig waarop gebruikers kunnen tikken om hun nieuwe wezen toe te voegen.
no: Deretter må du legge til en `Button` som personer kan trykke på når de vil legge til den nye skapningen sin.
pt: Depois, você precisa adicionar um `Button` que as pessoas possam tocar para adicionar uma nova criatura.
sv: Härnäst måste du lägga till en `Button` som personer kan trycka på när de vill lägga till sin nya varelse.
th: ถัดไป คุณต้องเพิ่ม `Button` ที่ผู้คนสามารถแตะเพื่อเพิ่มสิ่งมีชีวิตใหม่ของเขาได้
tr: Sonra, kişilerin kendi yeni yaratıklarını eklemek için dokunabileceğini bir düğme (`Button`) eklemen gerekir.
vi: Tiếp theo, bạn cần thêm một `Button` mà mọi người có thể chạm vào để thêm sinh vật mới của họ.
zh_cn: 下一步，你需要添加一个 `Button`，可让用户通过轻点来添加新动物。
zh_tw: 接下來，你需要加入一個 `Button` 讓使用者點按來加入他們自己的新生物。

source: Just like in `ContentView`, the best place to put a button like this is in the [navigation bar](glossary://navigation%20bar) of `CreatureEditor`.
de: Wie bei `ContentView` ist es am besten, so eine Taste in die [Navigationsleiste](glossary://navigation%20bar) von `CreatureEditor` (Charaktereditor) zu platzieren.
es: Al igual que en la vista de contenido (`ContentView`), el mejor lugar para poner un botón como este es en la [barra de navegación](glossary://navigation%20bar) de `CreatureEditor`.
es_419: Igual que en la visualización `ContentView`, la [barra de navegación](glossary://navigation%20bar) de `CreatureEditor` es el mejor lugar para colocar un botón como este.
fr: Tout comme dans `ContentView`, le meilleur endroit pour placer un bouton comme celui-ci est dans la [barre de navigation](glossary://navigation%20bar) de `CreatureEditor`.
it: Proprio come in `ContentView`, il posto migliore per inserire un pulsante di questo tipo è nella [barra di navigazione](glossary://navigation%20bar) di `CreatureEditor`.
nl: Net als in `ContentView` is de [navigatiebalk](glossary://navigation%20bar) van `CreatureEditor` de beste plaats om een dergelijke knop toe te voegen.
no: Akkurat som i `ContentView`, er det beste stedet å plassere en knapp som dette, i [navigeringslinjen](glossary://navigation%20bar) i `CreatureEditor`.
pt: Da mesma forma como em `ContentView`, o melhor lugar para colocar um botão como este é na [barra de navegação](glossary://navigation%20bar) do `CreatureEditor`.
sv: Precis som i `ContentView` är det bästa stället att placera en knapp som den här i [navigeringsfältet](glossary://navigation%20bar) i `CreatureEditor`.
th: เช่นเดียวกับใน `ContentView` ตำแหน่งที่ดีที่สุดในการใส่ปุ่มแบบนี้จะอยู่ใน[แถบการนำทาง](glossary://navigation%20bar) ของ `CreatureEditor`
tr: Tıpkı `ContentView`’da olduğu gibi, bunun gibi bir düğme koymak için en iyi yer `CreatureEditor` [dolaşma çubuğudur](glossary://navigation%20bar).
vi: Cũng giống như trong `ContentView`, nơi phù hợp nhất để đặt một nút giống như thế này là trong [thanh điều hướng](glossary://navigation%20bar) của `CreatureEditor`.
zh_cn: 就像在 `ContentView` 中一样，`CreatureEditor` 的[导航栏](glossary://navigation%20bar)中最适合放置这样的按钮。
zh_tw: 就像在 `ContentView` 中一樣，放置像這樣按鈕的最佳位置就是在 `CreatureEditor` 的[導覽列](glossary://navigation%20bar)中。

source: Try using the `.toolbar` code from `ContentView` as an example to add a toolbar to `CreatureEditor`:
de: Verwende den `.toolbar`-Code von `ContentView` als Beispiel, um eine Symbolleiste zu `CreatureEditor` hinzuzufügen:
es: Prueba a usar el código `.toolbar` de la vista de contenido (`ContentView`) como ejemplo para añadir una barra de herramientas a `CreatureEditor`:
es_419: Intenta usar como ejemplo el código de `.toolbar` de la visualización `ContentView` para agregar una barra de herramientas a `CreatureEditor`:
fr: Essaie d’utiliser le code `.toolbar` de `ContentView` comme exemple pour ajouter une barre d’outils à `CreatureEditor` :
it: Prova a usare il codice `.toolbar` da `ContentView` come esempio su come aggiungere una barra degli strumenti a `CreatureEditor`:
nl: Gebruik de `.toolbar`-code uit `ContentView` als uitgangspunt voor het toevoegen van een knoppenbalk aan `CreatureEditor`:
no: Prøv å bruke koden `.toolbar` fra `ContentView` som et eksempel på hvordan du legger til en verktøylinje i `CreatureEditor`:
pt: Tente usar o código `.toolbar` de `ContentView` como um exemplo de como adicionar uma barra de ferramentas a `CreatureEditor`:
sv: Prova att använda koden `.toolbar` från `ContentView` som ett exempel på hur du lägger till ett verktygsfält i `CreatureEditor`:
th: ลองใช้โค้ด `.toolbar` จาก `ContentView` เป็นตัวอย่างเพื่อเพิ่มแถบเครื่องมือไปยัง`CreatureEditor`:
tr: `CreatureEditor`’a araç çubuğu eklemenin bir örneği olarak `ContentView`’daki `.toolbar` kodunu kullanmayı dene`:
vi: Thử sử dụng mã `.toolbar` từ `ContentView` như một ví dụ để thêm thanh công cụ vào `CreatureEditor`:
zh_cn: 尝试将 `ContentView` 中的 `.toolbar` 代码用作将工具栏添加到 `CreatureEditor` 的示例：
zh_tw: 嘗試使用來自 `ContentView` 的 `.toolbar` 程式碼作為範例來加入工具列到 `CreatureEditor`：

source: Add the `.toolbar` modifier below your `VStack`.
de: Füge den Modifikator `.toolbar` unter den `VStack` hinzu.
es: Añade el modificador `.toolbar` debajo de `VStack`.
es_419: Agrega el modificador `.toolbar` debajo de `VStack`.
fr: Ajoute le modificateur `.toolbar` sous ta `VStack`.
it: Aggiungi il modificatore `.toolbar` sotto `VStack`.
nl: Voeg de modifier `.toolbar` toe onder de `VStack`.
no: Legg til modifikatoren `.toolbar` nedenfor `VStack`.
pt: Adicione o modificador `.toolbar` abaixo de `VStack`.
sv: Lägg till modifieraren `.toolbar` nedanför `VStack`.
th: เพิ่มปุ่มปรับค่า`.toolbar` ด้านล่าง`VStack` ของคุณ
tr: `VStack`’inin altına `.toolbar` niteleyicisini ekle.
vi: Thêm trình sửa đổi `.toolbar` bên dưới `VStack` của bạn.
zh_cn: 在 `VStack` 下方添加 `.toolbar` 修饰符。
zh_tw: 在 `VStack` 下方加入 `.toolbar` 修飾符。

source: Inside the toolbar, add a `ToolbarItem`.
de: Füge in der Symbolleiste `ToolbarItem` (Symbolleistenobjekt) hinzu.
es: Dentro de la barra de herramientas, añade un ítem de barra de herramientas (`ToolbarItem`).
es_419: Dentro de la barra de herramientas, agrega `ToolbarItem`.
fr: Dans la barre d’outils, ajoute un `ToolbarItem`.
it: Nella barra degli strumenti aggiungi un `ToolbarItem`.
nl: Voeg een `ToolbarItem` toe in de knoppenbalk.
no: Legg til `ToolbarItem` i verktøylinjen.
pt: Dentro da barra de ferramentas, adicione um `ToolbarItem`.
sv: Lägg till `ToolbarItem` inuti verktygsfältet.
th: ภายในแถบเครื่องมือ ให้เพิ่ม `ToolbarItem`
tr: Araç çubuğunun içinde bir `ToolbarItem` ekle.
vi: Bên trong thanh công cụ, hãy thêm một `ToolbarItem`.
zh_cn: 在工具栏内，添加 `ToolbarItem`。
zh_tw: 在工具列內加入一個 `ToolbarItem`。

source: Inside the `ToolbarItem`, add a `Button` with a [label](glossary://label) that reads “Add”. You can leave the action [closure](glossary://closure) for the `Button` empty for now.
de: Füge in `ToolbarItem` die Taste `Button` mit einem [Etikett](glossary://label) hinzu, auf dem „Hinzufügen“ steht. Du kannst den [Funktionsabschluss](glossary://closure) der Aktion für `Button` erst einmal leer lassen.
es: Dentro del ítem de barra de herramientas (`ToolbarItem`), añade un botón (`Button`) con una [etiqueta](glossary://label) que ponga “Añadir”. De momento, puedes dejar vacía la acción de [clausura](glossary://closure) del botón (`Button`).
es_419: Dentro de `ToolbarItem`, agrega un `Button` con una [etiqueta](glossary://label) que diga “Agregar”. Por ahora, puedes dejar vacía la [clausura](glossary://closure) de la acción de `Button`.
fr: Dans le `ToolbarItem`, ajoute un `Button` avec une [étiquette](glossary://label) qui indique « Ajouter ». Tu peux laisser la [clôture](glossary://closure) d’action pour le `Button` vide pour le moment.
it: All'interno di `ToolbarItem`, aggiungi un `Button` con un'[etichetta](glossary://label) con il testo “Aggiungi”. Per il momento, puoi lasciare vuota l'azione [chiusura](glossary://closure) per `Button`.
nl: Voeg in `ToolbarItem` een `Button` toe met een [label](glossary://label) met de tekst “Voeg toe”. Je kunt de [closure](glossary://closure) van de actie voor de `Button` voorlopig leeg laten.
no: Legg til en `Button` med en [etikett](glossary://label) der det står «Add» inni `ToolbarItem`. Du kan la handlingen [closure-blokk](glossary://closure) for `Button` være tom for nå.
pt: Dentro de `ToolbarItem`, adicione um `Button` com uma [etiqueta](glossary://label) com a palavra “Adicionar”. Por enquanto, você pode deixar o [encerramento](glossary://closure) da ação do `Button` vazio.
sv: Lägg till en `Button` med en [etikett](glossary://label) där det står ”Add” inuti `ToolbarItem`. Du kan låta åtgärden [stängning](glossary://closure) för `Button` vara tom nu.
th: ภายใน `ToolbarItem` ให้เพิ่ม `Button` ที่มี[ป้าย](glossary://label)เขียนว่า “เพิ่ม” คุณสามารถปล่อยให้[การปิด](glossary://closure)การทำงานสำหรับ `Button` ว่างไว้ในตอนนี้ได้
tr: `ToolbarItem`’ın içinde, [etiketinde](glossary://label) “Ekle” yazan bir `Button` ekle. `Button` için eylem [kapamasını](glossary://closure) şimdilik boş bırakabilirsin.
vi: Bên trong `ToolbarItem`, hãy thêm một `Button` với [nhãn](glossary://label) có nội dung “Thêm”. Bây giờ, bạn có thể để trống [bao đóng](glossary://closure) hành động cho `Button`.
zh_cn: 在 `ToolbarItem` 中，添加一个[标签](glossary://label)为“添加”的 `Button`。目前你可以将 `Button` 的操作[闭包](glossary://closure)留空。
zh_tw: 在 `ToolbarItem` 內加入一個帶有[標籤](glossary://label)讀作「加入」的 `Button`。你目前可以讓 `Button` 的動作[閉包](glossary://closure)留空。

source: .toolbar { ToolbarItem { Button("Add") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
de: .toolbar { ToolbarItem { Button("Hinzufügen") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
es: .toolbar { ToolbarItem { Button("Añadir") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
es_419: .toolbar { ToolbarItem { Button("Agregar") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
fr: .toolbar { ToolbarItem { Button("Ajouter") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
nl: .toolbar { ToolbarItem { Button("Voeg toe") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
no: .toolbar { ToolbarItem { Button("Legg til") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
pt: .toolbar { ToolbarItem { Button("Adicionar") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
sv: .toolbar { ToolbarItem { Button("Lägg till") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
tr: .toolbar { ToolbarItem { Button("Ekle") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
vi: .toolbar { ToolbarItem { Button("Thêm") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }
zh_cn: .toolbar { ToolbarItem { Button("添加") { //#-learning-code-snippet(addCreatureToCreatureZoo) //#-learning-code-snippet(dismissCall) } } }

source: Add your creature to `CreatureZoo`
de: Charakter zu `CreatureZoo` hinzufügen
es: Añadir tu criatura a `CreatureZoo`
es_419: Agregar la criatura a `CreatureZoo`
fr: Ajouter ta créature à `CreatureZoo`
it: Aggiungere la tua creatura su `CreatureZoo`
nl: Je wezen aan `CreatureZoo` toevoegen
no: Legg til skapningen i `CreatureZoo`
pt: Adicione a criatura a `CreatureZoo`
sv: Lägg till din varelse i `CreatureZoo`
th: เพิ่มสิ่งมีชีวิตของคุณไปยัง `CreatureZoo`
tr: Yaratığını `CreatureZoo`’ya ekleme
vi: Thêm sinh vật của bạn vào `CreatureZoo`
zh_cn: 将动物添加到 `CreatureZoo`
zh_tw: 將你的生物加入 `CreatureZoo`

source: When you tap the Add button, you want to add your creature instance to your observable object, `CreatureZoo`. Specifically, you want to append the creature to the `creatures` array.
de: Wenn auf die Taste „Hinzufügen“ getippt wird, soll die Charakterinstanz zum beobachtbaren Objekt `CreatureZoo` hinzugefügt werden. Genauer gesagt: Der Charakter soll dem Array `creatures` angefügt werden.
es: Al tocar el botón Añadir, quieres añadir tu instancia de criatura a tu objeto observable, `CreatureZoo`. En concreto, quieres añadir la criatura al vector `creatures`.
es_419: Cuando toques el botón Agregar, debería agregarse la instancia de la criatura a tu objeto observable, `CreatureZoo`; es decir, la criatura debería agregarse al final del arreglo `creatures`.
fr: Lorsque tu touches le bouton Ajouter, tu veux ajouter ton instance de créature à ton objet observable, `CreatureZoo`. Plus précisément, tu veux ajouter la créature au tableau `creatures`.
it: Quando tocchi il pulsante Aggiungi, vuoi che l'istanza della creatura sia aggiunta all'oggetto osservabile `CreatureZoo`. Nello specifico, devi aggiungere la creatura all'array `creatures`.
nl: Je wilt dat er een instantie van een wezen aan je observeerbare object `CreatureZoo` wordt toegevoegd als je op de knop 'Voeg toe' tikt. Je wilt dus dat het wezen aan de array `creatures` wordt toegevoegd.
no: Når du trykker på knappen «Add», vil du legge til skapningsinstansen i det observerbare objektet `CreatureZoo`. Spesifikt vil du tilføye skapningen i matrisen `creatures`.
pt: Ao tocar no botão Adicionar, você quer adicionar a instância da criatura ao objeto observável `CreatureZoo`. Especificamente, você precisa afixar a criatura ao vetor `creatures`.
sv: När du trycker på knappen ”Lägg till” vill du lägga till din varelseinstans i det observerbara objektet `CreatureZoo`. Specifikt vill du bifoga varelsen i arrayen `creatures`.
th: เมื่อคุณแตะปุ่มเพิ่ม คุณต้องการเพิ่มชื่อแทนประเภทสิ่งมีชีวิตของคุณไปยังวัตถุที่สังเกตเห็นได้ นั่นคือ `CreatureZoo` กล่าวอย่างเจาะจงคือ คุณต้องการผนวกสิ่งมีชีวิตไปยังอาร์เรย์ `creatures`
tr: Ekle düğmesine dokunduğunda, yaratık örneğinin `CreatureZoo` gözlemlenebilir nesnene eklenmesini istersin. Özellikle, yaratığı `creatures` dizisinin sonuna eklemek istersin.
vi: Khi chạm vào nút Thêm, bạn muốn thêm thể hiện sinh vật của mình vào đối tượng có thể quan sát, `CreatureZoo`. Cụ thể, bạn muốn nối sinh vật đó vào dãy `creatures`.
zh_cn: 当你轻点“添加”按钮时，就表示你想将动物实例添加到可观测对象 `CreatureZoo`。具体来说，你想要将动物追加到 `creatures` 数组。
zh_tw: 當你點一下「加入」按鈕時，你希望將你的生物實例加入可觀察的物件 `CreatureZoo` 中。具體來說，你希望將生物附加到 `creatures` 陣列中。

source: The following code adds the creature being edited to `data.creatures`. Remember, `creatures` is a [published value](glossary://published%20value), so any changes to that value causes all of the views that use that data to automatically update.
de: Der folgende Code fügt den Charakter, der gerade bearbeitet wird, zu `data.creatures` hinzu. Denke aber daran, dass `creatures` ein [veröffentlichter Wert](glossary://published%20value) ist. Alle Änderungen an diesem Wert führen dazu, dass alle Ansichten, die ihn verwenden, automatisch aktualisiert werden.
es: El siguiente código añade la criatura que se está editando a `data.creatures`. Recuerda: `creatures` es un [valor publicado](glossary://published%20value), por lo que cualquier cambio en ese valor hace que todas las vistas que utilizan esos datos se actualicen automáticamente.
es_419: El siguiente código agrega la criatura que se está editando a `data.creatures`. Recuerda, `creatures` es un [valor publicado](glossary://published%20value), de modo que cualquier cambio en él ocasionará que se actualicen automáticamente todas las visualizaciones que lo usen.
fr: Le code suivant ajoute la créature en cours de modification à `data.creatures`. N’oublie pas que `creatures` est une [valeur publiée](glossary://published%20value) et que toute modification apportée à cette valeur entraîne la mise à jour automatique de toutes les vues qui utilisent ces données.
it: La porzione di codice seguente aggiunge la creatura che stai modificando a `data.creatures`. Ricordati che `creatures` è un [valore pubblicato](glossary://published%20value), di conseguenza qualsiasi modifica apportata a tale valore comporta l'aggiornamento automatico di tutte le viste che utilizzano quei dati.
nl: Met de volgende code voeg je het wezen dat wordt bewerkt toe aan `data.creatures`. Vergeet niet dat `creatures` een [gepubliceerde waarde](glossary://published%20value) is, dus alle weergaven die die waarde gebruiken worden automatisch bijgewerkt als die waarde verandert.
no: Følgende kode legger til skapningen som redigeres, i `data.creatures`. Husk at `creatures` er en [publisert verdi](glossary://published%20value), så eventuelle endringer av denne verdien fører til at alle visninger som bruker disse dataene, oppdateres automatisk.
pt: O código a seguir adiciona a criatura que está sendo editada a `data.creatures`. Lembre-se, como `creatures` é um [valor publicado](glossary://published%20value), qualquer alteração a esse valor faz com que as visualizações que usam esses dados sejam atualizadas automaticamente.
sv: Följande kod lägger till varelsen som redigeras i `data.creatures`. Kom ihåg att `creatures` är ett [publicerat värde](glossary://published%20value), så eventuella ändringar av det värdet leder till att alla vyer som använder dessa data automatiskt uppdateras.
th: โค้ดต่อไปนี้จะเพิ่มสิ่งมีชีวิตที่กำลังแก้ไขไปยัง `data.creatures` อย่าลืมว่า `creatures` เป็น[ค่าที่เผยแพร่](glossary://published%20value) ดังนั้นการเปลี่ยนแปลงใดๆ ที่ทำกับค่านั้นจะทำให้มุมมองทั้งหมดที่ใช้ค่านั้นอัปเดตโดยอัตโนมัติ
tr: Aşağıdaki kod, düzenlenen yaratığı `data.creatures`’a ekler. Unutma, `creatures` [yayımlanan bir değer](glossary://published%20value), o nedenle bu değerde yapılan tüm değişiklikler bu verileri kullanan tüm görüntülerin otomatik olarak güncellenmesine neden olur.
vi: Mã sau đây thêm sinh vật đang được sửa vào `data.creatures`. Hãy nhớ rằng `creatures` là một [giá trị đã đăng](glossary://published%20value), nên bất kỳ thay đổi nào đối với giá trị đó đều khiến tất cả các chế độ xem sử dụng dữ liệu đó tự động cập nhật.
zh_cn: 以下代码会将要编辑的动物添加到 `data.creatures`。别忘了，`creatures` 是[发布值](glossary://published%20value)，因此对这个值的任何更改都会导致使用这个数据的所有视图自动更新。
zh_tw: 以下程式碼會將正在編輯的生物加入 `data.creatures`。請記住，`creatures` 是一個[發佈的數值](glossary://published%20value)，因此對該數值的任何更動都會導致使用該項資料的所有顯示區自動更新。

source: Add this code inside the action [closure](glossary://closure) for your `Button`.
de: Füge diesen Code in den [Funktionsabschluss](glossary://closure) der Aktion für `Button` ein.
es: Añade este código dentro de la [clausura](glossary://closure) de la acción del botón (`Button`).
es_419: Agrega este código dentro de la [clausura](glossary://closure) de tu elemento `Button`.
fr: Ajoute ce code à l’intérieur de la [clôture](glossary://closure) d’action pour le `Button`.
it: Aggiungi questo codice all'interno dell'azione [chiusura](glossary://closure) per il tuo `Button`.
nl: Voeg deze code toe in de [closure](glossary://closure) van de actie voor je `Button`.
no: Legg til denne koden inni handlingens [closure-blokk](glossary://closure) for `Button`.
pt: Adicione este código dentro da ação [encerramento](glossary://closure) para seu `Button`.
sv: Lägg till den här koden inuti åtgärdens [stängning](glossary://closure) för `Button`.
th: เพิ่มโค้ดนี้ภายใน[การปิด](glossary://closure)การทำงานสำหรับ `Button` ของคุณ
tr: Bu kodu düğmenin (`Button`) eylem [kapamasının](glossary://closure) içine ekle.
vi: Thêm mã này vào bên trong [bao đóng](glossary://closure) hành động cho `Button` của bạn.
zh_cn: 在 `Button` 的操作[闭包](glossary://closure)内添加这些代码。
zh_tw: 將這段程式碼加入你的 `Button` 動作[閉包](glossary://closure)。

source: Run your app and try adding a new creature.
de: Führe deine App aus und versuche, einen neuen Charakter hinzuzufügen.
es: Ejecuta tu app y prueba a añadir una nueva criatura.
es_419: Ejecuta tu app e intenta crear una criatura nueva.
fr: Exécute ton app et essaie d’ajouter une nouvelle créature.
it: Esegui l'app e prova ad aggiungere una nuova creatura.
nl: Voer je app uit en probeer een nieuw wezen toe te voegen.
no: Kjør appen, og prøv å legge til en ny skapning.
pt: Execute o app e tente adicionar uma nova criatura.
sv: Kör appen och försök att lägga till en ny varelse.
th: รันแอปของคุณแล้วลองเพิ่มสิ่งมีชีวิตใหม่
tr: Uygulamanı çalıştır ve yeni bir yaratık eklemeyi dene.
vi: Chạy ứng dụng của bạn và thử thêm một sinh vật mới.
zh_cn: 运行 App，然后尝试添加新动物。
zh_tw: 執行你的程式碼並嘗試加入新的生物。

source: Navigate back to `ContentView` to see if the new creature was added to the `List` view. Was it also added in the `DancingCreatures` view?
de: Gehe zu `ContentView` zurück, um zu überprüfen, ob der neue Charakter zur Ansicht `List` hinzugefügt wurde. Wurde er auch zur Ansicht `DancingCreatures` (tanzende Charaktere) hinzugefügt?
es: Vuelve a la vista de contenido (`ContentView`) para ver si la nueva criatura se ha añadido a la vista de lista (`List`). ¿Se ha añadido también a la vista `DancingCreatures`?
es_419: Regresa a `ContentView` para revisar si la criatura nueva se agregó a la visualización `List`. ¿También se agregó en la visualización `DancingCreatures`?
fr: Revenez à `ContentView` pour voir si la nouvelle créature a été ajoutée à la vue `List`. A-t-elle également été ajoutée à la vue `DancingCreatures` ?
it: Ritorna a `ContentView` per vedere se la creatura è stata aggiunta alla vista `List`. È stata aggiunta anche alla vista `DancingCreatures`?
nl: Navigeer terug naar `ContentView` om te kijken of het nieuwe wezen aan de weergave `List` is toegevoegd. Is het ook toegevoegd aan de weergave `DancingCreatures`?
no: Naviger tilbake til `ContentView` for å se om den nye skapningen ble lagt til i visningen `List`. Ble den også lagt til i visningen `DancingCreatures`?
pt: Navegue de volta à`ContentView` para ver se a nova criatura foi adicionada à visualização `List`. Será que ela foi adicionada também à visualização `DancingCreatures`?
sv: Navigera tillbaka till `ContentView` för att se om den nya varelsen lades till i vyn `List`. Lades den också till i vyn `DancingCreatures`?
th: นำทางกลับไปยัง `ContentView` เพื่อดูว่าสิ่งมีชีวิตใหม่ถูกเพิ่มไปยังมุมมอง `List` หรือไม่ และถูกเพิ่มลงในมุมมอง `DancingCreatures` ด้วยหรือไม่
tr: Yeni yaratığın `List` görüntüsüne eklenip eklenmediğini görmek için `ContentView`’a geri dön. `DancingCreatures` görüntüsüne de eklendi mi?
vi: Điều hướng trở lại `ContentView` để xem sinh vật mới có được thêm vào chế độ xem `List` hay không. Sinh vật đó cũng được thêm vào chế độ xem `DancingCreatures` chứ?
zh_cn: 导航回 `ContentView`，查看新动物是否添加到了 `List` 视图。它也添加到了 `DancingCreatures` 视图吗？
zh_tw: 導覽回到 `ContentView` 來看看是否已將新的生物加入了 `List` 顯示區。而且是否也加入了 `DancingCreatures` 顯示區？
