Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Add a `NavigationLink` to `CreatureDetail`
de: `NavigationLink` zu `CreatureDetail` hinzufügen
es: Añadir un enlace de navegación (`NavigationLink`) a `CreatureDetail`
es_419: Agregar un enlace `NavigationLink` a la visualización `CreatureDetail`
fr: Ajouter un `NavigationLink` à `CreatureDetail`
it: Aggiungere un `NavigationLink` a `CreatureDetail`
nl: Een `NavigationLink` aan `CreatureDetail` toevoegen
no: Legg til en `NavigationLink` i `CreatureDetail`
pt: Adicione um `NavigationLink` a `CreatureDetail`
sv: Lägg till en `NavigationLink` i `CreatureDetail`
th: เพิ่ม `NavigationLink` ไปยัง `CreatureDetail`
tr: `CreatureDetail`’a `NavigationLink` ekleme
vi: Thêm một `NavigationLink` vào `CreatureDetail`
zh_cn: 将 `NavigationLink` 添加到 `CreatureDetail`
zh_tw: 將一個 `NavigationLink` 加入 `CreatureDetail`

source: Your goal is to make every view of your [ForEach](glossary://ForEach) loop into its own `NavigationLink`, each of which navigates to a detail view of a creature in your `data.creatures` array.
de: Ziel ist es, jede Ansicht der [ForEach](glossary://ForEach)-Schleife in eine Instanz von `NavigationLink` (Navigations-Link) zu verwandeln, die jeweils zu einer Detailansicht eines Charakters im Array `data.creatures` (Charakterdaten) führt.
es: Tu objetivo es convertir cada vista del bucle [ForEach](glossary://ForEach) en su propio enlace de navegación (`NavigationLink`), y cada uno de ellos navega a una vista detallada de una criatura en el vector `data.creatures`.
es_419: Tu objetivo es hacer que cada visualización de tu ciclo [ForEach](glossary://ForEach) recorra su propio `NavigationLink`, y que cada uno muestre una visualización detallada de una criatura en tu arreglo `data.creatures`.
fr: Ton objectif est de faire de chaque vue de ta boucle [ForEach](glossary://ForEach) son propre `NavigationLink`, chacun d’entre eux conduisant à une vue détaillée d’une créature de ton tableau `data.creatures`.
it: Il tuo obiettivo è trasformare ogni vista del ciclo [ForEach](glossary://ForEach) in un `NavigationLink` a se stante, ognuno dei quali navigherà sulla vista dettagliata di una creatura nel tuo array `data.creatures`.
nl: Je doel is om elke weergave van je [ForEach](glossary://ForEach)-lus in een afzonderlijke `NavigationLink` te veranderen, waarmee je naar een gedetailleerde weergave van een wezen in je array `data.creatures` navigeert.
no: Målet ditt er å gjøre alle visninger i [ForEach](glossary://ForEach)-løkken til sin egen `NavigationLink`, som hver og en navigerer til en detaljvisning av en skapning i matrisen `data.creatures`.
pt: Seu objetivo é criar todas as visualizações do loop [ForEach](glossary://ForEach) dentro do seu próprio `NavigationLink`, e que cada um navegue para uma visualização detalhada de uma criatura no vetor `data.creatures`.
sv: Ditt mål är att göra alla vyer i [ForEach](glossary://ForEach)-loopen till sin egen `NavigationLink` som var och en navigerar till en detaljvy av en varelse i arrayen `data.creatures`.
th: เป้าหมายของคุณคือทำให้ทุกมุมมองของ [ForEach](glossary://ForEach) loop กลายเป็น `NavigationLink` ในตัวเอง โดยที่แต่ละรายการจะนำทางไปยังมุมมองรายละเอียดของสิ่งมีชีวิตในอาร์เรย์ `data.creatures` ของคุณ
tr: Hedefin, [ForEach](glossary://ForEach) döngünün her görüntüsünü, her biri `data.creatures` dizinindeki bir yaratığın ayrıntılı görüntüsüne giden kendi `NavigationLink`’ine dönüştürmektir.
vi: Mục tiêu của bạn là làm cho mọi chế độ xem của [ForEach](glossary://ForEach) lặp lại vào `NavigationLink` của chính nó, mỗi chế độ xem điều hướng đến một chế độ xem chi tiết của sinh vật trong dãy `data.creatures` của bạn.
zh_cn: 你的目标是让 [ForEach](glossary://ForEach) 循环的每个视图成为它自己的 `NavigationLink`，其每个视图都会导航至 `data.creatures` 数组中某个动物的详细视图。
zh_tw: 你的目標是讓你的 [ForEach](glossary://ForEach) 迴圈的每個顯示區變成它自己的 `NavigationLink`，每個顯示區都會導覽至你的 `data.creatures` 陣列中一個生物的詳細顯示區。

source: To do this, replace the current contents of the `ForEach` loop with a `NavigationLink`:
de: Ersetze dazu den aktuellen Inhalt der `ForEach`-Schleife durch eine `NavigationLink`-Instanz:
es: Para ello, sustituye el contenido actual del bucle `ForEach` con un enlace de navegación (`NavigationLink`):
es_419: Para lograrlo, reemplaza el contenido del ciclo `ForEach` con un `NavigationLink`:
fr: Pour ce faire, remplace les contenus actuels de la boucle `ForEach` par un `NavigationLink`.
it: Per farlo, sostituisci i contenuti attuali del ciclo `ForEach` con un `NavigationLink`:
nl: Om dit te doen, vervang je de huidige inhoud van de `ForEach`-lus te vervangen door een `NavigationLink`:
no: Gjør dette ved å erstatte det aktuelle innholdet i `ForEach`-løkken med en `NavigationLink`:
pt: Para fazer isso, substitua os conteúdos atuais do loop `ForEach` por um `NavigationLink`:
sv: Gör detta genom att ersätta det aktuella innehållet i `ForEach`-loopen med en `NavigationLink`:
th: ในการทำเช่นนี้ ให้แทนที่เนื้อหาปัจจุบันของ `ForEach` loop ด้วย `NavigationLink`:
tr: Bunu yapmak için `ForEach` döngüsünün şu anki içeriğini bir `NavigationLink` ile değiştir:
vi: Để thực hiện việc này, hãy thay thế nội dung hiện tại của vòng lặp `ForEach` bằng một `NavigationLink`:
zh_cn: 为此，将 `ForEach` 循环的当前内容替换成 `NavigationLink`：
zh_tw: 為此，請用 `NavigationLink` 取代 `ForEach` 迴圈目前的內容：

source: Set the [destination](glossary://destination%20view) to be the [composed view](glossary://composed%20view) `CreatureDetail(creature: creature)`.
de: Lege das [Ziel](glossary://destination%20view) auf die [zusammengesetzte Ansicht](glossary://composed%20view) `CreatureDetail(creature: creature)` (Charakterdetails) fest.
es: Establece el [destino](glossary://destination%20view) para que sea la [vista compuesta](glossary://composed%20view) `CreatureDetail(creature: creature)`.
es_419: Establece el [destino](glossary://destination%20view) que servirá como la [visualización compuesta](glossary://composed%20view) `CreatureDetail(creature: creature)`.
fr: Définis la [destination](glossary://destination%20view) comme étant la [vue composée](glossary://composed%20view) `CreatureDetail(creature: creature)`.
it: Imposta la [destinazione](glossary://destination%20view) in modo che sia la [vista composta](glossary://composed%20view) `CreatureDetail(creature: creature)`.
nl: Stel het [doel](glossary://destination%20view) in op de [samengestelde weergave](glossary://composed%20view) `CreatureDetail(creature: creature)`.
no: Angi [målet](glossary://destination%20view) som den [sammenstilte visningen](glossary://composed%20view) `CreatureDetail(creature: creature)`.
pt: Defina o [destino](glossary://destination%20view) para ser a [visualização composta](glossary://composed%20view) `CreatureDetail(creature: creature)`.
sv: Ställ in [målet](glossary://destination%20view) som den [sammanställda vyn](glossary://composed%20view) `CreatureDetail(creature: creature)`.
th: ตั้งค่า[ปลายทาง](glossary://destination%20view)ให้เป็น[มุมมองที่ถูกประกอบ](glossary://composed%20view) `CreatureDetail(creature: creature)`
tr: [Hedefi](glossary://destination%20view) `CreatureDetail(creature: creature)` adlı [oluşturulmuş görüntü](glossary://composed%20view) olacak şekilde ayarla.
vi: Đặt [đích](glossary://destination%20view) thành [chế độ xem tổ hợp](glossary://composed%20view) `CreatureDetail(creature: creature)`.
zh_cn: 将[目的视图](glossary://destination%20view)设为[组合视图](glossary://composed%20view) `CreatureDetail(creature: creature)`。
zh_tw: 將[目標](glossary://destination%20view)設為[組合式顯示區](glossary://composed%20view) `CreatureDetail(creature: creature)`。

source: Create the [label](glossary://label) as a `CreatureRow`, using the `creature` value from the [closure](glossary://closure) as the [argument](glossary://argument).
de: Erstelle das [Etikett](glossary://label) als `CreatureRow` (Charakterzeile), indem du den Wert `creature` (Charakter) aus dem [Funktionsabschluss](glossary://closure) als [Argument](glossary://argument) verwendest.
es: Crea la [etiqueta](glossary://label) como `CreatureRow`, usando el valor `creature` de la [clausura](glossary://closure) como el [argumento](glossary://argument).
es_419: Crea la [etiqueta](glossary://label) como `CreatureRow`, y usa el valor `creature` de la [clausura](glossary://closure) como el [argumento](glossary://argument).
fr: Crée l’[étiquette](glossary://label) en tant que `CreatureRow`, en utilisant la valeur `creature` de la [clôture](glossary://closure) comme [argument](glossary://argument).
it: Crea l'[etichetta](glossary://label) come `CreatureRow`, utilizzando il valore `creature` dalla [chiusura](glossary://closure) come [argomento](glossary://argument).
nl: Maak het [label](glossary://label) aan als een `CreatureRow`, waarbij je de waarde `creature` uit de [closure](glossary://closure) als het [argument](glossary://argument) gebruikt.
no: Opprett [etiketten](glossary://label) som en `CreatureRow` ved å bruke verdien `creature` fra [closure-blokken](glossary://closure) som [argument](glossary://argument).
pt: Crie a [etiqueta](glossary://label) como uma `CreatureRow` usando o valor `creature` do [encerramento](glossary://closure) como [argumento](glossary://argument).
sv: Skapa [etiketten](glossary://label) som en `CreatureRow` genom att använda värdet `creature` från [stängningen](glossary://closure) som [argument](glossary://argument).
th: สร้าง[ป้าย](glossary://label)เป็น `CreatureRow` โดยใช้ค่า `creature` จาก[การปิด](glossary://closure)เป็น[อาร์กิวเมนต์](glossary://argument)
tr: [Kapamadaki](glossary://closure) `creature` değerini [argüman](glossary://argument) olarak kullanarak `CreatureRow` olarak [etiketini](glossary://label) yarat.
vi: Tạo [nhãn](glossary://label) dưới dạng một `CreatureRow`, sử dụng giá trị `creature` từ [bao đóng](glossary://closure) dưới dạng [đối số](glossary://argument).
zh_cn: 将[标签](glossary://label)创建为 `CreatureRow`，其中使用来自[闭包](glossary://closure)的 `creature` 值作为[实参](glossary://argument)。
zh_tw: 製作 `CreatureRow` 的[標籤](glossary://label)，使用來自[閉包](glossary://closure)的 `creature` 值作為[引數](glossary://argument)。

source: Create your navigation link like this and add it inside your `ForEach`:
de: Erstelle so deinen Navigationslink und füge ihn in `ForEach` ein:
es: Crea tu enlace de navegación así y añádelo dentro de `ForEach`:
es_419: Crea tu enlace de navegación como este y agrégalo dentro de `ForEach`:
fr: Crée ton lien de navigation comme ceci et ajoute-le à l’intérieur de ton `ForEach` :
it: Crea un link di navigazione come questo e aggiungilo all'interno del tuo `ForEach`:
nl: Maak je navigatielink als volgt aan en voeg deze toe binnen je `ForEach`:
no: Opprett navigasjonslenken som dette, og legg den til inni `ForEach`:
pt: Crie um link de navegação como este e adicione‑o dentro do `ForEach`:
sv: Skapa en navigationslänk så här och lägg till den inuti din `ForEach`:
th: สร้างลิงก์การนำทางแบบนี้และเพิ่มลิงก์ภายใน `ForEach` ของคุณ:
tr: Dolaşma bağlantını bu şekilde yarat ve `ForEach`’inin içine ekle:
vi: Tạo ra liên kết điều hướng giống như thế này và thêm vào bên trong `ForEach` của bạn:
zh_cn: 创建像这样的导航链接，并添加到 `ForEach` 内：
zh_tw: 製作像這樣的導覽連結並將它加入 `ForEach` 內：

source: Your `ForEach` should look like this:
de: `ForEach` sollte so aussehen:
es: Tu `ForEach` debería ser así:
es_419: `ForEach` debe ser como lo siguiente:
fr: Ton `ForEach` doit ressembler à ceci :
it: Il tuo `ForEach` dovrebbe essere simile a quello mostrato sotto:
nl: Je `ForEach` moet er zo uitzien:
no: `ForEach` skal se slik ut:
pt: O `ForEach` deve ser mais ou menos assim:
sv: Din `ForEach` bör se ut så här:
th: `ForEach` ของคุณควรมีลักษณะดังนี้:
tr: `ForEach`’in şöyle görünmelidir:
vi: `ForEach` phải trông giống thế này:
zh_cn: 你的 `ForEach` 看起来应该是这样：
zh_tw: 你的 `ForEach` 看起來應該像這樣：

source: Try tapping a row of your `List`. It now takes you to the `CreatureDetail` view for that creature.
de: Tippe auf eine Zeile in der mit `List` erstellten Liste. So gelangst du nun zur Detailansicht `CreatureDetail` für den entsprechenden Charakter.
es: Prueba a tocar una fila de tu `List` (lista). Ahora te lleva a la vista `CreatureDetail` de esa criatura.
es_419: Intenta tocar una fila de tu `List`; ahora te lleva a la visualización `CreatureDetail` de esa criatura.
fr: Essaie de toucher une rangée de ta `List`. Elle te conduit à présent à la vue `CreatureDetail` de cette créature.
it: Prova a toccare una riga della tua vista `List`. Adesso ti porta alla vista `CreatureDetail` per la creatura corrispondente.
nl: Tik op een rij in je `List`. Als het goed is, wordt nu de weergave `CreatureDetail` voor dat wezen geopend.
no: Prøv å trykke på en rad i `List`. Det tar deg til visningen `CreatureDetail` for denne skapningen.
pt: Tente tocar em uma linha de `List`. Isso leva você para a visualização `CreatureDetail` dessa criatura.
sv: Prova att trycka på en rad i `List`. Det tar dig till vyn `CreatureDetail` för den varelsen.
th: ลองแตะแถวของ `List` ของคุณ ตอนนี้คุณจะถูกเคลื่อนย้ายไปยังมุมมอง `CreatureDetail` สำหรับสิ่งมีชีวิตนั้น
tr: Listenin (`List`) bir satırına dokunmayı dene. Artık bu seni o yaratığın `CreatureDetail` görüntüsüne götürür.
vi: Thử chạm vào một hàng trong `List` của bạn. Bây giờ, bạn được đưa đến chế độ xem `CreatureDetail` cho sinh vật đó.
zh_cn: 尝试轻点 `List` 的一行。现在它将带你前往这个动物的 `CreatureDetail` 视图。
zh_tw: 試著點一下 `List` 中的一列。它現在會帶你前往該生物的 `CreatureDetail` 顯示區。

source: Build your `CreatureDetail` view
de: Die Ansicht `CreatureDetail` erstellen
es: Crear tu vista `CreatureDetail`
es_419: Construir la visualización `CreatureDetail`
fr: Créer ta vue `CreatureDetail`
it: Creare la vista `CreatureDetail`
nl: De `CreatureDetail`-weergave bouwen
no: Bygg en `CreatureDetail`-visning
pt: Crie a visualização `CreatureDetail`
sv: Bygg en `CreatureDetail`-vy
th: สร้างมุมมอง `CreatureDetail` ของคุณ
tr: `CreatureDetail` görüntünü oluşturma
vi: Xây dựng chế độ xem `CreatureDetail` của bạn
zh_cn: 构建 `CreatureDetail` 视图
zh_tw: 建構你的 `CreatureDetail` 顯示區

source: The `CreatureDetail` view shows the selected creature as a `Text` view. Your job is to understand the existing code and build on top of it to create some cool creature effects.
de: Die Detailansicht `CreatureDetail` zeigt den ausgewählten Charakter als `Text`-Ansicht an. Deine Aufgabe ist es nun, den vorhandenen Code zu verstehen und ihn als Grundlage zu verwenden, um ein paar coole Effekte für die Charaktere zu erstellen.
es: La vista `CreatureDetail` muestra la criatura seleccionada como una vista `Text` (texto). Tu tarea es entender el código existente y crear sobre él algunos efectos de criaturas geniales.
es_419: La visualización `CreatureDetail` muestra la criatura seleccionada como una visualización `Text`. Tu tarea es entender el código existente y ampliarlo para crear más efectos de criaturas geniales.
fr: La vue `CreatureDetail` montre la créature sélectionnée sous forme de vue `Text`. Ton travail consiste à comprendre le code existant et à le compléter pour créer des effets originaux sur la créature.
it: La vista `CreatureDetail` mostra la creatura selezionata come una vista `Text`. Il tuo obiettivo è di capire il codice esistente e di ampliarlo in modo da creare effetti di animazione straordinari per la creatura.
nl: De weergave `CreatureDetail` toont het geselecteerde wezen als een `Text`-weergave. Het is jouw taak om de bestaande code te begrijpen en hierop voort te bouwen om een paar coole effecten voor de wezens te maken.
no: Visningen `CreatureDetail` viser den valgte skapningen som en `Text`-visning. Jobben din er å forstå den eksisterende koden og bygge videre på den for å lage noen stilige effekter til skapningen.
pt: A visualização `CreatureDetail` mostra a criatura selecionada como uma visualização `Text`. A sua tarefa é entender o código existente e, com base nele, criar alguns efeitos interessantes para a criatura.
sv: Vyn `CreatureDetail` visar den valda varelsen som en `Text`-vy. Ditt jobb är att förstå den befintliga koden och bygga vidare på den för att skapa coola effekter till varelsen.
th: มุมมอง `CreatureDetail` จะแสดงสิ่งมีชีวิตที่เลือกเป็นมุมมอง `Text` หน้าที่ของคุณคือทำความเข้าใจโค้ดที่มีอยู่แล้ว และต่อยอดจากโค้ดนั้นเพื่อสร้างเอฟเฟ็กต์สิ่งมีชีวิตเจ๋งๆ
tr: `CreatureDetail` görüntüsü, seçilen yaratığı bir `Text` görüntüsü olarak gösterir. Senin işin, mevcut kodu anlamak ve bazı harika yaratık efektleri yaratmak için bunun üstüne inşa etmektir.
vi: Chế độ xem `CreatureDetail` hiển thị sinh vật được chọn dưới dạng một chế độ xem `Text`. Công việc của bạn là hiểu được mã hiện có và xây dựng trên nền tảng đó nhằm tạo ra một số hiệu ứng sinh vật thú vị.
zh_cn: `CreatureDetail` 视图将所选动物显示为 `Text` 视图。你的任务是理解现有的代码，并基于这些代码进行构建，创造出一些酷酷的动物效果。
zh_tw: `CreatureDetail` 顯示區將選取的生物顯示為 `Text` 顯示區。你的工作是瞭解現有的程式碼並在其之上建構和創造一些很酷的生物效果。

source: In `ContentView`, you created a `NavigationLink` with a [destination view](glossary://destination%20view) of `CreatureDetail(creature: creature)`.
de: Du hast in `ContentView` (Inhaltsansicht) den Navigations-Link `NavigationLink` mit einer [Zielansicht](glossary://destination%20view) von `CreatureDetail(creature: creature)` erstellt.
es: En la vista de contenido (`ContentView`), creaste un enlace de navegación (`NavigationLink`) con una [vista de destino](glossary://destination%20view) de `CreatureDetail(creature: creature)`.
es_419: En la visualización `ContentView`, creaste un enlace `NavigationLink` con una [visualización de destino](glossary://destination%20view) de `CreatureDetail(creature: creature)`.
fr: Dans `ContentView`, tu as créé un `NavigationLink` avec une [vue de destination](glossary://destination%20view) de `CreatureDetail(creature: creature)`.
it: In `ContentView` hai creato un `NavigationLink` con una [vista di destinazione](glossary://destination%20view) di `CreatureDetail(creature: creature)`.
nl: In `ContentView` heb je een `NavigationLink` aangemaakt met een [doelweergave](glossary://destination%20view) van `CreatureDetail(creature: creature)`.
no: I `ContentView` opprettet du en `NavigationLink` med [målvisningen](glossary://destination%20view) `CreatureDetail(creature: creature)`.
pt: Em `ContentView`, você criou um`NavigationLink` com uma [visualização de destino](glossary://destination%20view) de `CreatureDetail(creature: creature)`.
sv: I `ContentView` skapade du en `NavigationLink` med [målvyn](glossary://destination%20view) `CreatureDetail(creature: creature)`.
th: ใน `ContentView` คุณได้สร้าง `NavigationLink` ที่มี[มุมมองปลายทาง](glossary://destination%20view) เป็น `CreatureDetail(creature: creature)`
tr: `ContentView`’da, `CreatureDetail(creature: creature)` [hedef görüntüsü](glossary://destination%20view) ile bir `NavigationLink` yarattın.
vi: Trong `ContentView`, bạn đã tạo ra một `NavigationLink` với một [chế độ xem đích](glossary://destination%20view) của `CreatureDetail(creature: creature)`.
zh_cn: 在 `ContentView` 中，你创建了一个带有 `CreatureDetail(creature: creature)` [目的视图](glossary://destination%20view)的 `NavigationLink`。
zh_tw: 在 `ContentView` 中，你建立了一個[目標](glossary://destination%20view)為 `CreatureDetail(creature: creature)` 的 `NavigationLink`。

source: The destination view uses the `Creature` value for each row of the list to generate a different view depending on which creature you tap. Here, that value is stored as a nonstate [constant](glossary://constant) because the value won’t change in this view.
de: Die Zielansicht verwendet den Wert `Creature` (Charakter) für jede Zeile der Liste, um eine andere Ansicht zu erzeugen, je nachdem, auf welchen Charakter getippt wird. Hier wird der Wert als Nicht-Status-[Konstante](glossary://constant) gespeichert, da sich der Wert in dieser Ansicht nicht ändert.
es: La vista de destino usa el valor `Creature` para cada fila de la lista para generar una vista diferente dependiendo de la criatura que toques. Aquí, ese valor se almacena como una [constante](glossary://constant) sin estado porque el valor no cambiará en esta vista.
es_419: La visualización de destino usa el valor `Creature` de cada fila de la lista para generar una visualización diferente según la criatura que se haya tocado. Aquí, ese valor se almacena como una [constante](glossary://constant) sin estado, porque su valor no cambiará.
fr: La vue de destination utilise la valeur `Creature` pour chaque rangée de la liste afin de générer une vue différente en fonction de la créature que tu touches. Ici, cette valeur est stockée en tant que [constante](glossary://constant) sans état, car la valeur ne changera pas dans cette vue.
it: La vista di destinazione utilizza il valore `Creature` per ciascuna riga dell'elenco per generare una vista diversa a seconda della creatura che tocchi. Qui tale valore viene salvato come una [costante](glossary://constant) senza stato, perché in questa vista il valore non cambierà.
nl: De doelweergave gebruikt de waarde `Creature` voor elke rij in de lijst om een andere weergave aan te maken voor elk wezen waarop je tikt. Die waarde wordt hier opgeslagen als een [constante](glossary://constant) zonder status omdat de waarde in deze weergave niet verandert.
no: Målvisningen bruker verdien `Creature` for hver rad i listen til å generere ulike visninger avhengig av hvilken skapning du trykker på. Her lagres denne verdien som en statusløs [konstant](glossary://constant) fordi verdien ikke endres i denne visningen.
pt: A visualização de destino usa o valor de `Creature` para cada linha da lista para gerar uma visualização diferente, dependendo de qual criatura for tocada. Aqui, esse valor está armazenado como uma [constante](glossary://constant) sem estado porque o valor não muda nesta visualização.
sv: Målvyn använder värdet `Creature` för varje rad i listan till att generera olika vyer beroende på vilken varelse du trycker på. Här lagras det värdet som en statuslös [konstant](glossary://constant) eftersom värdet inte ändras i den här vyn.
th: มุมมองปลายทางใช้ค่า `Creature` สำหรับแต่ละแถวของรายการเพื่อสร้างมุมมองที่แตกต่างกันตามสิ่งมีชีวิตที่คุณแตะ ในส่วนนี้ ค่านั้นถูกจัดเก็บเป็น[ค่าคงที่](glossary://constant)ที่ไม่มีสถานะเนื่องจากค่าจะไม่เปลี่ยนแปลงในมุมมองนี้
tr: Hedef görüntü, hangi yaratığa dokunduğuna göre farklı bir görüntü oluşturmak için listenin her satırı için `Creature` değerini kullanır. Burada bu değer, bu görüntüde değişmeyeceğinden durumu olmayan [sabit](glossary://constant) olarak saklanır.
vi: Chế độ xem đích sử dụng giá trị `Creature` cho từng hàng của danh sách để tạo ra một chế độ xem khác nhau tùy theo sinh vật mà bạn chạm vào. Tại đây, giá trị đó được lưu trữ dưới dạng [hằng số](glossary://constant) không có trạng thái vì giá trị sẽ không thay đổi trong chế độ xem này.
zh_cn: 目的视图使用列表中每一行的 `Creature` 值，以根据你轻点的动物生成不同的视图。在这里，这个值储存为非状态[常量](glossary://constant)，因为它在这个视图中不会发生更改。
zh_tw: 目標顯示區使用列表中每一列的 `Creature` 值來產生不同的顯示區，主要取決於你點按的生物。在這裡，該值儲存為非狀態[常數](glossary://constant)，因為該值在此顯示區中不會改變。
