Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: But before you see how to do that, you need to know how to create an app with multiple views. For this, you’ll add navigation using a `NavigationSplitView` or a `NavigationStack`.
de: Doch bevor du erfährst, wie du das machst, musst du lernen, wie man eine App mit mehreren Ansichten erstellt. Dafür fügst du mit `NavigationSplitView` oder `NavigationStack` eine Navigationsmöglichkeit hinzu.
es: Pero antes de ver cómo hacerlo, tienes que saber crear una app con varias vistas. Para ello, utilizarás una vista de navegación usando una vista dividida de navegación (`NavigationSplitView`) o una pila de navegación (`NavigationStack`).
es_419: Pero antes de ver esto, debes aprender a crear una app con varias visualizaciones. Para este fin, agregarás la funcionalidad de navegación con una visualización `NavigationSplitView` o una pila `NavigationStack`.
fr: Mais avant que tu vois comment faire cela, tu dois savoir comment créer une app avec plusieurs vues. Pour cela, tu ajouteras une navigation à l’aide d’une `NavigationSplitView` ou d’une `NavigationStack`.
it: Prima di passare a questo argomento, dovrai imparare a creare un'app con viste multiple e lo farai aggiungendo funzionalità di navigazione utilizzando una `NavigationSplitView` o una `NavigationStack`.
nl: Maar voordat je gaat zien hoe je dit doet, moet je weten hoe je een app maakt met meerdere weergaven. Hiervoor ga je navigatie toevoegen met een `NavigationSplitView` of een `NavigationStack`.
no: Før du ser hvordan dette gjøres, må du vite hvordan du lager en app med flere visninger. Du gjør det ved å legge til navigering med en `NavigationSplitView` eller `NavigationStack`.
pt: Mas, antes de aprender a fazer isso, você precisa saber como criar um app com várias visualizações. Para isso, você adicionará uma navegação com uma `NavigationSplitView` ou um `NavigationStack`.
sv: Innan du ser hur det går till måste du veta hur du skapar en app med flera vyer. Du gör det genom att lägga till navigering med en `NavigationSplitView` eller `NavigationStack`.
th: แต่ก่อนที่คุณจะได้เห็นวิธีทำเช่นนั้น คุณจะต้องรู้วิธีสร้างแอปที่มีหลายมุมมอง ในส่วนนี้ คุณจะต้องเพิ่มการนำทางโดยใช้ `NavigationSplitView` หรือ `NavigationStack`
tr: Ancak bunu nasıl yapacağını görmeden önce birden fazla görüntüye sahip bir uygulama yaratmayı bilmen gerekir. Bunun için bir `NavigationSplitView` veya bir `NavigationStack` kullanarak dolaşma ekleyeceksin.
vi: Nhưng trước khi xem cách thực hiện việc đó, bạn cần biết cách tạo ra một ứng dụng có nhiều chế độ xem. Đối với phần này, bạn sẽ thêm điều hướng sử dụng một `NavigationSplitView` hoặc một `NavigationStack`.
zh_cn: 但在查看使用方法前，你需要了解如何创建带有多个视图的 App。为此，你将使用 `NavigationSplitView`（导航拆分视图）或 `NavigationStack`（导航堆栈）来添加导航。
zh_tw: 但在瞭解如何做到這一點之前，你需要知道如何製作有多個顯示區的 App。為此，你將使用 `NavigationSplitView` 或 `NavigationStack`。

# GuideBook..Guide0..StepNavigating in SwiftUI..TasknavigationExperiment..title
source: Create a `NavigationStack`
de: `NavigationStack` erstellen
es: Crear una pila de navegación (`NavigationStack`)
es_419: Crear una pila `NavigationStack`
fr: Créer une `NavigationStack`
it: Creare una `NavigationStack`
nl: Een `NavigationStack` aanmaken
no: Opprett en `NavigationStack`
pt: Crie um `NavigationStack`
sv: Skapa en `NavigationStack`
th: สร้าง `NavigationStack`
tr: `NavigationStack` yaratma
vi: Tạo ra một `NavigationStack`
zh_cn: 创建 `NavigationStack`
zh_tw: 建立一個 `NavigationStack`

source: To navigate to different views, you’ll need one of two different types of navigation views:
de: Um zu verschiedenen Ansichten navigieren zu können, benötigst du einen von zwei verschiedenen Typen von Navigationsansichten:
es: Para navegar por las diferentes vistas, necesitarás dos tipos diferentes de vistas de navegación:
es_419: Para navegar a otras visualizaciones, necesitas una de dos tipos distintos de visualizaciones de navegación:
fr: Pour naviguer vers différentes vues, tu as besoin de l’un des deux types de vues de navigation suivants :
it: Per navigare verso altre viste, avrai bisogno di una delle due diverse tipologie di viste di navigazione:
nl: Om naar andere weergaven te navigeren, heb je een van de volgende twee soorten navigatieweergaven nodig:
no: Når du vil navigere til forskjellige visninger, må du bruke én av to ulike typer navigeringsvisninger:
pt: Para navegar para as outras visualizações, você precisará de dois tipos diferentes de visualizações de navegação:
sv: När du vill navigera till olika vyer måste du använda en av två olika typer av navigeringsvyer:
th: ในการนำทางไปยังมุมมองที่แตกต่างกัน คุณจะต้องใช้หนึ่งในมุมมองการนำทางสองประเภทที่แตกต่างกัน:
tr: Farklı görüntülere gitmek için iki farklı türde dolaşma görüntüsünden birine ihtiyacın olacak:
vi: Để điều hướng đến các chế độ xem khác nhau, bạn sẽ cần một trong hai kiểu chế độ xem điều hướng khác nhau:
zh_cn: 若要导航到其他视图，你需要两种不同导航视图中的一个：
zh_tw: 要導覽到不同的顯示區，你需要兩種不同類型導覽顯示區的其中之一：

source: A [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) organizes your views on top of each other, like a deck of cards.
de: [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) organisiert deine Ansichten übereinander wie ein Kartendeck.
es: Una [pila de navegación](doc://com.apple.documentation/documentation/swiftui/navigationstack) organiza tus vistas una encima de otra, como una baraja de cartas.
es_419: Una pila [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) organiza tus visualizaciones una sobre la otra, como si fuera una baraja.
fr: Une [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) organise tes vues les unes sur les autres, comme un jeu de cartes.
it: Una vista [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) organizza le tue viste una sopra l'altra, come un mazzo di carte.
nl: In een [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) worden weergaven boven op elkaar geordend, net als in een kaartspel.
no: En [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) organiserer visningene dine oppå hverandre som en kortstokk.
pt: Um [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) organiza as visualizações umas sobre as outras, como em um baralho de cartas.
sv: En [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) ordnar dina vyer ovanpå varandra som en kortlek.
th: [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) จะจัดระเบียบมุมมองของคุณแบบซ้อนทับกัน เหมือนกับสำรับไพ่
tr: Bir [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), görüntülerini bir kart destesi gibi üst üste düzenler.
vi: Một [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) sắp xếp các chế độ xem của bạn ở bên trên của nhau, giống như một cỗ bài.
zh_cn: [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) 会将视图叠放整理，就像一副纸牌一样。
zh_tw: [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) 會整理你的顯示區讓它們相互層疊，就像一副紙牌一樣。

source: A [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organizes your views in two or three columns, allowing you to select items from the leading column to present a view in the trailing column.
de: [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organisiert deine Ansichten in zwei oder drei Spalten und ermöglicht es dadurch, Objekte in der Hauptspalte auszuwählen und Ansichten in der Nebenspalte anzuzeigen.
es: Una [vista dividida de navegación](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organiza tus vistas en dos o tres columnas, permitiéndote seleccionar ítems de la columna inicial para presentar una vista en la columna final.
es_419: Una visualización [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organiza tus visualizaciones en dos o tres columnas, permitiéndote seleccionar elementos de la columna inicial para presentar una visualización en la columna final.
fr: Une [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organise tes vues en deux ou trois colonnes, ce qui te permet de sélectionner des éléments de la première colonne pour présenter une vue dans la dernière colonne.
it: Una vista [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organizza le viste in due o tre colonne, consentendoti di selezionare elementi dalla colonna iniziale per mostrare una vista nella colonna successiva.
nl: In een [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) worden weergaven in twee of drie kolommen geordend, waarbij je onderdelen uit de primaire kolom kunt selecteren om een weergave in de secundaire kolom te presenteren.
no: En [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organiserer visningene dine i to eller tre kolonner, slik at du kan velge objekter fra den første kolonnen for å vise en visning i den etterfølgende kolonnen.
pt: Uma [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) organiza as visualizações em duas ou três colunas, permitindo que você selecione itens da coluna condutora para apresentar uma visualização na coluna de trilha.
sv: En [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) ordnar dina vyer i två eller tre kolumner så att du kan välja objekt från den första kolumnen för att visa en vy i den följande kolumnen.
th: [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) จะจัดระเบียบมุมมองของคุณออกเป็นสองหรือสามคอลัมน์ ซึ่งทำให้คุณสามารถเลือกรายการจากคอลัมน์เริ่มต้นเพื่อแสดงมุมมองในคอลัมน์ต่อท้ายได้
tr: Bir [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview), görüntülerini iki veya üç sütun olarak düzenler ve öndeki sütunda öğeleri seçerek sondaki sütunda bir görüntü sunmanı sağlar.
vi: Một [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) sắp xếp các chế độ xem của bạn thành hai hoặc ba cột, cho phép bạn chọn các mục từ cột đầu để hiển thị một chế độ xem trong cột cuối.
zh_cn: [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) 会将视图整理成两列或三列，你可以从前导列选择项目来在后续列中显示视图。
zh_tw: [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) 會將你的顯示區整理在兩個或三個直欄中，讓你從前面的直欄中選擇項目來在後面的直欄中呈現顯示區。

source: Each of these navigation views act as a [container](glossary://container) for presenting different views based on how someone navigates within your app, they just present the views in slightly different ways.
de: Jede Navigationsansicht dient als [Container](glossary://container), um verschiedene Ansichten basierend auf der Art und Weise anzuzeigen, wie jemand in der App navigiert. Sie zeigen die Ansichten auf jeweils minimal unterschiedliche Weise an.
es: Cada una de estas vistas de navegación actúa como un [contenedor](glossary://container) para presentar diferentes vistas en función de cómo se navega dentro de tu app, solo que presentan las vistas de formas ligeramente diferentes.
es_419: Cada una de estas visualizaciones de navegación actúa como un [contenedor](glossary://container) para presentar distintas visualizaciones en función de cómo se navega dentro de la app, es sólo que lo hacen en maneras ligeramente distintas.
fr: Chacune de ces vues de navigation agit comme un [conteneur](glossary://container) pour présenter différentes vues en fonction de la manière dont quelqu’un navigue dans ton app. Simplement, elles présentent les vues de manières légèrement différentes.
it: Ciascuna di queste viste di navigazione funziona come un [contenitore](glossary://container) per presentare diverse viste in base a come l'utente naviga all'interno della tua app, ma semplicemente le presentano in modo leggermente diverso.
nl: Beide typen navigatieweergaven fungeren als een [container](glossary://container) voor het presenteren van verschillende weergaven op basis van de manier waarop gebruikers in je app navigeren. Alleen de manier waarop ze de weergaven presenteren verschilt een beetje.
no: Hver av disse navigeringsvisningene fungerer som en [beholder](glossary://container) for å vise forskjellige visninger, basert på hvordan noen navigerer inni appen. Forskjellen er at de viser visningene på litt forskjellige måter.
pt: Cada uma dessas visualizações de navegação funciona como um [contêiner](glossary://container) para apresentar visualizações diferentes de acordo como uma pessoa navega no app, elas apenas apresentam as visualizações de maneiras levemente diferentes.
sv: Var och en av dessa navigeringsvyer fungerar som en [behållare](glossary://container) för att visa olika vyer beroende på hur någon navigerar inuti appen. Skillnaden är att de visar vyerna på aningens olika sätt.
th: มุมมองการนำทางแต่ละมุมมองเหล่านี้ทำหน้าที่เป็น[คอนเทนเนอร์](glossary://container)ที่แสดงมุมมองต่างๆ โดยอิงจากวิธีที่ผู้อื่นนำทางภายในแอปของคุณ เพียงแต่ว่าจะแสดงมุมมองในรูปแบบที่แตกต่างกันเล็กน้อย
tr: Bu dolaşma görüntülerinin her biri, birisinin uygulamanda nasıl dolaştığına göre farklı görüntüler sunan bir [kapsayıcı](glossary://container) görevi görür; bunlar yalnızca görüntüleri biraz farklı şekillerde sunar.
vi: Mỗi chế độ xem điều hướng này đóng vai trò như một [bộ chứa](glossary://container) để hiển thị các chế độ xem khác nhau dựa trên cách một người nào đó điều hướng bên trong ứng dụng của bạn, chúng chỉ hiển thị các chế độ xem theo những cách hơi khác nhau.
zh_cn: 这些导航视图会各自作为[容器](glossary://container)，基于用户在 App 内的导航方式来显示不同的视图，视图的显示方式稍有区别。
zh_tw: 這些導覽顯示區中的每一個都是作為[容器](glossary://container)，用於根據使用者在你的 App 中導覽的方式而呈現不同的顯示區，它們只是以稍微不同的方式呈現顯示區。

source: First, you’ll create a `NavigationStack` to see how it works.
de: Als Erstes erstellst du eine Instanz von `NavigationStack`, um zu sehen, wie sie funktioniert.
es: Primero, vas a crear una pila de navegación (`NavigationStack`) para ver cómo funciona.
es_419: Primero, debes crear una pila `NavigationStack` para poder explorar su funcionamiento.
fr: Tu vas d’abord créer une `NavigationStack` pour voir comment elle fonctionne.
it: Per iniziare, creerai una vista `NavigationStack` per vedere come funziona.
nl: Eerst ga je een `NavigationStack` aanmaken om te zien hoe deze werkt.
no: Først lager du en `NavigationStack` for å se hvordan den fungerer.
pt: Primeiro, você criará um `NavigationStack` para ver como ele funciona.
sv: Först skapar du en `NavigationStack` för att se hur den fungerar.
th: ก่อนอื่น คุณจะต้องสร้าง `NavigationStack` เพื่อดูว่าสิ่งนี้ทำงานอย่างไร
tr: Önce, nasıl çalıştığını görmek için bir `NavigationStack` yaratacaksın.
vi: Trước tiên, bạn sẽ tạo ra một `NavigationStack` để xem cách hoạt động.
zh_cn: 首先，你将创建 `NavigationStack` 来看看它如何工作。
zh_tw: 首先，你會建立一個 `NavigationStack` 來查看它是如何運作的。

source: First, add a `NavigationStack` with a `List` view inside. A [List](doc://com.apple.documentation/documentation/swiftui/list) displays any number of views in a scrolling vertical column.
de: Füge als Erstes eine Instanz von `NavigationStack` mit einer `List`-Ansicht hinzu, die sich darin befindet. Eine [Liste](doc://com.apple.documentation/documentation/swiftui/list) zeigt eine beliebige Anzahl von Ansichten in einer vertikal scrollbaren Spalte an.
es: Primero, añade una pila de navegación (`NavigationStack`) con una vista `List` (lista) dentro. Una [lista](doc://com.apple.documentation/documentation/swiftui/list) muestra un número cualquiera de vistas en una columna vertical por la que puedes desplazarte.
es_419: Primero, agrega una pila `NavigationStack` que contenga una visualización [`List`](doc://com.apple.documentation/documentation/swiftui/list), la cual muestra cualquier cantidad de visualizaciones en una columna vertical desplazable.
fr: Commence par ajouter une `NavigationStack` avec une vue `List` à l’intérieur. Une [Liste](doc://com.apple.documentation/documentation/swiftui/list) affiche un nombre quelconque de vues dans une colonne verticale défilante.
it: Per prima cosa, aggiungi una vista `NavigationStack` che contiene una vista `List`. Un elemento [List](doc://com.apple.documentation/documentation/swiftui/list) mostra un certo numero di viste in una colonna verticale che scorre.
nl: Voeg om te beginnen een `NavigationStack` met daarin een `List`-weergave toe. In een [List](doc://com.apple.documentation/documentation/swiftui/list) kun je een willekeurig aantal weergaven tonen in een verticale kolom waar je doorheen kunt scrollen.
no: Legg først til en `NavigationStack` med en `List`-visning inni. En [List](doc://com.apple.documentation/documentation/swiftui/list) viser et hvilket som helst antall visninger i en vertikal rullekolonne.
pt: Primeiro, adicione um `NavigationStack` com uma visualização `List` dentro. Uma [List](doc://com.apple.documentation/documentation/swiftui/list) mostra qualquer quantidade de visualizações em uma coluna vertical rolável.
sv: Lägg först till en `NavigationStack` med en `List`-vy inuti. En [List](doc://com.apple.documentation/documentation/swiftui/list) visar hur många vyer som helst i en rullningsbar vertikal kolumn.
th: ก่อนอื่นให้เพิ่ม `NavigationStack` ที่มีมุมมอง `List` อยู่ภายใน โดย [List](doc://com.apple.documentation/documentation/swiftui/list) จะแสดงมุมมองจำนวนใดๆ ในคอลัมน์แนวตั้งแบบเลื่อนได้
tr: Öncelikle, içinde bir `List` görüntüsü bulunan bir `NavigationStack` ekle. Bir [Liste](doc://com.apple.documentation/documentation/swiftui/list), kaydırılan düşey sütunda herhangi bir sayıda görüntüyü görüntüler.
vi: Trước tiên, hãy thêm một `NavigationStack` với một chế độ xem `List` ở bên trong. [Danh sách](doc://com.apple.documentation/documentation/swiftui/list) hiển thị bất kỳ số lượng chế độ xem nào trong một cột cuộn theo chiều dọc.
zh_cn: 首先，添加一个内含 `List`（列表）视图的 `NavigationStack`。[列表](doc://com.apple.documentation/documentation/swiftui/list)会以可滚动的垂直列显示任意数量的视图。
zh_tw: 首先，加入一個裡面包含 `List` 顯示區的 `NavigationStack`。[List](doc://com.apple.documentation/documentation/swiftui/list) 會以一個可捲動的直欄來顯示任何數量的顯示區。

source: NavigationStack { List { Text("NavigationStack Content") //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }
de: NavigationStack { List { Text("Inhalt von NavigationStack") //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }
pt: NavigationStack { List { Text("Conteúdo do NavigationStack") //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }
sv: NavigationStack { List { Text("NavigationStack-innehåll") //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }
th: NavigationStack { List { Text("เนื้อหาของ NavigationStack") //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }
tr: NavigationStack { List { Text("NavigationStack İçeriği”) //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }
vi: NavigationStack { List { Text("Nội dung NavigationStack") //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }
zh_cn: NavigationStack { List { Text("NavigationStack 内容") //#-learning-code-snippet(addNavLink) //#-learning-code-snippet(addSecondNavLink) } }

source: Look at your preview. You’ll see a single `Text` view in your `List` and not much else. To navigate to another view, you’ll add a [NavigationLink](glossary://navigation%20link) inside of your `NavigationStack`.
de: Wirf einen Blick auf die Vorschau. Dort siehst du jetzt eine einzelne `Text`-Ansicht in deiner mit `List` erstellten Liste und sonst fast nichts. Um zu einer anderen Ansicht zu navigieren, füge [NavigationLink](glossary://navigation%20link) in `NavigationStack` ein.
es: Mira la vista previa. Verás una única vista `Text` (texto) en tu `List` (lista) y no mucho más. Para navegar a otra vista, deberás añadir un enlace de navegación [NavigationLink](glossary://navigation%20link) dentro de tu pila de navegación (`NavigationStack`).
es_419: Revisa tu vista previa. Ahora deberías ver una sola visualización `Text` en tu visualización `List`, y nada más. Para navegar a otra visualización, debes agregar un [enlace de navegación](glossary://navigation%20link) (`NavigationLink`) dentro de tu `NavigationStack`.
fr: Regarde ton aperçu. Tu verras une vue `Text` unique dans ta `List` et pas grand-chose d’autre. Pour naviguer vers une autre vue, tu ajouteras un [lien de navigation](glossary://navigation%20link) à l’intérieur de ta `NavigationStack`.
it: Guarda l'anteprima. `List` contiene soltanto una vista `Text` e poco altro. Per andare a una vista diversa, dovrai aggiungere un [NavigationLink](glossary://navigation%20link) all'interno della tua `NavigationStack`.
nl: Bekijk je voorvertoning. Je ziet nu één `Text`-weergave in je `List` en verder niets. Om naar een andere weergave te navigeren, voeg je een [NavigationLink](glossary://navigation%20link) in je `NavigationStack` toe.
no: Se på forhåndsvisningen. Du ser én `Text`-visning i `List` og ikke mye annet. Hvis du vil navigere til en annen visning, legger du til en [NavigationLink](glossary://navigation%20link) inni `NavigationStack`.
pt: Observe a pré‑visualização. Você verá uma única visualização `Text` em `List` e nada mais. Para navegar para outra visualização, você adicionará um [Link de Navegação](glossary://navigation%20link) dentro do `NavigationStack`.
sv: Ta en titt på förhandsvisningen. Du ser en enda `Text`-vy i `List` och inte mycket annat. Om du vill navigera till en annan vy ska du lägga till en [NavigationLink](glossary://navigation%20link) inuti `NavigationStack`.
th: ดูที่การแสดงตัวอย่างของคุณ คุณจะเห็นมุมมอง `Text` เป็นมุมมองเดียวใน `List` ของคุณและไม่เห็นอย่างอื่นมากนัก ในการนำทางไปยังมุมมองอื่น คุณจะต้องเพิ่ม [NavigationLink](glossary://navigation%20link) ภายใน `NavigationStack` ของคุณ
tr: Önizlemene bak. Listende (`List`) tek bir `Text` görüntüsü dışında pek bir şey görmeyeceksin. Başka bir görüntüye gitmek için `NavigationStack`’inin içinde bir [NavigationLink](glossary://navigation%20link) ekleyeceksin.
vi: Hãy nhìn vào bản xem trước của bạn. Bạn sẽ thấy một chế độ xem `Text` đơn nhất trong `List` và không có nhiều nội dung khác. Để điều hướng đến một chế độ xem khác, bạn sẽ thêm một [NavigationLink](glossary://navigation%20link) bên trong `NavigationStack`.
zh_cn: 看看预览。你将在 `List` 中看到单个 `Text` 视图，没有其他内容。若要导航到另一个视图，你需要在 `NavigationStack` 内添加一个 [NavigationLink](glossary://navigation%20link)（导航链接）。
zh_tw: 檢視你的預覽。你會在 `List` 中看到一個 `Text` 顯示區，而不是其他內容。若要導覽至另一個顯示區，你需要在 `NavigationStack` 中加入一個 [NavigationLink](glossary://navigation%20link)。
