Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepModifying State..SuccessMessage..Paragraph38
source: This is a fundamental principle of coding apps in SwiftUI – always keep your app data separate from the UI that displays it. Doing this allows you to preserve a single [source of truth](glossary://source%20of%20truth), and keeps your UI code easy to understand and maintain.
de: Dies ist ein Grundprinzip beim Programmieren von Apps in SwiftUI – trenne deine App-Daten von der Benutzeroberfläche, die sie anzeigt. Auf diese Weise bleibt es bei nur einer einzelnen [Wahrheitsquelle](glossary://source%20of%20truth) und das sorgt dafür, dass der Code der Benutzeroberfläche verständlich und leicht zu verwalten bleibt.
es: Este es un principio fundamental de la programación de apps en SwiftUI: mantén siempre los datos de la app separados de la IU que los muestra. Esto te permite conservar una única [fuente de datos](glossary://source%20of%20truth), y hace que el código de la IU sea fácil de entender y de mantener.
es_419: Un principio fundamental de la creación de apps en SwiftUI es mantener siempre los datos de tu app separados de la interfaz que los muestra. Esto permite mantener una sola [fuente única de información](glossary://source%20of%20truth), y también hace que el código de tu interfaz sea fácil de entender y controlar.
fr: Il s’agit d’un principe fondamental du codage d’apps dans SwiftUI : il faut toujours séparer les données de ton app de l’interface utilisateur qui les affiche. Cela te permet de conserver une seule [source de vérité](glossary://source%20of%20truth) et de garder le code de ton interface utilisateur simple à comprendre et à maintenir.
it: Un principio fondamentale della programmazione delle app in SwiftUI è tenere sempre i dati dell'app separati dall'interfaccia utente su cui vengono visualizzati. In questo modo potrai mantenere un'unica [sorgente univoca](glossary://source%20of%20truth) e avere un codice dell'interfaccia utente facilmente comprensibile e gestibile.
nl: Dit is een fundamenteel principe van het programmeren van apps in SwiftUI; houd je appgegevens altijd gescheiden van de gebruikersinterface waarin de gegevens worden weergegeven. Zo kun je één [bron van waarheid](glossary://source%20of%20truth) bijhouden en blijft de code van je gebruikersinterface gemakkelijk te begrijpen.
no: Dette er et grunnleggende prinsipp for å kode apper i SwiftUI – hold alltid appdataene adskilt fra brukergrensesnittet som viser dem. Når du gjør dette, kan du bevare én [sannhetskilde](glossary://source%20of%20truth) og holde brukergrensesnittkoden lett å forstå og vedlikeholde.
pt: Este é um princípio fundamental da programação de apps em SwiftUI: sempre manter os dados do app separados da IU que os mostra. Isso permite que você preserve uma única [fonte da verdade](glossary://source%20of%20truth) e conserva a facilidade para entender e manter o código da IU.
sv: Det här är en grundläggande princip för att programmera appar i SwiftUI – håll alltid appdata separata från det UI som visar dem. När du gör det kan du bevara en enda [sanningskälla](glossary://source%20of%20truth) och hålla UI-koden lätt att förstå och underhålla.
th: หลักการพื้นฐานของการเขียนโค้ดแอปใน SwiftUI คือการเก็บข้อมูลแอปของคุณแยกจาก UI ที่แสดงข้อมูลแอปนั้นเสมอ การทำเช่นนี้จะช่วยให้คุณรักษา[แหล่งข้อมูลจริง](glossary://source%20of%20truth)แหล่งเดียวได้ และทำให้โค้ด UI ของคุณสามารถเข้าใจและรักษาได้ง่าย
tr: Bu, SwiftUI’da uygulama kodlamanın temel prensibidir; uygulama verilerini her zaman onları görüntüleyen kullanıcı arayüzünden ayrı tut. Bunu yapmak, tek bir [gerçeklik kaynağını](glossary://source%20of%20truth) korumana izin verir ve kullanıcı arayüzü kodunu anlaması ve yönetmesi kolay hâlde tutar.
vi: Đây là một nguyên tắc cơ bản của việc mã hóa các ứng dụng trong SwiftUI – luôn tách riêng dữ liệu ứng dụng của bạn khỏi UI hiển thị dữ liệu đó. Làm như vậy cho phép bạn bảo lưu một [nguồn chân lý](glossary://source%20of%20truth) đơn nhất và đảm bảo rằng mã UI của bạn dễ hiểu và dễ duy trì.
zh_cn: 这是在 SwiftUI 中 App 编程的基本准则，即始终将 App 数据与显示它的 UI 分开保存。这样做可让你保存单个[可信源](glossary://source%20of%20truth)，并让 UI 代码容易理解和维护。
zh_tw: 這是在 SwiftUI 中設計 App 程式的基本原則，始終將 App 資料與顯示它的 UI 分開。這樣做可以讓你保留一個[真實來源](glossary://source%20of%20truth)，並且讓你的 UI 程式易於理解和維護。

# GuideBook..Guide0..StepUsing a Conditional Modifier..title
source: Using a Conditional Modifier
de: Bedingte Modifikatoren verwenden
es: Usar un modificador condicional
es_419: Usar un modificador con condiciones
fr: Utiliser un modificateur conditionnel
it: Utilizzare un modificatore condizionale
nl: Een voorwaardelijke modifier gebruiken
no: Bruke en betinget modifikator
pt: Usando um Modificador Condicional
sv: Använd en villkorlig modifierare
th: การใช้ปุ่มปรับค่าตามเงื่อนไข
tr: Koşullu Niteleyici Kullanma
vi: Sử dụng một trình sửa đổi điều kiện
zh_cn: 使用条件修饰符
zh_tw: 使用條件修飾符

source: In the previous example, you created a [state property](glossary://state%20property) `isOn` whose storage is managed by SwiftUI. By changing the [state](glossary://state) of `isOn`, you were able to show one of two different views conditionally.
de: Im vorherigen Beispiel hast du die [Statuseigenschaft](glossary://state%20property) `isOn` erstellt, deren Speicher von SwiftUI verwaltet wird. Indem du den [Status](glossary://state) von `isOn` geändert hast, konntest du eine von zwei verschiedenen Ansichten anzeigen.
es: En el ejemplo anterior, has creado una [propiedad de estado](glossary://state%20property) `isOn` cuyo almacenamiento está gestionado por SwiftUI. Al cambiar el [estado](glossary://state) de `isOn`, has podido mostrar una de las dos vistas diferentes de forma condicional.
es_419: En el ejemplo anterior, creaste una [propiedad de estado](glossary://state%20property) `isOn` cuyo almacenamiento es administrado por SwiftUI. Al cambiar el [estado](glossary://state) de `isOn`, puedes mostrar una de las dos visualizaciones diferentes cuando se cumple una condición determinada.
fr: Dans l’exemple précédent, tu as créé une [propriété d’état](glossary://state%20property) `isOn` dont le stockage est géré par SwiftUI. En modifiant l’[état](glossary://state) de `isOn`, tu as pu afficher une des deux vues différentes de manière conditionnelle.
it: Nell'esempio precedente, hai creato la [proprietà di stato](glossary://state%20property) `isOn` la cui archiviazione è gestita da SwiftUI. Modificando lo [stato](glossary://state) di `isOn`, hai potuto mostrare una delle due viste, in base a una condizione.
nl: In het vorige voorbeeld heb je de [statuseigenschap](glossary://state%20property) `isOn` aangemaakt waarvan de opslag door SwiftUI wordt beheerd. Door de [status](glossary://state) van `isOn` te wijzigen, kon je een of twee verschillende weergaven tonen op basis van een voorwaarde.
no: I det forrige eksempelet opprettet du [statusegenskapen](glossary://state%20property) `isOn`, der lagring håndteres av SwiftUI. Ved å endre [statusen](glossary://state) til `isOn` kunne du vise én av to visninger betinget.
pt: No exemplo anterior, você criou uma [propriedade de estado](glossary://state%20property) `isOn` cujo armazenamento é gerenciado pela SwiftUI. Ao mudar o [estado](glossary://state) de `isOn`, você conseguiu mostrar uma das duas visualizações diferentes condicionalmente.
sv: I det föregående exemplet skapade du [statusegenskapen](glossary://state%20property) `isOn` vars lagring hanteras av SwiftUI. Genom att ändra [statusen](glossary://state) för `isOn` kunde du visa en av två vyer villkorat.
th: ในตัวอย่างก่อนหน้านี้ คุณได้สร้าง `isOn` ของ[คุณสมบัติสถานะ](glossary://state%20property)ซึ่งมีการจัดเก็บข้อมูลที่จัดการโดย SwiftUI โดยเมื่อเปลี่ยน[สถานะ](glossary://state)ของ `isOn` คุณสามารถแสดงหนึ่งในสองมุมมองที่แตกต่างกันได้ตามเงื่อนไข
tr: Önceki örnekte, saklaması SwiftUI tarafından yönetilen bir [durum özelliği](glossary://state%20property) olan `isOn`’u yarattın. `isOn`'un [durumunu](glossary://state) değiştirerek iki farklı görüntüden birini koşullu olarak gösterebildin.
vi: Trong ví dụ trước đó, bạn đã tạo ra một [thuộc tính trạng thái](glossary://state%20property) `isOn` mà việc lưu trữ được quản lý bởi SwiftUI. Bằng việc thay đổi [trạng thái](glossary://state) của `isOn`, bạn có thể hiển thị một hoặc hai chế độ xem khác nhau tùy theo điều kiện.
zh_cn: 在上一个示例中，你创建了 `isOn` [状态属性](glossary://state%20property)，它储存的值由 SwiftUI 管理。通过更改 `isOn` 的[状态](glossary://state)，你可以按条件显示两个不同视图中的其中一个。
zh_tw: 在前面的範例中，你建立了一個[狀態屬性](glossary://state%20property) `isOn`，它的儲存是由 SwiftUI 管理。透過更改 `isOn` 的[狀態](glossary://state)，你可以有條件地顯示兩個不同顯示區的其中之一。

source: But what if you simply want to change the appearance of an existing view, such as the color or size of a `Circle` view? For that, you’ll need to write some conditional code that specifies how the view appears when [state changes](glossary://state%20change) occur.
de: Aber was würdest du tun, wenn du nur das Erscheinungsbild einer vorhandenen Ansicht ändern möchtest, z. B. die Farbe oder Größe einer `Circle`-Ansicht? Dazu musst du etwas bedingten Code schreiben, der festlegt, wie die Ansicht eingeblendet wird, sobald [Statusänderungen](glossary://state%20change) auftreten.
es: ¿Pero qué pasa si simplemente quieres cambiar la apariencia de una vista existente, como el color o el tamaño de una vista `Circle` (círculo)? Para ello, tendrás que escribir algún código condicional que especifique cómo aparece la vista cuando se producen [cambios de estado](glossary://state%20change).
es_419: ¿Y si simplemente quieres cambiar el aspecto de una visualización existente, como el color o el tamaño de una visualización `Circle`? Para esto, necesitarás escribir código condicional que especifique cómo se debe mostrar la visualización cuando ocurra un [cambio de estado](glossary://state%20change).
fr: Et si tu voulais simplement modifier l’apparence d’une vue existante, comme la couleur ou la taille d’une vue `Circle` ? Pour ce faire, tu devras écrire du code conditionnel qui indique la façon dont la vue s’affiche quand des [modifications d’état](glossary://state%20change) se produisent.
it: E se volessi soltanto cambiare l'aspetto di una vista esistente, come il colore o le dimensioni di una vista `Circle`? Per farlo dovrai scrivere del codice condizionale che specifica l'aspetto della vista quando si verifica un [cambiamento di stato](glossary://state%20change).
nl: Maar wat als je gewoon het uiterlijk van een bestaande weergave wilt wijzigen, zoals de kleur of grootte van een `Circle`-weergave? Je moet daarvoor wat voorwaardelijke code schrijven die bepaalt hoe de weergave wordt weergegeven wanneer er zich [statuswijzigingen](glossary://state%20change) voordoen.
no: Men hva gjør du hvis du bare vil endre utseendet på en eksisterende visning, for eksempel fargen eller størrelsen på en `Circle`-visning? I så fall må du skrive litt betinget kode som angir hvordan visningen vises når [statusendringer](glossary://state%20change) oppstår.
pt: E se você simplesmente quiser mudar a aparência de uma visualização existente, como a cor ou o tamanho de uma visualização `Circle`? Para fazer isso, você precisará escrever um código condicional que especifique como a visualização aparece quando [alterações de estado](glossary://state%20change) ocorrem.
sv: Men vad gör du ifall du helt enkelt vill ändra utseendet på en befintlig vy, exempelvis färgen eller storleken på en `Circle`-vy? I sådant fall måste du skriva en del villkorlig kod som anger hur vyn visas när [statusändringar](glossary://state%20change) inträffar.
th: แต่ถ้าคุณเพียงต้องการเปลี่ยนรูปแบบของมุมมองที่มีอยู่แล้วล่ะ เช่น สีหรือขนาดของมุมมอง `Circle` ในกรณีนี้ คุณจะต้องเขียนโค้ดที่ทำงานผ่านเงื่อนไขที่จะกำหนดว่ามุมมองจะแสดงอย่างไรเมื่อเกิด[การเปลี่ยนแปลงสถานะ](glossary://state%20change)
tr: Peki ya sadece var olan bir görüntünün görünüşünü (örneğin `Circle` görüntüsünün rengini veya büyüklüğünü) değiştirmek istiyorsan ne olacak? Bunun için, [durum değişiklikleri](glossary://state%20change) olduğunda görüntünün nasıl görüneceğini belirten bazı koşullu kodlar yazman gerekecek.
vi: Nhưng nếu bạn chỉ muốn thay đổi giao diện của một chế độ xem hiện có, ví dụ như màu hoặc kích cỡ của chế độ xem `Circle` thì sao? Đối với việc đó, bạn sẽ cần viết một mã điều kiện nào đó chỉ định cách chế độ xem xuất hiện khi xảy ra các [thay đổi trạng thái](glossary://state%20change).
zh_cn: 但如果你只想更改现有视图的外观呢？比如 `Circle` 视图的颜色或大小。为此，你需要编写一些条件代码，以指定发生[状态更改](glossary://state%20change)时视图要如何显示。
zh_tw: 但是，如果你只是想更改現有顯示區的外觀，例如 `Circle` 顯示區的顏色或大小，那該怎麼做？為此，你需要寫入一些條件碼，指定如果發生[狀態更動](glossary://state%20change)時，顯示區要如何顯示。

source: Change view modifiers conditionally
de: Ansichtsmodifikator auf Grundlage von Bedingungen ändern
es: Cambiar los modificadores de vista de forma condicional
es_419: Cambiar los modificadores de visualizaciones de forma condicional
fr: Changer les modificateurs de vue de manière conditionnelle
it: Cambiare i modificatori della vista in modo condizionale
nl: Weergavemodifiers voorwaardelijk wijzigen
no: Endre visningsmodifikatorer betinget
pt: Altere modificadores de visualização condicionalmente
sv: Ändra vymodifierare villkorligt
th: เปลี่ยนปุ่มปรับค่ามุมมองตามเงื่อนไข
tr: Görüntü niteleyicilerini koşullu olarak değiştirme
vi: Thay đổi các trình sửa đổi chế độ xem tùy theo điều kiện
zh_cn: 按条件更改视图修饰符
zh_tw: 有條件地更改顯示區修飾符

source: Like the previous view, this view also uses a [state property](glossary://state%20property) and a `Button` to change the appearance of a `Circle`. However, something is different in this code. Take a second to try to figure out what has changed, moving on when you think you’ve found it.
de: Wie bei der vorherigen Ansicht verwendet diese Ansicht eine [Statuseigenschaft](glossary://state%20property) und eine mit `Button` erstellte Taste, um das Erscheinungsbild von `Circle` zu ändern. Doch in diesem Code ist etwas anders. Nimm dir kurz Zeit und finde heraus, was sich geändert hat. Wenn du es entdeckt hast, kannst du fortfahren.
es: Al igual que la vista anterior, esta vista también usa una [propiedad de estado](glossary://state%20property) y un botón (`Button`) para cambiar la apariencia de un círculo (`Circle`). Sin embargo, hay algo diferente en este código. Dedica unos instantes a intentar averiguar qué ha cambiado y sigue adelante cuando creas que lo has encontrado.
es_419: Al igual que en la visualización anterior, esta visualización también usa una [propiedad de estado](glossary://state%20property) y un elemento `Button` para cambiar el aspecto de un elemento `Circle`. Sin embargo, hay algo diferente en este código. Tómate un momento para intentar averiguar lo que cambió, y continúa una vez que creas saber la respuesta.
fr: Comme la vue précédente, celle-ci utilise également une [propriété d’état](glossary://state%20property) et un `Button` pour modifier l’apparence d’un `Circle`. Cependant, il y a quelque chose de différent dans ce code. Prends un moment pour essayer de comprendre ce qui a changé et passe à la suite lorsque tu penses que tu as compris.
it: Come la vista precedente, anche questa utilizza una [proprietà di stato](glossary://state%20property) e un `Button` per cambiare l'aspetto di `Circle`. Tuttavia, c'è qualcosa di diverso in questo codice. Prova a riflettere per qualche istante su cosa è cambiato e prosegui quando pensi di averlo capito.
nl: Net als in de vorige weergave, worden in deze weergave ook een [statuseigenschap](glossary://state%20property) en een `Button` gebruikt om het uiterlijk van een `Circle` te wijzen. Er is echter een verschil met de vorige code. Neem even de tijd om te ontdekken wat er anders is en ga verder als je denkt dat je het verschil hebt gevonden.
no: I likhet med den forrige visningen bruker denne visningen også en [statusegenskap](glossary://state%20property) og en `Button` til å endre utseendet på en `Circle`. Men noe er annerledes i denne koden. Bruk litt tid på å finne ut hva som har endret seg, og gå videre når du tror at du har funnet det.
pt: Como na visualização anterior, esta visualização também usa uma [propriedade de estado](glossary://state%20property) e um `Button` para mudar a aparência de um `Circle`. Porém, há algo diferente neste código. Tente descobrir o que mudou e prossiga quando achar que encontrou.
sv: I likhet med den föregående vyn använder den här vyn också en [statusegenskap](glossary://state%20property) och en `Button` till att ändra utseendet på en `Circle`. Men något är annorlunda i den här koden. Ägna ett ögonblick åt att komma på vad som har förändrats och gå vidare när du tror att du har hittat det.
th: เช่นเดียวกับมุมมองก่อนหน้านี้ มุมมองนี้ยังใช้[คุณสมบัติสถานะ](glossary://state%20property)และ `Button` เพื่อเปลี่ยนรูปแบบของ `Circle` อีกด้วย อย่างไรก็ตาม มีบางอย่างที่แตกต่างออกไปในโค้ดนี้ ให้ใช้เวลาสักครู่เพื่อค้นหาว่ามีอะไรเปลี่ยนแปลงไป และไปต่อเมื่อคุณพบแล้ว
tr: Önceki görüntü gibi, bu görüntü de `Circle`’ın görünüşünü değiştirmek için bir [durum özelliği](glossary://state%20property) ve bir `Button` kullanır. Ancak, bu kodda bir şey farklı. Neyin değiştiğini anlamak için biraz bekle, bulduğunu düşündüğünde devam et.
vi: Giống như chế độ xem trước đó, chế độ xem này cũng sử dụng một [thuộc tính trạng thái](glossary://state%20property) và một `Button` để thay đổi giao diện của một `Circle`. Tuy nhiên, có điều gì đó khác trong mã này. Hãy dành giây lát để cố gắng tìm ra điều gì đã thay đổi, tiếp tục khi bạn cho rằng mình đã phát hiện ra.
zh_cn: 与上一个视图类似，这个视图也使用[状态属性](glossary://state%20property)和一个 `Button` 来更改 `Circle` 的外观。但是，这个代码中有些不同。花点时间试着弄明白什么发生了变化，清楚后，便可继续学习了。
zh_tw: 和前面的顯示區一樣，這個顯示區也使用了[狀態屬性](glossary://state%20property)和 `Button` 來更改 `Circle` 的外觀。但是，這段程式碼有些不同。花點時間試著找出發生了什麼變化，當你認為已經找到時就繼續往前進行。

source: Did you figure out how it works?
de: Hast du herausgefunden, wie es funktioniert?
es: ¿Has averiguado cómo funciona?
es_419: ¿Averiguaste cómo funciona?
fr: As-tu compris comment cela fonctionne ?
it: Hai capito come funziona?
nl: Heb je ontdekt hoe het werkt?
no: Fant du ut hvordan det fungerer?
pt: Descobriu como funciona?
sv: Kom du på hur det fungerar?
th: คุณนึกออกหรือไม่ว่าสิ่งนี้ทำงานอย่างไร
tr: Nasıl çalıştığını anlayabildin mi?
vi: Bạn đã tìm ra cách hoạt động chưa?
zh_cn: 你知道它如何工作了吗？
zh_tw: 你弄清楚了它是如何運作的嗎？

source: Instead of creating a different view when `isOn` is `true` or `false`, you can modify the appearance of a single view using [view modifiers](glossary://modifier) that contain conditional code.
de: Anstatt jeweils eine Ansicht zu erstellen, wenn `isOn` den Wert `true` oder `false` hat, kannst du das Erscheinungsbild einer einzelnen Ansicht ändern, indem du [Ansichtsmodifikatoren](glossary://modifier) mit bedingtem Code verwendest.
es: En lugar de crear una vista diferente cuando `isOn` es `true` o `false`, puedes modificar la apariencia de una sola vista usando [modificadores de vista](glossary://modifier) que contienen código condicional.
es_419: En lugar de crear una visualización diferente cuando `isOn` tenga un valor `true` o `false`, puedes modificar el aspecto de una sola visualización utilizando [modificadores de visualización](glossary://modifier) con código condicional.
fr: Plutôt que de créer une vue différente lorsque `isOn` est `true` ou `false`, tu peux modifier l’apparence d’une seule vue avec des [modificateurs de vue](glossary://modifier) qui contiennent un code conditionnel.
it: Invece di creare una vista diversa quando `isOn` è `true` o `false`, puoi modificare l'aspetto di una singola vista utilizzando i [modificatori vista](glossary://modifier) che contengono codice condizionale.
nl: In plaats van verschillende weergaven aan te maken wanneer `isOn` de waarde `true` of `false` heeft, kun je één weergave gebruiken waarvan je het uiterlijk aanpast met [weergavemodifiers](glossary://modifier) die voorwaardelijke code bevatten.
no: I stedet for å opprette forskjellige visninger når `isOn` er `true` eller `false`, kan du endre utseendet på én visning med [visningsmodifikatorer](glossary://modifier) som inneholder betinget kode.
pt: Em vez de criar uma visualização diferente quando `isOn` for `true` ou `false`, você pode modificar a aparência de uma única visualização usando [modificadores de visualização](glossary://modifier) que contêm código condicional.
sv: Istället för att skapa olika vyer när `isOn` är `true` eller `false` kan du ändra utseendet på en enda vy med [vymodifierare](glossary://modifier) som innehåller villkorlig kod.
th: แทนที่จะสร้างมุมมองที่แตกต่างกันเมื่อ `isOn` เป็น `true` หรือ `false` คุณสามารถแก้ไขรูปแบบของมุมมองเดียวโดยใช้[ปุ่มปรับค่ามุมมอง](glossary://modifier)ที่มีโค้ดที่ทำงานผ่านเงื่อนไขได้
tr: `isOn` `true` ya da `false` olduğunda farklı bir görüntü yaratmak yerine, koşullu kod içeren [görüntü niteleyicilerini](glossary://modifier) kullanarak tek bir görüntünün görünüşünü değiştirebilirsin.
vi: Thay vì tạo ra một chế độ xem khác khi `isOn` là `true` hoặc `false`, bạn có thể sửa đổi giao diện của một chế độ xem đơn nhất bằng các [trình sửa đổi chế độ xem](glossary://modifier) chứa mã điều kiện.
zh_cn: 除了在 `isOn` 为 `true` 或 `false` 时创建不同的视图，你可以使用包含条件代码的[视图修饰符](glossary://modifier)来修改单个视图的外观。
zh_tw: 當 `isOn` 為 `true` 或 `false` 時，無需製作不同的顯示區，你可以使用包含條件程式碼的[顯示區修飾符](glossary://modifier)來修改單一顯示區的外觀。
