Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepNavigating in SwiftUI..SuccessMessage..Paragraph165
source: Remember that when you use a `NavigationLink`, it only works if the view you’re navigating from is inside a `NavigationStack` or a `NavigationSplitView`.
de: Denk daran, dass der Navigations-Link beim Verwenden von `NavigationLink` nur funktioniert, wenn sich die Ansicht, von der du kommst, in `NavigationStack` oder in `NavigationSplitView` befindet.
es: Recuerda que cuando usas un enlace de navegación (`NavigationLink`), solo funciona si la vista desde la que navegas está dentro de una pila de navegación (`NavigationStack`) o de una vista dividida de navegación (`NavigationSplitView`).
es_419: Recuerda que cuando uses un enlace `NavigationLink`, este sólo funcionará si la visualización desde la que navegas está dentro de una visualización `NavigationStack` o `NavigationSplitView`.
fr: N’oublie pas que lorsque tu utilises un `NavigationLink`, celui-ci ne fonctionne que si la vue vers laquelle tu navigues est à l’intérieur d’une `NavigationStack` ou d’une `NavigationSplitView`.
it: Quando usi un `NavigationLink`, ricordati che funzionerà soltanto se la vista di partenza della navigazione si trova all'interno di una `NavigationStack` o di una `NavigationSplitView`.
nl: Onthoud dat een `NavigationLink` alleen werkt als de weergave van waaruit je navigeert zich in een `NavigationStack` of een `NavigationSplitView` bevindt.
no: Husk at når du bruker en `NavigationLink`, fungerer den bare hvis visningen du navigerer fra, finnes inni en `NavigationStack` eller en `NavigationSplitView`.
pt: Lembre-se de que quando você usa um `NavigationLink`, ele só funciona se a visualização da qual você está navegando estiver dentro de um `NavigationStack` ou uma `NavigationSplitView`.
sv: Kom ihåg: när du använder en `NavigationLink` fungerar den bara ifall vyn du navigerar från finns inuti en `NavigationStack` eller en `NavigationSplitView`.
th: อย่าลืมว่าเมื่อคุณใช้ `NavigationLink` สิ่งนี้จะใช้งานได้ก็ต่อเมื่อมุมมองที่คุณนำทางมานั้นอยู่ภายใน `NavigationStack` หรือ `NavigationSplitView`
tr: Bir `NavigationLink` kullandığında, yalnızca geldiğin görüntü bir `NavigationStack`’in veya `NavigationSplitView`’un içindeyse bu bağlantının çalışacağını unutma.
vi: Khi bạn sử dụng, hãy nhớ rằng `NavigationLink` chỉ hoạt động nếu chế độ xem mà bạn đang điều hướng đi nằm bên trong một `NavigationStack` hoặc một `NavigationSplitView`.
zh_cn: 别忘了，使用 `NavigationLink` 时，只有当你正在导航的视图位于 `NavigationStack` 或 `NavigationSplitView` 内时，`NavigationLink` 才有用。
zh_tw: 請記住，當你使用 `NavigationLink` 時，它只有在你導覽的顯示區位於 `NavigationStack` 或 `NavigationSplitView` 內時才有效。

# GuideBook..Guide0..StepNavigating in SwiftUI..SuccessMessage..Paragraph166
source: Next, you’ll learn how to share data between all of your app’s views.
de: Als Nächstes lernst du, wie man Daten mit allen Ansichten der App teilt.
es: A continuación, aprenderás a compartir datos entre todas las vistas de tu app.
es_419: A continuación, aprenderás a compartir datos entre todas las visualizaciones de tu app.
fr: Ensuite, tu découvriras comment partager des données entre toutes les vues de ton app.
it: Nella prossima attività, imparerai a condividere dati tra tutte le viste della tua app.
nl: Nu ga je leren hoe je gegevens tussen alle weergaven van je app deelt.
no: Nå skal du lære hvordan du deler data mellom alle visningene i appen.
pt: A seguir, você aprenderá a compartilhar dados entre todas as visualizações do app.
sv: Härnäst lär du dig hur du delar data mellan alla vyerna i appen.
th: ถัดไป คุณจะได้เรียนรู้วิธีแชร์ข้อมูลระหว่างมุมมองทั้งหมดของแอปของคุณ
tr: Sonra, uygulamanın tüm görüntüleri arasında nasıl veri paylaşacağını öğreneceksin.
vi: Tiếp theo, bạn sẽ học cách chia sẻ dữ liệu giữa tất cả các chế độ xem của ứng dụng.
zh_cn: 下一步，你将学习如何在所有的 App 视图间共享数据。
zh_tw: 接下來，你將學習如何在 App 的所有顯示區之間共享資料。

# GuideBook..Guide0..StepSharing Data Between Views..title
source: Sharing Data Between Views
de: Daten mit Ansichten teilen
es: Compartir datos entre las vistas
es_419: Compartir datos con varias visualizaciones
fr: Partage de données entre des vues
it: Condividere i dati tra le viste
nl: Gegevens tussen weergaven delen
no: Dele data mellom visninger
pt: Compartilhando Dados Entre Visualizações
sv: Dela data mellan vyer
th: การแชร์ข้อมูลระหว่างมุมมอง
tr: Görüntüler Arasında Veri Paylaşma
vi: Chia sẻ dữ liệu giữa các chế độ xem
zh_cn: 在视图间共享数据
zh_tw: 在顯示區之間共享資料

source: You previously learned about how to store data [locally](glossary://local%20scope) using a [state property](glossary://state%20value), and between two views using a [binding](glossary://binding). But what if you want to share data in an app that has multiple views, like you do now?
de: Du hast bereits gelernt, wie man mit einer [Statuseigenschaft](glossary://state%20value) Daten [lokal](glossary://local%20scope) und zwischen zwei Ansichten mithilfe einer [Bindung](glossary://binding) speichert. Aber was machst du, wenn du Daten in einer App teilen möchtest, die mehr Ansichten als dein aktuelles Projekt hat?
es: Anteriormente has aprendido a guardar los datos [localmente](glossary://local%20scope) usando una [propiedad de estado](glossary://state%20value), y a pasar de una vista a otra usando una [vinculación](glossary://binding). ¿Pero qué pasa si quieres compartir datos en una app que tiene varias vistas, como ahora?
es_419: Ya aprendiste a almacenar datos [localmente](glossary://local%20scope) utilizando una [propiedad de estado](glossary://state%20value), así como entre dos visualizaciones usando una [ligadura](glossary://binding). Pero, ¿y si quieres compartir datos en una app que tiene varias visualizaciones, como en este caso?
fr: Tu as appris précédemment comment stocker des données [localement](glossary://local%20scope) à l’aide d’une [propriété d’état](glossary://state%20value), et entre deux vues à l’aide d’une [association](glossary://binding). Et si tu souhaites partager des données dans une app qui dispose de plusieurs vues, comme c’est le cas maintenant ?
it: In precedenza, hai imparato come salvare dati [in locale](glossary://local%20scope) utilizzando una [proprietà di stato](glossary://state%20value) e a condividerli tra due viste utilizzando un [vincolo](glossary://binding). Ma cosa dovresti fare se volessi condividere dati in un'app con più viste, come quella che hai adesso?
nl: Je hebt eerder geleerd hoe je gegevens [lokaal](glossary://local%20scope) opslaat met behulp van een [statuseigenschap](glossary://state%20value) en hoe je gegevens tussen twee weergaven deelt met behulp van een [binding](glossary://binding). Maar wat als je gegevens wilt delen in een app met meerdere weergaven, zoals je app nu heeft?
no: Tidligere lærte du å lagre data [lokalt](glossary://local%20scope) med en [statusegenskap](glossary://state%20value) og mellom to visninger med en [binding](glossary://binding). Men hva gjør du hvis du vil dele data i en app som har flere visninger, som du gjør nå?
pt: Anteriormente, você aprendeu a armazenar dados [localmente](glossary://local%20scope) usando uma [propriedade de estado](glossary://state%20value), e entre duas visualizações usando um [vínculo](glossary://binding). E se você quiser compartilhar dados em um app que tem várias visualizações, como o que você tem agora?
sv: Tidigare lärde du dig att lagra data [lokalt](glossary://local%20scope) med en [statusegenskap](glossary://state%20value) och mellan två vyer med en [koppling](glossary://binding). Men vad gör du ifall du vill dela i en app som har flera vyer, som du gör nu?
th: ก่อนหน้านี้คุณได้เรียนรู้เกี่ยวกับวิธีจัดเก็บข้อมูล[ภายใน](glossary://local%20scope)โดยใช้[คุณสมบัติสถานะ](glossary://state%20value) และระหว่างสองมุมมองโดยใช้[การรวม](glossary://binding)ไปแล้ว แต่จะทำอย่างไรหากคุณต้องการแชร์ข้อมูลในแอปที่มีหลายมุมมอง เหมือนกับที่คุณทำอยู่ตอนนี้ล่ะ
tr: Verileri bir [durum özelliği](glossary://state%20value) kullanarak [yerel olarak](glossary://local%20scope) ve bir [bağlama](glossary://binding) kullanarak iki görüntü arasında nasıl saklayacağını daha önce öğrendin. Peki ya şimdi olduğu gibi birden fazla görüntüsü olan bir uygulamadaki verileri paylaşmak istersen ne olacak?
vi: Trước đó, bạn đã học cách lưu trữ dữ liệu [cục bộ](glossary://local%20scope) bằng [thuộc tính trạng thái](glossary://state%20value) và giữa hai chế độ xem bằng một [ràng buộc](glossary://binding). Nhưng nếu bạn muốn chia sẻ dữ liệu trong một ứng dụng có nhiều chế độ xem, giống như bạn thực hiện bây giờ thì sao?
zh_cn: 你之前已经学到了如何使用[状态属性](glossary://state%20value)以及在两个视图间使用[绑定](glossary://binding)来在[本地](glossary://local%20scope)储存数据。但如果你想在带有多个视图的 App 中共享数据（就像现在这种情况），该怎么办呢？
zh_tw: 你先前學習了如何使用[狀態屬性](glossary://state%20value)在[區域](glossary://local%20scope)以及使用[綁定](glossary://binding)在兩個顯示區之間儲存資料。但是，如果像你現在這樣要具有多個顯示區的 App 中共享資料，該怎麼做？

source: To share the same data between multiple views, you need a single source of truth that is [separate](glossary://data%20separation) from the views. This is the [data model](glossary://data%20model), and you can share it with any views that need access to the data.
de: Um dieselben Daten mit mehreren Ansichten zu teilen, brauchst du eine eindeutige, von den Ansichten [getrennte](glossary://data%20separation) Wahrheitsquelle. Dies übernimmt das [Datenmodell](glossary://data%20model). Es kann mit sämtlichen Ansichten geteilt werden, die auf die Daten zugreifen müssen.
es: Para compartir los mismos datos entre varias vistas, se necesita una única fuente de datos que esté [separada](glossary://data%20separation) de las vistas. Se trata del [modelo de datos](glossary://data%20model) y puedes compartirlo con cualquier vista que necesite acceder a los datos.
es_419: Para compartir los mismos datos entre varias visualizaciones, necesitas una fuente única de información que esté [separada](glossary://data%20separation) de las visualizaciones. Este es el [modelo de datos](glossary://data%20model), y puede compartirse con cualquier visualización que necesite acceder a los datos.
fr: Pour partager les mêmes données entre plusieurs vues, tu as besoin d’une source de vérité unique qui est [séparée](glossary://data%20separation) des vues. Il s’agit du [modèle de données](glossary://data%20model) et tu peux le partager avec toute vue qui a besoin d’accéder aux données.
it: Per condividere gli stessi dati tra più viste, ti serve una singola sorgente univoca che sia [separata](glossary://data%20separation) dalle viste. Questo è il [modello di dati](glossary://data%20model) e puoi condividerlo con qualsiasi vista a cui serva l'accesso ai dati.
nl: Om dezelfde gegevens tussen meerdere weergaven te delen, heb je één bron van waarheid nodig die [gescheiden](glossary://data%20separation) is van de weergaven. Het [gegevensmodel](glossary://data%20model) fungeert als deze bron van waarheid en kun je met alle weergaven delen die toegang nodig hebben tot je gegevens.
no: Når du vil dele de samme dataene mellom flere visninger, må du ha én sannhetskilde som finnes [adskilt](glossary://data%20separation) fra visningene. Dette er [datamodellen](glossary://data%20model), og du kan dele den med alle visninger som trenger tilgang til dataene.
pt: Para compartilhar os mesmos dados entre várias visualizações, você precisa de uma única fonte da verdade que seja [separada](glossary://data%20separation) das visualizações. Isto é o [modelo de dados](glossary://data%20model), que você pode compartilhar com quaisquer visualizações que precisem de acesso aos dados.
sv: När du vill dela samma data mellan flera vyer måste du ha en enda sanningskälla som finns [separat](glossary://data%20separation) från vyerna. Det här är [datamodellen](glossary://data%20model) och du kan dela den med alla vyer som behöver tillgång till dessa data.
th: ในการแชร์ข้อมูลเดียวกันระหว่างหลายมุมมอง คุณต้องใช้แหล่งข้อมูลจริงเดียวที่[แยก](glossary://data%20separation)จากมุมมอง สิ่งนี้คือ[โมเดลข้อมูล](glossary://data%20model) และคุณสามารถแชร์โมเดลข้อมูลกับมุมมองใดก็ได้ที่ต้องการเข้าถึงข้อมูล
tr: Birden fazla görüntü arasında aynı verileri paylaşmak için görüntülerden [ayrı](glossary://data%20separation) tek bir gerçeklik kaynağına ihtiyacın var. Bu [veri modelidir](glossary://data%20model) ve onu verilere erişmesi gereken tüm görüntülerle paylaşabilirsin.
vi: Để chia sẻ cùng một dữ liệu giữa nhiều chế độ xem, bạn cần một nguồn chân lý đơn nhất [tách](glossary://data%20separation) riêng khỏi các chế độ xem. Đây là [mô hình dữ liệu](glossary://data%20model) và bạn có thể chia sẻ với bất kỳ chế độ xem nào cần truy cập vào dữ liệu.
zh_cn: 若要在多个视图间共享相同的数据，你需要与视图[分离](glossary://data%20separation)的单个可信源。这便是[数据模型](glossary://data%20model)，你可以与需要访问这些数据的任何视图共享它。
zh_tw: 若要在多個顯示區之間共享相同的資料，你需要與顯示區[分離](glossary://data%20separation)的單一真實來源。這就是[資料模型](glossary://data%20model)，它可以與任何需要取用資料的顯示區共享。

source: A common way to construct a data model for a SwiftUI app is to use an [observable object](glossary://observable%20object). An observable object is a [type](glossary://type) with properties that multiple views can [observe](glossary://observe). Those views can watch for state changes in the properties, allowing them to update their UI to stay in sync.
de: Üblicherweise wird ein Datenmodell für eine SwiftUI-App mit einem [beobachtbaren Objekt](glossary://observable%20object) konstruiert. Ein beobachtbares Objekt ist ein [Typ](glossary://type) mit Eigenschaften, die von mehreren Ansichten [beobachtet](glossary://observe) werden können. Diese Ansichten können auf Statusänderungen der Eigenschaften achten, um ihre Benutzeroberfläche gegebenenfalls zu aktualisieren und die Änderungen darzustellen.
es: Una forma habitual de construir un modelo de datos para una app de SwiftUI es usar un [objeto observable](glossary://observable%20object). Un objeto observable es un [tipo](glossary://type) con propiedades que varias vistas pueden [observar](glossary://observe). Estas vistas pueden observar los cambios de estado en las propiedades, lo que les permite actualizar su IU para mantenerse sincronizadas.
es_419: Una manera común de construir un modelo de datos para una app de SwiftUI es mediante un [objeto observable](glossary://observable%20object), el cual es un [tipo](glossary://type) con propiedades que pueden ser [observadas](glossary://observe) por varias visualizaciones. Esas visualizaciones pueden observar los cambios de estado en las propiedades, y esto les permite actualizar su interfaz para mantenerse sincronizadas.
fr: Une façon habituelle de construire un modèle de données pour une app SwiftUI est d’utiliser un [objet observable](glossary://observable%20object). Un objet observable est un [type](glossary://type) avec des propriétés que plusieurs vues peuvent [observer](glossary://observe). Ces vues peuvent surveiller les modifications d’état dans les propriétés, ce qui leur permet de mettre à jour leur interface utilisateur pour rester synchronisées.
it: Per costruire modello di dati per un'app in SwiftUI, si utilizza comunemente un [oggetto osservabile](glossary://observable%20object), ossia un [tipo](glossary://type) con proprietà che possono essere [osservate](glossary://observe) da più viste. Tali viste monitorano i cambiamenti di stato nelle proprietà, consentendo loro di aggiornare la UI per rimanere sincronizzate.
nl: Gegevensmodellen voor SwiftUI-apps worden vaak gemaakt met behulp van een [observeerbaar object](glossary://observable%20object). Een observeerbaar object is een [type](glossary://type) met eigenschappen die kunnen worden [geobserveerd](glossary://observe) door meerdere weergaven. Deze weergaven kunnen bijhouden of er statuswijzigingen in de eigenschappen optreden en kunnen hun gebruikersinterface aanpassen aan deze wijzigingen.
no: En vanlig måte å konstruere en datamodell for en SwiftUI-app på, er å bruke et [observerbart objekt](glossary://observable%20object). Et observerbart objekt er en [type](glossary://type) med egenskaper som flere visninger kan [observere](glossary://observe). Disse visningene kan se etter statusendringer i egenskapene, slik at de kan oppdatere brukergrensesnittene og være synkroniserte.
pt: Uma maneira comum de construir um modelo de dados para um app de SwiftUI é usar um [objeto observável](glossary://observable%20object). Um objeto observável é um [tipo](glossary://type) com propriedades que várias visualizações podem [observar](glossary://observe). Essas visualizações podem observar alterações de estado nas propriedades, permitindo que elas atualizem suas IUs para permanecerem em sincronia.
sv: Ett vanligt sätt att konstruera en datamodell för en SwiftUI-app är att använda ett [observerbart objekt](glossary://observable%20object). Ett observerbart objekt är en [typ](glossary://type) med egenskaper som flera vyer kan [observera](glossary://observe). De här vyerna kan hålla koll på statusändringar i egenskaperna så att de kan uppdatera sina UI:er och hålla sig synkroniserade.
th: วิธีทั่วไปในการสร้างโมเดลข้อมูลสำหรับแอป SwiftUI คือการใช้[วัตถุที่สังเกตเห็นได้](glossary://observable%20object) วัตถุที่สังเกตเห็นได้คือ[ประเภท](glossary://type)ที่มีคุณสมบัติที่หลายมุมมองสามารถ[สังเกตเห็นได้](glossary://observe) มุมมองเหล่านั้นสามารถเฝ้าดูการเปลี่ยนแปลงสถานะในคุณสมบัติได้ ซึ่งทำให้สามารถอัปเดต UI ของตัวเองให้ตรงกันได้เสมอ
tr: Bir SwiftUI uygulaması için veri modeli oluşturmanın yaygın bir yolu [gözlemlenebilir nesne](glossary://observable%20object) kullanmaktır. Gözlemlenebilir nesne, birden fazla görüntünün [gözlemleyebileceği](glossary://observe) özelliklere sahip bir [tiptir](glossary://type). Bu görüntüler, özelliklerdeki durum değişikliklerini izleyebilir ve eşzamanlı kalmak için kendi kullanıcı arayüzlerinin güncellenmesine izin verebilir.
vi: Một cách phổ biến để xây dựng mô hình dữ liệu cho ứng dụng SwiftUI là sử dụng một [đối tượng có thể quan sát](glossary://observable%20object). Đối tượng có thể quan sát là một [kiểu](glossary://type) có các thuộc tính mà nhiều chế độ xem có thể [quan sát](glossary://observe). Những chế độ xem đó có thể theo dõi các thay đổi trạng thái trong các thuộc tính, cho phép chúng cập nhật UI của mình để duy trì sự đồng bộ.
zh_cn: 为 SwiftUI App 构建数据模型的常用方法是使用[可观测对象](glossary://observable%20object)。可观测对象是一种[类型](glossary://type)，带有可供多个视图[观测](glossary://observe)的属性。这些视图可以观测属性中的状态更改，让它们可以更新自己的 UI 来保持同步。
zh_tw: 為 SwiftUI App 建構資料模型的常用方法是使用[可觀察的物件](glossary://observable%20object)。可觀察的物件是一個[類型](glossary://type)，其屬性可被多個顯示區[觀察](glossary://observe)。這些顯示區可監視屬性中的狀態更動，從而使它們能更新其 UI 以保持同步。

# GuideBook..Guide0..StepSharing Data Between Views..TaskcreatureZoo..title
source: Your data model
de: Dein Datenmodell
es: Tu modelo de datos
es_419: Tu modelo de datos
fr: Ton modèle de données
it: Il tuo modello di dati
nl: Je gegevensmodel
no: Din datamodell
pt: O modelo de dados
sv: Din datamodell
th: โมเดลข้อมูลของคุณ
tr: Veri modelin
vi: Mô hình dữ liệu của bạn
zh_cn: 你的数据模型
zh_tw: 你的資料模型

source: This is your data model — the [observable object](glossary://observable%20object), `CreatureZoo`. It is a [class](glossary://class) that follows the guidelines of the `ObservableObject` [protocol](glossary://protocol). This allows the class to [publish](glossary://publish) certain properties.
de: Dies ist dein Datenmodell: das [beobachtbare Objekt](glossary://observable%20object) `CreatureZoo`. Es ist eine [Klasse](glossary://class), die den Richtlinien des `ObservableObject`-[Protokolls](glossary://protocol) folgt. Dadurch kann die Klasse bestimmte Werte [veröffentlichen](glossary://publish).
es: Este es tu modelo de datos: el [objeto observable](glossary://observable%20object), `CreatureZoo`. Es una [clase](glossary://class) que sigue el conjunto de pautas del [protocolo](glossary://protocol) `ObservableObject`. Esto permite a la clase [publicar](glossary://publish) determinadas propiedades.
es_419: Este es tu modelo de datos, conocido como el [objeto observable](glossary://observable%20object) `CreatureZoo`. Es una [clase](glossary://class) que sigue los lineamientos del [protocolo](glossary://protocol) `ObservableObject`. Esto permite a la clase [publicar](glossary://publish) propiedades específicas.
fr: Voici ton modèle de données, l’[objet observable](glossary://observable%20object), `CreatureZoo`. Il s’agit d’une [classe](glossary://class) qui suit les consignes du [protocole](glossary://protocol) `ObservableObject`. Cela permet à la classe de [publier](glossary://publish) certaines propriétés.
it: Questo è il tuo modello di dati: l'[oggetto osservabile](glossary://observable%20object) `CreatureZoo`. È una [classe](glossary://class) che segue le linee guida del [protocollo](glossary://protocol) `ObservableObject`, che consente alla classe di [pubblicare](glossary://publish) determinate proprietà.
nl: Dit is je gegevensmodel: het [observeerbare object](glossary://observable%20object), `CreatureZoo`. Het is een [klasse](glossary://class) die voldoet aan de richtlijnen van het [protocol](glossary://protocol) `ObservableObject`, waardoor de klasse bepaalde eigenschappen kan [publiceren](glossary://publish).
no: Dette er datamodellen din – det [observerbare objektet](glossary://observable%20object) `CreatureZoo`. Det er en [klasse](glossary://class) som følger retningslinjene i [protokollen](glossary://protocol) `ObservableObject`. Dette innebærer at klassen kan [publisere](glossary://publish) bestemte egenskaper.
pt: Este é o seu modelo de dados: o [objeto observável](glossary://observable%20object) `CreatureZoo`. Ele é uma [classe](glossary://class) que segue as orientações do [protocolo](glossary://protocol) `ObservableObject`. Isso permite que a classe [publique](glossary://publish) certas propriedades.
sv: Det här är din datamodell – det [observerbara objektet](glossary://observable%20object) `CreatureZoo`. Det är en [klass](glossary://class) som följer riktlinjerna i [protokollet](glossary://protocol) `ObservableObject`. Det innebär att klassen kan [publicera](glossary://publish) vissa egenskaper.
th: นี่คือโมเดลข้อมูลของคุณ นั่นคือ[วัตถุที่สังเกตเห็นได้](glossary://observable%20object) `CreatureZoo` ซึ่งเป็น[คลาส](glossary://class)ที่เป็นไปตามแนวทางของ[โปรโตคอล](glossary://protocol) `ObservableObject` สิ่งนี้จะช่วยให้คลาส[เผยแพร่](glossary://publish)คุณสมบัติบางอย่างได้
tr: Bu, veri modelin olan `CreatureZoo` [gözlemlenebilir nesnesidir](glossary://observable%20object). `ObservableObject` [protokolünün](glossary://protocol) kurallarına uyan bir [sınıftır](glossary://class). Bu, sınıfın belirli özellikleri [yayımlamasına](glossary://publish) izin verir.
vi: Đây là mô hình dữ liệu của bạn – [đối tượng có thể quan sát](glossary://observable%20object), `CreatureZoo`. Đó là một [lớp](glossary://class) tuân theo các hướng dẫn của [giao thức](glossary://protocol) `ObservableObject`. Việc này cho phép lớp [đăng](glossary://publish) các thuộc tính nhất định.
zh_cn: 这是你的数据模型，即[可观测对象](glossary://observable%20object) `CreatureZoo`。它是遵循 `ObservableObject`（可观测对象）[协议](glossary://protocol)规则的[类](glossary://class)。这可让类[发布](glossary://publish)特定属性。
zh_tw: 這是你的資料模型：[可觀察的物件](glossary://observable%20object) `CreatureZoo`。它是一個依循 `ObservableObject` [協定](glossary://protocol)準則的[類別](glossary://class)。這能讓類別[發佈](glossary://publish)部分屬性。
