Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Time to try it yourself. See if you can figure out how to use the `.scaleEffect(_:)` modifier with a [ternary conditional operator](glossary://ternary%20conditional%20operator) to change the scale of the circle based on the state of `isOn`.
de: Jetzt ist es an der Zeit, es selbst auszuprobieren. Finde heraus, wie der Modifikator `.scaleEffect(_:)` mit einem [dreigliedrigen bedingten Operator](glossary://ternary%20conditional%20operator) verwendet wird, um die Kreisgröße je nach Status von `isOn` zu ändern.
es: Es hora de que lo pruebes tú. A ver si puedes averiguar cómo usar el modificador `.scaleEffect(_:)` con un [operador condicional ternario](glossary://ternary%20conditional%20operator) para cambiar la escala del círculo en función del estado de `isOn`.
es_419: Es hora de un reto. Intenta entender por tu cuenta cómo usar el modificador `.scaleEffect(_:)` con un [operador condicional ternario](glossary://ternary%20conditional%20operator) para cambiar la escala del círculo utilizando el estado de `isOn`.
fr: Il est temps d’essayer par toi-même. Tente de comprendre comment utiliser le modificateur `.scaleEffect(_:)` avec un [opérateur conditionnel ternaire](glossary://ternary%20conditional%20operator) pour changer l’échelle du cercle en fonction de l’état de `isOn`.
it: È arrivato il momento di sperimentare in autonomia! Prova a capire come utilizzare il modificatore `.scaleEffect(_:)` con un [operatore condizionale ternario](glossary://ternary%20conditional%20operator) per modificare la scala del cerchio in base allo stato di `isOn`.
nl: Tijd om het zelf te proberen. Kijk of je kunt ontdekken hoe je de modifier `.scaleEffect(_:)` kunt gebruiken in combinatie met een [driedelige voorwaardelijke operator](glossary://ternary%20conditional%20operator) om de grootte van de cirkel te wijzigen op basis van de status van `isOn`.
no: Nå er det på tide å prøve selv. Se om du kan finne ut hvordan du kan bruke modifikatoren `.scaleEffect(_:)` med en [tredobbel betinget operator](glossary://ternary%20conditional%20operator) til å endre skalaen på sirkelen basert på statusen til `isOn`.
pt: Hora de tentar por sua conta. Veja se você consegue descobrir como usar o modificador `.scaleEffect(_:)` com um [operador condicional ternário](glossary://ternary%20conditional%20operator) para mudar a escala do círculo com base no estado de `isOn`.
sv: Nu är det dags att prova själv. Försök att komma på hur du kan använda modifieraren `.scaleEffect(_:)` tillsammans med en [trefaldig villkorlig operator](glossary://ternary%20conditional%20operator) till att ändra skalan på cirkeln baserad på statusen för `isOn`.
th: ถึงเวลาลองทำด้วยตัวคุณเองแล้ว ลองดูว่าคุณจะใช้ปุ่มปรับค่า `.scaleEffect(_:)` ร่วมกับ[ตัวดำเนินการเงื่อนไขแบบสามส่วน](glossary://ternary%20conditional%20operator)อย่างไรเพื่อเปลี่ยนขนาดของวงกลมตามสถานะ `isOn`
tr: Şimdi kendi kendine deneme zamanı. `isOn`'un durumuna göre dairenin ölçeğini değiştirmek için bir [üçlü koşullu işlece](glossary://ternary%20conditional%20operator) sahip `.scaleEffect(_:)` niteleyicisini kullanmayı öğrenip öğrenemeyeceğini gör.
vi: Đã đến lúc bạn tự mình làm thử. Hãy xem bạn có thể tìm ra cách sử dụng trình sửa đổi `.scaleEffect(_:)` với một [toán tử điều kiện tam phân](glossary://ternary%20conditional%20operator) để thay đổi tỷ lệ của hình tròn dựa trên trạng thái của `isOn` hay không.
zh_cn: 是时候自己试试了。看看你是否知道如何使用 `.scaleEffect(_:)`（比例效果）修饰符和[三元条件运算符](glossary://ternary%20conditional%20operator)，根据 `isOn` 的状态来更改圆圈的比例。
zh_tw: 是時候該自己嘗試一下了。看看你是否能弄清楚如何使用 `.scaleEffect(_:)` 修飾符和[三元條件運算子](glossary://ternary%20conditional%20operator)來根據 `isOn` 的狀態更改圓圈的比例。

source: First, add the `.scaleEffect(_:)` modifier to the circle. Then, use the ternary operator to specify one scale if `isOn` is `true`, and to another if `false`.
de: Füge als Erstes den Modifikator `.scaleEffect(_:)` zum Kreis hinzu. Verwende dann den dreigliedrigen bedingten Operator, um eine Größe festzulegen, wenn `isOn` den Wert `true` hat, und eine andere, wenn `isOn` den Wert `false` hat.
es: Primero, añade el modificador `.scaleEffect(_:)` al círculo. A continuación, usa el operador ternario para especificar una escala si `isOn` es `true` (verdadero), y otra si es falso (false).
es_419: Primero, agrega el modificador `.scaleEffect(_:)` al círculo. Luego, usa el operador ternario para especificar una escala si `isOn` es `true`, y otra si es `false`.
fr: Commence par ajouter le modificateur `.scaleEffect(_:)` au cercle. Ensuite, utilise l’opérateur ternaire pour indiquer une échelle si `isOn` est `true`, et une autre s’il est `false`.
it: Innanzitutto aggiungi il modificatore `.scaleEffect(_:)` al cerchio. Quindi, utilizza l'operatore ternario per specificare un valore di scala se `isOn` è `true` e un altro se è `false`.
nl: Voeg om te beginnen de modifier `.scaleEffect(_:)` aan de cirkel toe. Gebruik vervolgens de driedelige operator om de ene grootte op te geven als `isOn` de waarde `true` heeft, en de andere grootte als `isOn` de waarde `false` heeft.
no: Legg først til modifikatoren `.scaleEffect(_:)` i sirkelen. Bruk deretter den tredoble operatoren til å angi en skala hvis `isOn` er `true` og en annen hvis den er `false`.
pt: Primeiro, adicione o modificador `.scaleEffect(_:)` ao círculo. Depois, use o operador ternário para especificar uma escala se `isOn` for `true` e outra se for `false`.
sv: Lägg först till modifieraren `.scaleEffect(_:)` i cirkeln. Använd sedan den trefaldiga operatorn till att ange en skala ifall `isOn` är `true` och en annan ifall den är `false`.
th: ก่อนอื่นให้เพิ่มปุ่มปรับค่า `.scaleEffect(_:)` ไปที่วงกลม จากนั้นใช้ตัวดำเนินการแบบสามส่วนเพื่อระบุขนาดใดขนาดหนึ่งหาก `isOn` เป็น `true` และขนาดอื่นหากเป็น `false`
tr: Öncelikle, daireye `.scaleEffect(_:)` niteleyicisini ekle. Sonra, `isOn` doğruysa (`true`) bir ölçek belirtmek, yanlışsa (`false`) başka bir tane belirtmek için üçlü işleci kullan.
vi: Trước tiên, hãy thêm trình sửa đổi `.scaleEffect(_:)` vào hình tròn. Sau đó, sử dụng toán tử tam phân để chỉ định một tỷ lệ nếu `isOn` là `true` và một tỷ lệ khác nếu là `false`.
zh_cn: 首先，给圆圈添加 `.scaleEffect(_:)` 修饰符。然后，使用三元运算符在 `isOn` 为 `true` 时指定一个缩放比例，在它为 `false` 时指定另一个比例。
zh_tw: 首先，將 `.scaleEffect(_:)` 修飾符加入圓圈中。然後，如果 `isOn` 為 `true`，則使用三元運算子指定一個比例，如果為 `false` 則指定另一個比例。

source: Animate your state changes
de: Statusänderungen animieren
es: Animar los cambios de estado
es_419: Usar animaciones para identificar cambios
fr: Animer les modifications d’état
it: Animare i cambiamenti di stato
nl: Een animatie maken van statuswijzigingen
no: Animer statusendringer
pt: Anime suas mudanças de estado
sv: Animera statusändringar
th: ทำให้การเปลี่ยนแปลงสถานะของคุณเคลื่อนไหว
tr: Durum değişikliklerini canlandırma
vi: Tạo hiệu ứng các thay đổi trạng thái của bạn
zh_cn: 给状态更改赋予动画效果
zh_tw: 以動畫呈現狀態更動

source: Just like SwiftUI knows how to update your views automatically, it also knows how to animate changes to your views based upon the values that you change.
de: SwiftUI weiß nicht nur, wie die Ansichten automatisch aktualisiert werden, sondern auch, wie Änderungen an den Ansichten auf Grundlage der von dir geänderten Werte animiert werden sollen.
es: Al igual que SwiftUI sabe cómo actualizar tus vistas automáticamente, también sabe cómo animar los cambios en tus vistas en función de los valores que cambies.
es_419: Del mismo modo que SwiftUI sabe cómo actualizar tus visualizaciones de forma automática, también sabe cómo animar los cambios en tus visualizaciones con base en los valores que tú cambias.
fr: Tout comme SwiftUI sait comment mettre à jour tes vues automatiquement, il sait également comment animer les modifications apportées à tes vues en fonction des valeurs que tu changes.
it: Nello stesso modo in cui SwiftUI sa come aggiornare le tue viste automaticamente, sa anche come animare i cambiamenti che applichi a esse, sulla base dei valori che modifichi.
nl: SwiftUI kan niet alleen je weergaven automatisch bijwerken, maar ook de wijzigingen van je weergaven in een animatie tonen op basis van de waarden die je wijzigt.
no: Akkurat som at SwiftUI vet hvordan det automatisk oppdaterer visningene dine, kan det også animere endringer av visningene basert på verdiene du endrer.
pt: Da mesma forma como a SwiftUI sabe atualizar suas visualizações automaticamente, ela também sabe animar mudanças nas suas visualizações com base nos valores que você muda.
sv: Precis som SwiftUI vet hur den automatiskt uppdaterar dina vyer kan den också animera vyerna baserat på de värden du ändrar.
th: เช่นเดียวกับที่ SwiftUI รู้วิธีอัปเดตมุมมองของคุณโดยอัตโนมัติ SwiftUI ยังรู้วิธีทำให้การเปลี่ยนแปลงไปยังมุมมองของคุณเคลื่อนไหวได้ตามค่าที่คุณเปลี่ยนแปลงอีกด้วย
tr: Tıpkı görüntülerini otomatik olarak güncellemeyi bildiği gibi, SwiftUI değiştirdiğin değerlere bağlı olarak görüntülerindeki değişikliklerini canlandırmayı da bilir.
vi: Giống như việc SwiftUI biết cách tự động cập nhật các chế độ xem của bạn, chương trình khung này cũng biết cách tạo hiệu ứng các thay đổi đối với chế độ xem của bạn dựa trên các giá trị mà bạn thay đổi.
zh_cn: 就像 SwiftUI 知道如何自动更新你的视图一样，它还知道如何根据你更改的值，给视图的更改赋予动画效果。
zh_tw: 就像 SwiftUI 知道如何自動更新你的顯示區一樣，它也知道如何根據你更改的值來對顯示區的更動呈現動畫。

source: To do this, attach a `.animation(_:value:)` modifier to the view you want to animate, and select an `Animation` as well as a value to monitor for changes.
de: Füge dafür den Modifikator `.animation(_:value:)` zu der Ansicht hinzu, die du animieren möchtest. Wähle dann eine `Animation` und einen Wert aus, der auf Änderungen überprüft werden soll.
es: Para ello, adjunta un modificador `.animation(_:value:)` a la vista que quieras animar, y selecciona una animación (`Animation`), así como un valor para controlar los cambios.
es_419: Para hacer esto, adjunta un modificador `.animation(_:value:)` a la visualización que quieres animar, y selecciona una propiedad `Animation` así como un valor para monitorear los cambios.
fr: Pour ce faire, ajoute un modificateur `.animation(_:value:)` à la vue que tu souhaites animer et sélectionne une `Animation` ainsi qu’une valeur dont les changements seront surveillés.
it: Per farlo, aggiungi il modificatore `.animation(_:value:)` alla vista che intendi animare e seleziona un `Animation` insieme a un valore da monitorare per eventuali modifiche.
nl: Je doet dit door de modifier `.animation(_:value:)` te koppelen aan de weergave waarvan je een animatie wilt maken. Vervolgens selecteer je een `Animation` en een waarde waarvan moet worden bijgehouden of die verandert.
no: Du gjør dette ved å legge ved en `.animation(_:value:)`-modifikator i visningen du vil animere, og velge en `Animation` samt en verdi der endringene skal overvåkes.
pt: Par fazer isso, anexe um modificador `.animation(_:value:)` à visualização que você deseja animar e selecione uma `Animation`, bem como um valor a ser monitorado quanto a mudanças.
sv: Du gör det genom att bifoga en `.animation(_:value:)`-modifierare i vyn som du vill animera och välja en `Animation` liksom ett värde vars ändringar ska övervakas.
th: ในการทำเช่นนี้ ให้ติดปุ่มปรับค่า `.animation(_:value:)` ไปยังมุมมองที่คุณต้องการทำให้เคลื่อนไหว แล้วเลือก `Animation` รวมถึงค่าที่จะตรวจสอบการเปลี่ยนแปลง
tr: Bunu yapmak için canlandırmak istediğin görüntüye bir `.animation(_:value:)` niteleyicisi iliştir ve değişiklikleri izlemek için bir değerin yanı sıra bir `Animation` seç.
vi: Để thực hiện việc này, hãy đính kèm một trình sửa đổi `.animation(_:value:)` vào chế độ xem mà bạn muốn tạo hiệu ứng và chọn một `Animation` cũng như một giá trị để theo dõi các thay đổi.
zh_cn: 若要这样做，将 `.animation(_:value:)`（动画值）修饰符附加到要赋予动画效果的视图中，然后选择 `Animation`（动画）和一个值来监测更改。
zh_tw: 為此，請將一個 `.animation(_:value:)` 修飾符附加到你要呈現動畫的顯示區，並選擇一個 `Animation`和值來監控更動。

source: For example, you can use a default animation to animate any changes to the `isOn` value.
de: Du kannst beispielsweise eine Standardanimation verwenden, um Änderungen des `isOn`-Werts zu animieren.
es: Por ejemplo, puedes usar una animación por omisión para animar cualquier cambio en el valor `isOn`.
es_419: Por ejemplo, puedes usar una animación predetarminada para animar cualquier cambio en el valor `isOn`.
fr: Par exemple, tu peux utiliser une animation par défaut pour animer toute modification de la valeur de `isOn`.
it: Ad esempio, puoi utilizzare un'animazione di default per animare tutti i cambiamenti del valore `isOn`.
nl: Je kunt bijvoorbeeld een standaardanimatie gebruiken om een animatie te maken van de wijzigingen in de waarde van `isOn`.
no: Du kan for eksempel bruke en standard animasjon til å animere alle endringer av `isOn`-verdien.
pt: Por exemplo, você pode usar uma animação padrão para animar qualquer mudança no valor de `isOn`.
sv: Du kan exempelvis använda en förvald animering till att animera alla förändringar av `isOn`-värdet.
th: ตัวอย่างเช่น คุณสามารถใช้ภาพเคลื่อนไหวเริ่มต้นเพื่อทำให้การเปลี่ยนแปลงไปยังค่า `isOn` เคลื่อนไหวได้
tr: Örneğin, `isOn` değerindeki tüm değişiklikleri canlandırmak için saptanmış bir canlandırma kullanabilirsin.
vi: Ví dụ: bạn có thể sử dụng một hiệu ứng chuyển động mặc định để tạo hiệu ứng cho bất kỳ thay đổi nào đối với giá trị `isOn`.
zh_cn: 例如，你可以使用默认动画，给 `isOn` 值的任何更改赋予动画效果。
zh_tw: 例如，你可以使用預設的動畫來以動畫呈現任何 `isOn` 值的更動。

source: When `isOn` changes, the view modifications controlled by this value will animate. Because you use `isOn` to determine the view’s shadow, color, and scale, all of those features will animate to their new state when the value changes.
de: Wenn sich `isOn` ändert, werden die Ansichtsänderungen, die von diesem Wert gesteuert werden, animiert. Da mit `isOn` Schatten, Farbe und Größe der Ansicht festgelegt werden, werden diese Eigenschaften bei Wertänderungen animiert.
es: Cuando `isOn` cambia, las modificaciones de la vista controlada por este valor se animarán. Dado que usas `isOn` para determinar el sombreado, el color y la escala de la vista, todas esas funciones se animarán a su nuevo estado cuando cambie el valor.
es_419: Cuando `isOn` cambie, se animarán las modificaciones de la visualización controladas por este valor. Dado que se usa `isOn` para determinar la sombra, el color y la escala de la visualización, todas esas características se animarán para indicar su nuevo estado cuando el valor cambie.
fr: Lorsque `isOn` change, les modifications de la vue contrôlées par cette valeur s’animent. Puisque tu utilises `isOn` pour déterminer l’ombre, la couleur et l’échelle de la vue, toutes ces caractéristiques s’animent pour atteindre leur nouvel état lorsque la valeur change.
it: Quando `isOn` cambia, le modifiche della vista che dipendono dal suo valore vengono animate. Poiché `isOn` è utilizzato per determinare l'ombra, il colore e la scala della vista, quando il valore cambia tutti questi parametri verranno animati per passare al loro nuovo stato.
nl: Wanneer `isOn` verandert, wordt een animatie gemaakt van de wijzigingen in de weergave die door deze waarde worden bepaald. Omdat je `isOn` gebruikt om de schaduw, kleur en grootte van de weergave te bepalen, wordt een animatie gemaakt van hoe deze functies veranderen als de waarde wordt gewijzigd.
no: Når `isOn` endres, animeres visningsendringene som styres av denne verdien. Siden du bruker `isOn` til å bestemme visningens skygge, farge og skala, kommer alle disse egenskapene til å animeres til sine nye statuser når verdien endres.
pt: Quando `isOn` mudar, as modificações de visualização controladas por esse valor serão animadas. Como você usa `isOn` para determinar a sombra, cor e escala da visualização, todas essas características serão animadas para o novo estado quando o valor mudar.
sv: När `isOn` ändras animeras de vyändringar som styrs av detta värde. Eftersom du använder `isOn` till att avgöra vyns skugga, färg och skala kommer alla de egenskaperna att animeras till sina nya statusar när värdet ändras.
th: เมื่อ `isOn` เปลี่ยนแปลงไป การแก้ไขมุมมองที่ควบคุมโดยค่านี้จะเคลื่อนไหว เนื่องจากคุณใช้ `isOn` เพื่อกำหนดเงา สี และขนาดของมุมมอง คุณสมบัติทั้งหมดเหล่านั้นจะเคลื่อนไหวไปเป็นสถานะใหม่เมื่อค่าเปลี่ยนแปลง
tr: `isOn` değiştiğinde bu değer tarafından denetlenen görüntü değişiklikleri canlandırılacaktır. Görüntünün gölgesini, rengini ve ölçeğini belirlemek için `isOn` kullandığından değer değiştiğinde bu özelliklerin tamamı yeni durumlarına canlandırılır.
vi: Khi `isOn` thay đổi, các sửa đổi chế độ xem được điều khiển bởi giá trị này sẽ tạo hiệu ứng. Vì bạn sử dụng `isOn` để xác định bóng đổ, màu và tỷ lệ của chế độ xem nên tất cả những đặc điểm này sẽ tạo hiệu ứng đến trạng thái mới khi giá trị thay đổi.
zh_cn: 当 `isOn` 更改时，由这个值控制的视图修改内容会具有动画效果。由于你使用 `isOn` 来确定视图的阴影、颜色和比例，所有这些特征都会在值更改时给新状态赋予动画效果。
zh_tw: 當 `isOn` 改變時，由這個值控制的顯示區修改將會以動畫呈現。因為你使用 `isOn` 來決定顯示區的陰影、顏色和比例，所以當值發生變化時，所有這些功能都會以動畫呈現它們的新狀態。

source: Try changing the default animation to something different. `.default` gives you the animation `.easeInOut`, but you can change it to `.spring(response:dampingFraction:blendDuration:)` or `.linear(duration:)` to see how the animation changes.
de: Versuche, eine andere Animation als die Standardanimation festzulegen. `.default` stellt dir die Animation `.easeInOut` bereit, aber du kannst sie in `.spring(response:dampingFraction:blendDuration:)` oder `.linear(duration:)` ändern und dir ansehen, wie sich die Animation ändert.
es: Prueba a cambiar la animación por omisión por otra diferente. `.default` te proporciona la animación `.easeInOut`, pero puedes cambiarla por `.spring(response:dampingFraction:blendDuration:)` o `.linear(duration:)` para ver cómo cambia la animación.
es_419: Intenta cambiar la animación predeterminada a otra. El valor `.default` usa la animación `.easeInOut`, pero puedes cambiarlo a `.spring(response:dampingFraction:blendDuration:)` o a `.linear(duration:)` para averiguar cómo la animación cambia.
fr: Essaie de remplacer l’animation par défaut par autre chose. `.default` te donne l’animation `.easeInOut`, mais tu peux la remplacer par `.spring(response:dampingFraction:blendDuration:)` ou `.linear(duration:)` pour voir comment l’animation change.
it: Prova a modificare l'animazione di default cambiando i valori. `.default` restituisce il tipo di animazione `.easeInOut` ma puoi modificarlo con `.spring(response:dampingFraction:blendDuration:)` o `.linear(duration:)` per vedere come cambia l'animazione.
nl: Probeer de standaardanimatie in iets anders te veranderen. `.default` geeft je de animatie `.easeInOut`, maar je kunt deze veranderen in `.spring(response:dampingFraction:blendDuration:)` of `.linear(duration:)` om te zien wat dit met de animatie doet.
no: Prøv å endre standardanimasjonen til noe annet. `.default` gir deg animasjonen `.easeInOut`, men du kan endre den til `.spring(response:dampingFraction:blendDuration:)` eller `.linear(duration:)` for å se hvordan animasjonen endres.
pt: Tente mudar a animação padrão para algo diferente. `.default` lhe dá a animação `.easeInOut`, mas você pode mudá-la para `.spring(response:dampingFraction:blendDuration:)` ou `.linear(duration:)` para ver como a animação se altera.
sv: Prova att ändra den förvalda animeringen till något annat. `.default` ger dig animeringen `.easeInOut`, men du kan ändra den till `.spring(response:dampingFraction:blendDuration:)` eller `.linear(duration:)` för att se hur animeringen förändras.
th: ลองเปลี่ยนภาพเคลื่อนไหวเริ่มต้นเป็นอย่างอื่น `.default` จะให้ภาพเคลื่อนไหว `.easeInOut` แต่คุณสามารถเปลี่ยนเป็น `.spring(response:dampingFraction:blendDuration:)` หรือ `.linear(duration:)` เพื่อดูว่าภาพเคลื่อนไหวเปลี่ยนไปอย่างไรได้
tr: Saptanmış canlandırmayı farklı bir şeyle değiştirmeyi dene . `.default` sana `.easeInOut` canlandırmasını verir, ancak canlandırmanın nasıl değişeceğini görmek için bunu `.spring(response:dampingFraction:blendDuration:)` veya `.linear(duration:)` ile değiştirebilirsin.
vi: Thử thay đổi hiệu ứng chuyển động mặc định thành hiệu ứng nào đó khác. `.default` cung cấp cho bạn hiệu ứng chuyển động `.easeInOut`, nhưng bạn có thể thay đổi thành `.spring(response:dampingFraction:blendDuration:)` hoặc `.linear(duration:)` để xem hiệu ứng chuyển động thay đổi như thế nào.
zh_cn: 尝试将默认动画更改为不同的动画。`.default`（默认）提供了 `.easeInOut`（缓慢移入移出）动画，但你可以将它更改为 `.spring(response:dampingFraction:blendDuration:)` 或 `.linear(duration:)`，看看动画会如何变化。
zh_tw: 嘗試將預設動畫更改為不同的動畫。`.default` 會為你提供動畫 `.easeInOut`，但你可以將它更改為 `.spring(response:dampingFraction:blendDuration:)` 或 `.linear(duration:)` 來看看動畫如何變化。

# GuideBook..Guide0..StepUsing a Conditional Modifier..SuccessMessage..Paragraph62
source: Excellent work!
de: Gut gemacht!
es: ¡Buen trabajo!
es_419: ¡Excelente trabajo!
fr: Excellent travail !
it: Ottimo lavoro!
nl: Goed gedaan!
no: Bra jobbet!
pt: Excelente trabalho!
sv: Strålande!
th: เจ๋งมาก!
tr: Harika iş!
vi: Bạn thật xuất sắc!
zh_cn: 做得不错！
zh_tw: 做得好！

# GuideBook..Guide0..StepUsing a Conditional Modifier..SuccessMessage..Paragraph63
source: You now know how to use a [state property](glossary://state%20property) to change the appearance of a view, and how to animate those changes using the `.animation(_:value:)` modifier.
de: Du weißt, wie du mit einer [Statuseigenschaft](glossary://state%20property) das Erscheinungsbild einer Ansicht änderst und wie du diese Änderungen mit dem Modifikator `.animation(_:value:)` animierst.
es: Ahora ya sabes cómo usar una [propiedad de estado](glossary://state%20property) para cambiar la apariencia de una vista, y cómo animar esos cambios usando el modificador `.animation(_:value:)`.
es_419: Ahora sabes cómo usar una [propiedad de estado](glossary://state%20property) para cambiar el aspecto de una visualización, y cómo animar estos cambios utilizando el modificador `.animation(_:value:)`.
fr: Tu sais comment utiliser une [propriété d’état](glossary://state%20property) pour changer l’apparence d’une vue et comment animer ces changements à l’aide du modificateur `.animation(_:value:)`.
it: Ora sai come utilizzare una [proprietà di stato](glossary://state%20property) per modificare l'aspetto di una vista e come animare le modifiche utilizzando il modificatore `.animation(_:value:)`.
nl: Je weet nu hoe je een [statuseigenschap](glossary://state%20property) gebruikt om het uiterlijk van een weergave te wijzigen en hoe je een animatie van die wijzigingen maakt met de modifier `.animation(_:value:)`.
no: Nå vet du hvordan du bruker en [statusegenskap](glossary://state%20property) til å endre utseendet på en visning, og hvordan du animerer disse endringene med modifikatoren `.animation(_:value:)`.
pt: Agora você sabe usar uma [propriedade de estado](glossary://state%20property) para mudar a aparência de uma visualização e como animar essas mudanças usando o modificador `.animation(_:value:)`.
sv: Nu vet du hur du använder en [statusegenskap](glossary://state%20property) till att ändra utseendet på en vy och hur du animerar de ändringarna med modifieraren `.animation(_:value:)`.
th: ตอนนี้คุณรู้วิธีใช้[คุณสมบัติสถานะ](glossary://state%20property)เพื่อเปลี่ยนรูปแบบของมุมมองและวิธีทำให้การเปลี่ยนแปลงเหล่านั้นเคลื่อนไหวได้โดยใช้ปุ่มปรับค่า `.animation(_:value:)` แล้ว
tr: Bir görüntünün görünüşünü değiştirmek için [durum özelliğini](glossary://state%20property) nasıl kullanacağını ve bu değişiklikleri `.animation(_:value:)` niteleyicisini kullanarak nasıl canlandıracağını artık biliyorsun.
vi: Bây giờ bạn đã biết cách sử dụng [thuộc tính trạng thái](glossary://state%20property) để thay đổi giao diện của một chế độ xem và cách tạo hiệu ứng cho những thay đổi đó bằng trình sửa đổi `.animation(_:value:)`.
zh_cn: 现在你知道了如何使用[状态属性](glossary://state%20property)更改视图的外观，以及如何使用 `.animation(_:value:)` 修饰符给这些更改赋予动画效果。
zh_tw: 現在你知道了如何使用[狀態屬性](glossary://state%20property)來更改顯示區的外觀，以及如何使用 `.animation(_:value:)` 修飾符來以動畫呈現這些更動。
