Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: When a class publishes a property, the property broadcasts (publishes) its state changes to any [observers](glossary://observer) that might be watching. This allows [observing](glossary://observer) views to update when the state of a published property changes.
de: Wenn eine Klasse eine Eigenschaft veröffentlicht, übermittelt die Eigenschaft ihre Statusänderungen an alle [Beobachter](glossary://observer), die auf solche Änderungen achten. Dadurch können Ansichten [beobachtet](glossary://observer) und aktualisiert werden, wenn sich der Status einer veröffentlichten Eigenschaft ändert.
es: Cuando una clase publica una propiedad, la propiedad difunde (publica) sus cambios de estado a cualquier [observador](glossary://observer) que pueda estar observando. Esto permite que las vistas que [observan](glossary://observer) se actualicen cuando cambia el estado de una propiedad publicada.
es_419: Cuando una clase publica una propiedad, esta transmite o “publica” sus cambios de estado a cualquier [observador](glossary://observer) que exista. Esto permite que las visualizaciones que están [observando](glossary://observer) se actualicen cuando haya un cambio en el estado de una propiedad publicada.
fr: Lorsqu’une classe publie une propriété, cette dernière diffuse (publie) ses modifications d’état pour tout [observateur](glossary://observer) qui pourrait la surveiller. Cela permet aux vues [observatrices](glossary://observer) de se mettre à jour lorsque l’état d’une propriété publiée change.
it: Quando una classe pubblica una proprietà, quest'ultima trasmette (pubblica) i suoi cambiamenti di stato a tutti gli [osservatori](glossary://observer) che potrebbero controllare. Questo consentirà alle viste che [osservano](glossary://observer) di aggiornarsi ogni volta che lo stato di una proprietà pubblicata cambia.
nl: Als een klasse een eigenschap publiceert, maakt deze eigenschap dit bekend aan alle [observers](glossary://observer) die de eigenschap observeren. Zo kunnen weergaven die de gepubliceerde eigenschap [observeren](glossary://observer) zichzelf bijwerken wanneer de status van de eigenschap wijzigt.
no: Når en klasse publiserer en egenskap, sender egenskapen ut (publiserer) statusendringene sine til alle [observatører](glossary://observer) som kanskje følger med. Dette innebærer at [observerende](glossary://observer) visninger kan oppdateres når statusen for en publisert egenskap endres.
pt: Quando uma classe publica uma propriedade, a propriedade transmite (publica) suas alterações de estado para todos os [observadores](glossary://observer) que possam estar vendo. Isso permite que as visualizações que estejam [observando](glossary://observer) atualizem quando o estado de uma propriedade publicada muda.
sv: När en klass publicerar en egenskap sänder egenskapen ut (publicerar) sina statusändringar till alla [observatörer](glossary://observer) som kanske håller koll. Det innebär att [observerande](glossary://observer) vyer kan uppdateras när statusen för en publicerad egenskap ändras.
th: เมื่อคลาสเผยแพร่คุณสมบัติ คุณสมบัติจะถ่ายทอด (เผยแพร่) การเปลี่ยนแปลงสถานะของตัวเองให้[ตัวสังเกตการณ์](glossary://observer)ใดๆ ที่อาจกำลังดูอยู่ได้ทราบ การทำเช่นนี้ช่วยให้มุมมอง[ที่สังเกตอยู่](glossary://observer)อัปเดตได้เมื่อสถานะของคุณสมบัติที่เผยแพร่เปลี่ยนแปลงไป
tr: Sınıf bir özellik yayımladığında özellik, durum değişikliklerini izliyor olabilecek tüm [gözlemcilere](glossary://observer) yayın yapar (yayımlar). Bu, yayımlanan bir özelliğin durumu değiştiğinde [gözlemleyen](glossary://observer) görüntülerin güncellenmesini sağlar.
vi: Khi một lớp đăng một thuộc tính, thuộc tính đó phát (đăng) các thay đổi trạng thái của mình đến bất kỳ [trình quan sát](glossary://observer) nào có thể đang theo dõi. Việc này cho phép các chế độ xem [đang quan sát](glossary://observer) cập nhật khi trạng thái của một thuộc tính đã đăng thay đổi.
zh_cn: 当类发布属性时，属性会向可能正在观测的[观测器](glossary://observer)广播（发布）它的状态更改。这可让[观测](glossary://observer)视图在已发布属性的状态发生更改时更新。
zh_tw: 當類別發佈屬性時，屬性會將其狀態的更動廣播（發佈）至任何可能正在監視的[觀測器](glossary://observer)。這可讓[觀察](glossary://observer)顯示區在已發佈的屬性狀態更動時進行更新。

source: The [published data](glossary://published%20value) in `CreatureZoo` is the `creatures` property — an array of `Creature` instances. Any time the data in this array changes, such as when a creature is added or removed, SwiftUI notifies all of the property [observers](glossary://observer) so they can update to show the latest data.
de: Bei den [veröffentlichten Daten](glossary://published%20value) in `CreatureZoo` handelt es sich um die `creatures`-Eigenschaft — einem Array mit `Creature`-Instanzen. Jedes Mal, wenn sich die Daten in diesem Array ändern, z. B. wenn ein Charakter hinzugefügt oder gelöscht wird, benachrichtigt SwiftUI alle [Beobachter](glossary://observer) der Eigenschaft, damit sie aktualisierst werden und die aktuellen Daten anzeigen können.
es: Los [datos publicados](glossary://published%20value) en `CreatureZoo` es la propiedad `creatures`: un vector de instancias `Creature`. Cada vez que los datos de este vector cambian, como cuando se añade o se elimina una criatura, SwiftUI notifica a todos los [observadores](glossary://observer) de la propiedad para que puedan actualizarse y mostrar los datos más recientes.
es_419: Los [datos publicados](glossary://published%20value) en `CreatureZoo` son la propiedad `creatures` (un arreglo de instancias de `Creature`). Cada vez que cambien los datos de este arreglo, como cuando se agrega o elimina una criatura, SwiftUI notifica a todos los [observadores](glossary://observer) de la propiedad para que se actualicen y muestren los datos más recientes.
fr: Les [données publiées](glossary://published%20value) dans `CreatureZoo` constituent la propriété `creatures`, un tableau des instances de `Creature`. Dès que les données de ce tableau changent, par exemple lorsqu’une créature est ajoutée ou supprimée, SwiftUI avertit tous les [observateurs](glossary://observer) de la propriété pour qu’ils puissent se mettre à jour et afficher les dernières données.
it: I [dati pubblicati](glossary://published%20value) in `CreatureZoo` corrispondono alla proprietà `creatures`: un array di istanze `Creature`. Ogni volta che i dati contenuti nell'array cambiano, ad esempio, quando una creatura viene aggiunta o rimossa, SwiftUI invia una notifica a tutti gli [osservatori](glossary://observer) della proprietà, in modo che possano aggiornarsi per mostrare i dati più recenti.
nl: De [gepubliceerde gegevens](glossary://published%20value) in `CreatureZoo` bevinden zich in de eigenschap `creatures`. Dit is een array met instanties van `Creature`. Wanneer de gegevens in deze array wijzigen, bijvoorbeeld wanneer een wezen wordt toegevoegd of verwijderd, brengt SwiftUI alle [observers](glossary://observer) van de eigenschap hiervan op de hoogte zodat ze zichzelf kunnen bijwerken om de nieuwste gegevens te tonen.
no: [Publiserte data](glossary://published%20value) i `CreatureZoo` er egenskapen `creatures`, som er en matrise med instanser av `Creature`. Hver gang dataene i denne matrisen endres, for eksempel når en skapning legges til eller fjernes, varsler SwiftUI alle egenskapenes [observatører](glossary://observer), slik at de kan oppdatere og vise de nyeste dataene.
pt: O [dado publicado](glossary://published%20value) em `CreatureZoo` é a propriedade `creatures` — um vetor de instâncias de `Creature`. Sempre que os dados nesse vetor mudam, como ao adicionar ou remover uma criatura, a SwiftUI notifica todos os [observadores](glossary://observer) da propriedade, para que eles possam se atualizar para mostrar os dados mais recentes.
sv: [Publicerade data](glossary://published%20value) i `CreatureZoo` är egenskapen `creatures` som är en array med instanser av `Creature`. Varje gång som data i den här arrayen ändras, som när en varelse läggs till eller tas bort, meddelar SwiftUI alla egenskapens [observatörer](glossary://observer) så att de kan uppdatera och visa senaste data.
th: [ข้อมูลที่เผยแพร่](glossary://published%20value)ใน `CreatureZoo` คือคุณสมบัติ `creatures` ซึ่งเป็นอาร์เรย์ของชื่อแทนประเภท `Creature` เมื่อใดก็ตามที่ข้อมูลในอาร์เรย์นี้เปลี่ยนแปลงไป เช่น เมื่อมีการเพิ่มหรือเอาสิ่งมีชีวิตออก SwiftUI จะแจ้งเตือน[ตัวสังเกตการณ์](glossary://observer)คุณสมบัติทั้งหมดเพื่อให้ตัวสังเกตการณ์เหล่านั้นอัปเดตเพื่อแสดงข้อมูลล่าสุด
tr: `CreatureZoo`’da [yayımlanan veri](glossary://published%20value) `Creature` örneklerinin bir dizisi olan `creatures` özelliğidir. Bu dizideki veriler her değiştiğinde (örneğin bir yaratık eklendiğinde veya silindiğinde) SwiftUI, özellik [gözlemcilerinin](glossary://observer) hepsini bilgilendirir, böylece gözlemciler en son verileri gösterecek şekilde güncelleyebilir.
vi: [Dữ liệu đã đăng](glossary://published%20value) trong `CreatureZoo` là thuộc tính `creatures` — một dãy các thể hiện `Creature`. Bất kỳ lúc nào dữ liệu trong dãy này thay đổi, ví dụ như khi một sinh vật được thêm hoặc xóa, SwiftUI thông báo cho tất cả các [trình quan sát](glossary://observer) thuộc tính để chúng có thể cập nhật để hiển thị dữ liệu mới nhất.
zh_cn: `CreatureZoo` 中[已发布的数据](glossary://published%20value)是 `creatures`（动物）属性，即 `Creature`（动物）实例的数组。只要这个数组中的数据发生更改，如添加或移除动物，SwiftUI 就会通知所有的属性[观测器](glossary://observer)，以便它们可以更新以显示最新数据。
zh_tw: `CreatureZoo` 中[發佈的資料](glossary://published%20value)是 `creatures` 屬性，一個 `Creature` 實例的陣列。每當此陣列中的資料改變時（例如加入或刪除生物），SwiftUI 會通知所有屬性[觀測器](glossary://observer)，以便它們可以更新來顯示最新的資料。

source: In an observable object, you add the `@Published` [property wrapper](glossary://property%20wrapper) to mark a property as [published](glossary://published%20value).
de: Füge in einem beobachtbaren Objekt den [Eigenschaftswrapper](glossary://property%20wrapper) `@Published` hinzu, um eine Eigenschaft als [veröffentlicht](glossary://published%20value) zu markieren.
es: En un objeto observable, hay que añadir el [contenedor de propiedades](glossary://property%20wrapper) `@Published` para marcar una propiedad como [publicada](glossary://published%20value).
es_419: En un objeto observable, agrega el [contenedor de propiedades](glossary://property%20wrapper) `@Published` para marcar una propiedad como [publicada](glossary://published%20value).
fr: Dans un objet observable, tu ajoutes le [wrapper de propriété](glossary://property%20wrapper) `@Published` pour marquer une propriété comme [publiée](glossary://published%20value).
it: In un oggetto osservabile, aggiungi il [wrapper di proprietà](glossary://property%20wrapper) `@Published` per contrassegnare una proprietà come [pubblicata](glossary://published%20value).
nl: In een observeerbaar object voeg je de [eigenschapwrapper](glossary://property%20wrapper) `@Published` toe om een eigenschap als [gepubliceerd](glossary://published%20value) te markeren.
no: Du merker en egenskap som [publisert](glossary://published%20value) ved å legge til [egenskapsinnpakningen](glossary://property%20wrapper) `@Published` i et observerbart objekt.
pt: Em um objeto observável, você adiciona o [empacotador de propriedade](glossary://property%20wrapper) `@Published` para marcar uma propriedade como [publicada](glossary://published%20value).
sv: Du märker en egenskap som [publicerad](glossary://published%20value) genom att lägga till [egenskapspaketeraren](glossary://property%20wrapper) `@Published` i ett observerbart objekt.
th: ในวัตถุที่สังเกตเห็นได้ คุณจะเพิ่ม[ตัวหุ้มคุณสมบัติ](glossary://property%20wrapper) `@Published` เพื่อทำเครื่องหมายคุณสมบัติว่า[เผยแพร่แล้ว](glossary://published%20value)
tr: Gözlemlenebilir bir nesnede, bir özelliği [yayımlanmış](glossary://published%20value) olarak işaretlemek için `@Published` [özellik sarmalayıcısını](glossary://property%20wrapper) ekle.
vi: Trong một đối tượng có thể quan sát, bạn thêm [trình đóng gói thuộc tính](glossary://property%20wrapper) `@Published` để đánh dấu một thuộc tính là [đã đăng](glossary://published%20value).
zh_cn: 在可观测对象中，你可以添加 `@Published` [属性包装器](glossary://property%20wrapper)，以将属性标记为[已发布](glossary://published%20value)。
zh_tw: 在可觀察的物件中，你可以加入 `@Published` [屬性包覆](glossary://property%20wrapper)來將屬性標記為[已發佈](glossary://published%20value)。

source: To create a creature instance, use the initializer `Creature(name:emoji:)` and pass in a name, as well as a single emoji character.
de: Verwende zum Erstellen einer Charakterinstanz die Initialisierung `Creature(name:emoji:)` und übergib einen Namen und ein Emoji.
es: Para crear una instancia de criatura, usa el inicializador `Creature(name:emoji:)` y pasa un nombre, así como un único emoji.
es_419: Para crear una instancia de una criatura, usa el inicializador `Creature(name:emoji:)` y enseguida pasa un nombre y un solo personaje de emoji.
fr: Pour créer une instance de créature, utilise l’initialiseur `Creature(name:emoji:)` et transmets un nom, ainsi qu’un Emoji unique.
it: Per creare l'istanza di una creatura, utilizza l'inizializzatore `Creature(name:emoji:)` e fornisci un nome e un carattere emoji.
nl: Om een instantie van `creatures` aan te maken, gebruik je de initializer `Creature(name:emoji:)` en geef je daar een naam en een afzonderlijk emojiteken aan door.
no: Opprett en skapningsinstans ved å bruke initialisereren `Creature(name:emoji:)`, og overfør et navn og ett emojitegn.
pt: Para criar uma instância de criatura, use o inicializador `Creature(name:emoji:)` e passe um nome, bem como um único caractere de emoji.
sv: Skapa en varelseinstans genom att använda initieraren `Creature(name:emoji:)` och överföra ett namn och ett enda emojitecken.
th: ในการสร้างชื่อแทนประเภทสิ่งมีชีวิต ให้ใช้ตัวเริ่มต้น `Creature(name:emoji:)` แล้วส่งผ่านชื่อและอักขระอิโมจิตัวเดียว
tr: Bir yaratık örneği yaratmak için `Creature(name:emoji:)` ilk değer atayıcısını kullan ve bir ad ile tek bir emoji karakteri geçir.
vi: Để tạo ra một thể hiện sinh vật, hãy sử dụng trình khởi tạo `Creature(name:emoji:)` và chuyển vào một tên, cũng như một ký tự biểu tượng đơn nhất.
zh_cn: 若要创建动物实例，使用构建器 `Creature(name:emoji:)`（动物名称和表情符号）并传入名称，以及单个表情符号角色。
zh_tw: 若要建立一個生物實例，請使用初始化程式 `Creature(name:emoji:)` 並傳入一個名稱以及單一的表情符號字元。

source: This is the `Creature` type, which contains [properties](glossary://property) for `name`, `emoji`, `offset`, `rotation`, and `id`.
de: Das ist der `Creature`-Typ, der [Eigenschaften](glossary://property) für `name`, `emoji`, `offset`, `rotation` und `id` enthält.
es: Este es el tipo `Creature`, que contiene [propiedades](glossary://property) para `name`, `emoji`, `offset`, `rotation` e `id`.
es_419: Este es el tipo `Creature`, que contiene [propiedades](glossary://property) para `name`, `emoji`, `offset`, `id` y `rotation`.
fr: Il s’agit du type `Creature`, qui contient des [propriétés](glossary://property) pour `name`, `emoji`, `offset`, `rotation` et `id`.
it: Questo è il tipo `Creature` che contiene le [proprietà](glossary://property) per `name`, `emoji`, `offset`, `rotation` e `id`.
nl: Dit is het type `Creature` dat [eigenschappen](glossary://property) bevat voor `name`, `emoji`, `offset`, `rotation` en `id`.
no: Dette er typen `Creature`, som inneholder [egenskaper](glossary://property) for `name`, `emoji`, `offset`, `rotation` og `id`.
pt: Esse é o tipo `Creature`, que contém as [propriedades](glossary://property) `name`, `emoji`, `offset`, `rotation` e `id`.
sv: Det här är typen `Creature` som innehåller [egenskaper](glossary://property) för `name`, `emoji`, `offset`, `rotation` och `id`.
th: นี่คือประเภท `Creature` ที่มี[คุณสมบัติ](glossary://property)สำหรับ `name`, `emoji`, `offset`, `rotation` และ `id`
tr: Bu, `name`, `emoji`, `offset`, `rotation` ve `id` [özelliklerini](glossary://property) içeren `Creature` tipidir.
vi: Đây là kiểu `Creature`, chứa các [thuộc tính](glossary://property) cho `name`, `emoji`, `offset`, `rotation` và `id`.
zh_cn: 这是 `Creature` 类型，它包含了 `name`（名称）、`emoji`（表情符号）、`offset`（偏移）、`rotation`（旋转）和 `id`（标识符）的[属性](glossary://property)。
zh_tw: 這是 `Creature` 類型，其中包含 `name`、`emoji`、`offset`、`rotation` 和 `id` 的[屬性](glossary://property)。

source: `Creature` follows the guidelines for the `Identifiable` [protocol](glossary://protocol) by adding an `id` property. This protocol allows SwiftUI to uniquely identify any `Creature`, even if two creatures use exactly the same emoji. This comes in handy later.
de: `Creature` folgt den Richtlinien für das `Identifiable`-[Protokoll](glossary://protocol), indem die Eigenschaft `id` hinzugefügt wird. Dieses Protokoll erlaubt es SwiftUI, jeden mit `Creature` erstellten Charakter eindeutig zu identifizieren, selbst wenn zwei Charaktere dasselbe Emoji verwenden. Das ist später noch sehr nützlich.
es: `Creature` sigue el conjunto de pautas del [protocolo](glossary://protocol) `Identifiable` añadiendo una propiedad `id`. Este protocolo permite a SwiftUI identificar de forma exclusiva cualquier criatura (`Creature`), incluso si hay dos criaturas que utilizan exactamente el mismo emoji. Esto resultará muy útil más adelante.
es_419: Al agregar una propiedad `id`, el tipo `Creature` sigue los lineamientos del [protocolo](glossary://protocol) `Identifiable`, el cual permite a SwiftUI identificar cualquier `Creature`, incluso si dos criaturas usan el mismo emoji. Esto te será útil posteriormente.
fr: `Creature` suit les consignes pour le [protocole](glossary://protocol) `Identifiable` en ajoutant une propriété `id`. Ce protocole permet à SwiftUI d’identifier de manière unique toute `Creature`, même si deux créatures utilisent exactement le même Emoji. Cela s’avère utile plus tard.
it: `Creature` segue le linee guida del [protocollo](glossary://protocol) `Identifiable`, poiché aggiunge una proprietà `id`. Il protocollo consente a SwiftUI di identificare in modo univoco ciascuna `Creature`, anche se due creature usano la stessa emoji. Questo ti sarà utile in seguito.
nl: `Creature` voldoet aan de richtlijnen voor het [protocol](glossary://protocol) `Identifiable` door een `id`-eigenschap toe te voegen. Met dit protocol kan SwiftUI elk `Creature` identificeren, zelfs als twee wezens exact dezelfde emoji gebruiken. Dit komt later nog van pas.
no: `Creature` følger retningslinjene for [protokollen](glossary://protocol) `Identifiable` ved å legge til en `id`-egenskap. Med denne protokollen kan SwiftUI unikt identifisere hver eneste `Creature`, selv om to skapninger bruker nøyaktig samme emoji. Dette vil komme til nytte senere.
pt: `Creature` segue as orientações do [protocolo](glossary://protocol) `Identifiable` ao adicionar uma propriedade `id`. Esse protocolo permite que a SwiftUI identifique de maneira exclusiva qualquer `Creature`, mesmo se duas criaturas usarem o mesmo emoji. Isso será muito útil futuramente.
sv: `Creature` följer riktlinjerna för [protokollet](glossary://protocol) `Identifiable` genom att lägga till en `id`-egenskap. Med det här protokollet kan SwiftUI unikt identifiera varenda `Creature`, även om två varelser använder exakt likadana emojier. Det här blir användbart senare.
th: `Creature` ทำตามแนวทางสำหรับ[โปรโตคอล](glossary://protocol) `Identifiable` โดยเพิ่มคุณสมบัติ `id` โปรโตคอลนี้ทำให้ SwiftUI สามารถระบุ `Creature` ใดๆ ได้อย่างไม่ซ้ำกัน แม้ว่าสิ่งมีชีวิตสองตัวจะใช้อิโมจิตัวเดียวกันทุกประการ สิ่งนี้จะมีประโยชน์ในภายหลัง
tr: `Creature` bir `id` özelliği ekleyerek `Identifiable` [protokolüne](glossary://protocol) yönelik kurallara uyar. Bu protokol, SwiftUI’ın iki yaratık tamamen aynı emojiyi kullansa bile herhangi bir yaratığın (`Creature`) kimliğini benzersiz bir şekilde belirlemesine olanak tanır. Bu daha sonra işe yarar.
vi: `Creature` tuân theo các hướng dẫn cho [giao thức](glossary://protocol) `Identifiable` bằng cách thêm một thuộc tính `id`. Giao thức này cho phép SwiftUI xác định duy nhất bất kỳ `Creature` nào, ngay cả khi hai sinh vật sử dụng cùng một biểu tượng giống hệt nhau. Việc này sẽ có ích sau này.
zh_cn: 通过添加 `id` 属性，`Creature` 遵循 `Identifiable`（可识别）[协议](glossary://protocol)的规则。这个协议可让 SwiftUI 唯一识别 `Creature`，即使两个动物使用完全相同的表情符号。这种做法在之后会派上用场。
zh_tw: `Creature` 依循 `Identifiable` [協定](glossary://protocol)的準則，加入了 `id` 屬性。此協定能讓 SwiftUI 唯一地識別任何 `Creature`，即使兩個生物使用完全相同的表情符號。這會在以後派上用場。

# GuideBook..Guide0..StepSharing Data Between Views..TaskaddCreatures..title
source: Add more creatures
de: Mehr Charaktere hinzufügen
es: Añadir más criaturas
es_419: Agregar más criaturas
fr: Ajouter d’autres créatures
it: Aggiungere altre creature
nl: Meer wezens toevoegen
no: Legg til flere skapninger
pt: Adicione mais criaturas
sv: Lägg till fler varelser
th: เพิ่มสิ่งมีชีวิตเพิ่มเติม
tr: Daha fazla yaratık ekleme
vi: Thêm các sinh vật khác
zh_cn: 添加更多动物
zh_tw: 加入更多生物

source: Add at least two new `Creature` instances to the `creatures` array.
de: Füge mindestens zwei neue `Creature`-Instanzen zum `creatures`-Array hinzu.
es: Añade al menos dos nuevas instancias de `Creature` al vector `creatures`.
es_419: Agrega al menos dos instancias de `"Creature"` nuevas al arreglo `"creatures"`.
fr: Ajoute au moins deux nouvelles instances de `Creature` au tableau `creatures`.
it: Aggiungi almeno due nuove istanze `Creature` all'array di `creatures`.
nl: Voeg minimaal twee nieuwe instanties van `Creature` aan de array `creatures` toe.
no: Legg til minst to nye `Creature`-instanser i matrisen `creatures.
pt: Adicione ao menos duas instâncias `Creature` novas ao vetor `creatures`.
sv: Lägg till minst två nya instanser av `Creature` i arrayen `creatures`.
th: เพิ่มชื่อแทนประเภท `Creature` อย่างน้อยสองรายการใหม่ไปยังอาร์เรย์ `creatures`
tr: `creatures` dizinine en az iki yeni `Creature` örneği ekle.
vi: Thêm ít nhất hai thể hiện `Creature` mới vào dãy `creatures`.
zh_cn: 将至少两个新的 `Creature` 实例添加到 `creatures` 数组。
zh_tw: 在 `creatures` 陣列中加入最少 2 個新的 `Creature` 實例。
