Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Attach the `.animation(_:value:)` modifier to the `Text` view. Choose `.default` for the animation argument, and for the value, pass in `creature.offset`. Any time the `offset` changes, the view changes are animated.
de: Füge den Modifikator `.animation(_:value:)` an die Ansicht `Text` an. Wähle für das Animationsargument `.default` (Standard) und übergib für den Wert `creature.offset`. Jedes Mal, wenn sich `offset` ändert, werden die Änderungen an der Ansicht animiert.
es: Adjunta el modificador `.animation(_:value:)` a la vista `Text`. Selecciona `.default` para el argumento de la animación y, para el valor, pasa `creature.offset`. Cada vez que cambie el desplazamiento (`offset`), se animan los cambios a la vista.
es_419: Agrega el modificador `.animation(_:value:)` a la visualización `Text`. Elige el argumento `.default` para la animación, y pasa `creature.offset` como el valor. Cada vez que `offset` cambie, se animarán los cambios en la visualización.
fr: Joins le modificateur `.animation(_:value:)` à la vue `Text`. Choisis `.default` pour l’argument d’animation et transmets `creature.offset` pour la valeur. Chaque fois que le `offset` change, les modifications de la vue sont animées.
it: Aggiungi il modificatore `.animation(_:value:)` alla vista `Text`. Scegli `.default` per l'argomento dell'animazione, mentre per il valore trasmetti `creature.offset`. Ogni volta che `offset` cambia, anche i cambiamenti della vista vengono animati.
nl: Koppel de modifier `.animation(_:value:)` aan de weergave `Text`. Kies `.default` als het argument van de animatie en geef `creature.offset` door als waarde. Steeds wanneer de `offset` verandert, worden de wijzigingen in de weergave weergegeven in een animatie.
no: Legg ved modifikatoren `.animation(_:value:)` i `Text`-visningen. Velg `.default` for animasjonsargumentet, og overfør `creature.offset` for verdien. Hver gang `offset` endres, animeres endringene i visningen.
pt: Anexe o modificador `.animation(_:value:)` à visualização `Text`. Escolha `.default` como argumento da animação e, como valor, passe `creature.offset`. Sempre que o `offset` for alterado, as alterações serão animadas na visualização.
sv: Bifoga modifieraren `.animation(_:value:)` i `Text`-vyn. Välj `.default` för animeringsargumentet och överför `creature.offset` för värdet. Varje gång `offset` ändras blir ändringarna i vyn animerade.
th: ติดปุ่มปรับค่า `.animation(_:value:)` ไปยังมุมมอง `Text` เลือก `.default` สำหรับอาร์กิวเมนต์ภาพเคลื่อนไหว และสำหรับค่า ให้ส่งผ่าน `creature.offset` เมื่อใดก็ตามที่ `offset` เปลี่ยนแปลง การเปลี่ยนแปลงมุมมองนั้นก็จะถูกทำให้เคลื่อนไหว
tr: `.animation(_:value:)` niteleyicisini `Text` görüntüsüne iliştir. Canlandırma argümanı için `.default`’u seç, değer için ise `creature.offset`’i geçir. Uzaklık (`offset`) her değiştiğinde görüntü değişiklikleri canlandırılır.
vi: Đính kèm trình sửa đổi `.animation(_:value:)` vào chế độ xem `Text`. Chọn `.default` cho đối số hiệu ứng chuyển động và chuyển vào `creature.offset` đối với giá trị. Bất kỳ lúc nào `offset` thay đổi, các thay đổi của chế độ xem đều được tạo hiệu ứng.
zh_cn: 将 `.animation(_:value:)` 修饰符附加到 `Text` 视图。为动画实参选取 `.default`，并为值传入 `creature.offset`（动物偏移）。只要 `offset` 发生更改，视图更改就会产生动画效果。
zh_tw: 將 `.animation(_:value:)` 修飾符附加到 `Text` 顯示區。選擇 `.default` 作為動畫參數，並為數值傳入 `creature.offset`。每當 `offset` 改變時，即會以動畫呈現顯示區的變化。

source: Experiment with your view
de: Mit der Ansicht experimentieren
es: Experimentar con tu vista
es_419: Experimentar con la visualización
fr: Faire des expériences avec une vue
it: Sperimentare con le viste
nl: Experimenteren met je weergave
no: Eksperimenter med visningen
pt: Experimente com a visualização
sv: Experimentera med vyn
th: ทดลองใช้มุมมองของคุณ
tr: Görüntünle denemeler yapma
vi: Thử nghiệm với chế độ xem của bạn
zh_cn: 视图试验
zh_tw: 體驗你的顯示區

source: Now that you’ve gotten your creatures to animate, try tweaking the animations and other parts of the view to make it more interesting.
de: Deine Charaktere hast du bereits animiert. Versuche jetzt, die Animationen und andere Bestandteile der Ansicht zu verändern, um das Ganze noch interessanter zu gestalten.
es: Ahora que has conseguido animar las criaturas, prueba a ajustar las animaciones y otras partes de la vista para hacerla más interesante.
es_419: Ahora que conseguiste agregar animaciones a tus criaturas, intenta ajustar las animaciones y otras partes de la visualización para hacerla más interesante.
fr: Maintenant que tu as réussi à animer tes créatures, essaie de modifier les animations et d’autres éléments de la vue pour la rendre plus intéressante.
it: Adesso che hai a disposizione le creature da animare, prova a regolare le animazioni e altre parti della vista per renderle più interessanti.
nl: Nu het je gelukt is om animaties van je wezens te maken, kun je de animaties en andere delen van de weergave aanpassen om ze interessanter te maken.
no: Nå når du har lykkes med å animere skapningene, skal du prøve å justere animasjonene og andre deler av visningen så det blir mer interessant.
pt: Agora que você conseguiu animar as criaturas, tente ajustar as animações e outras partes da visualização para torná-la mais interessante.
sv: Nu när du har lyckats animera varelserna ska du prova att justera animeringarna och andra delar av vyn så att det blir intressantare.
th: ตอนนี้เมื่อคุณทำให้สิ่งมีชีวิตของคุณเคลื่อนไหวได้แล้ว ให้ลองปรับเปลี่ยนภาพเคลื่อนไหวและส่วนอื่นๆ ของมุมมองเพื่อให้น่าสนใจยิ่งขึ้น
tr: Yaratıklarını canlandırdığına göre, daha ilginç hâle getirmek için canlandırmalarda ve görüntünün diğer bölümlerinde ufak düzeltmeler yapmayı dene.
vi: Bây giờ bạn đã tạo hiệu ứng cho các sinh vật của mình, hãy thử tinh chỉnh hiệu ứng chuyển động và các phần khác của chế độ xem để trở nên thú vị hơn.
zh_cn: 现在动物具有了动画效果，不妨尝试微调动画和视图的其他部分，让它们变得更有趣。
zh_tw: 現在你已經為你的生物製作動畫了，試著調整動畫和顯示區的其他部分，讓它變得更有趣。

source: Animate changes to the `creature.rotation` property by adding a new `.animation(_:value:)` modifier.
de: Animiere Änderungen an der Eigenschaft `creature.rotation`, indem du den neuen Modifikator `.animation(_:value:)` hinzufügst.
es: Anima los cambios a la propiedad `creature.rotation` añadiendo un nuevo modificador `.animation(_:value:)`.
es_419: Agrega un nuevo modificador `.animation(_:value:)` para animar los cambios en la propiedad `creature.rotation`.
fr: Anime les changements de la propriété `creature.rotation` en ajoutant un nouveau modificateur `.animation(_:value:)`.
it: Anima le modifiche alla proprietà `creature.rotation` aggiungendo un nuovo modificatore `.animation(_:value:)`.
nl: Maak een animatie van de wijzigingen in de eigenschap `creature.rotation` door een nieuwe modifier `.animation(_:value:)` toe te voegen.
no: Animer endringer av egenskapen `creature.rotation` ved å legge til en ny `.animation(_:value:)`-modifikator.
pt: Para animar as alterações da propriedade `creature.rotation`, adicione um novo modificador `.animation(_:value:)`.
sv: Animera ändringar av egenskapen `creature.rotation` genom att lägga till en ny `.animation(_:value:)`-modifierare.
th: ทำให้การเปลี่ยนแปลงที่ทำกับคุณสมบัติ `creature.rotation` เคลื่อนไหวได้โดยเพิ่มปุ่มปรับค่า `.animation(_:value:)` ใหม่
tr: Yeni bir `.animation(_:value:)` niteleyicisi ekleyerek `creature.rotation` özelliğindeki değişiklikleri canlandır.
vi: Tạo hiệu ứng các thay đổi đối với thuộc tính `creature.rotation` bằng cách thêm một trình sửa đổi `.animation(_:value:)` mới.
zh_cn: 添加一个新的 `.animation(_:value:)` 修饰符，给 `creature.rotation`（动物旋转）属性的更改赋予动画效果。
zh_tw: 透過加入一個新的 `.animation(_:value:)` 修飾符來以動畫呈現 `creature.rotation` 屬性的更動。

source: Add the following modifier before the `.animation(_:value)` modifier. How does the animation change? Why do you think this is? What happens if you place the `.spring()` animation after the above modifier?
de: Füge folgenden Modifikator vor dem Modifikator `.animation(_:value)` hinzu. Wie wirkt sich das aus? Warum wird das so gemacht? Was passiert, wenn die `.spring()`-Animation hinter obigem Modifikator platziert wird?
es: Añade el siguiente modificador antes del modificador `.animation(_:value)`. ¿Cómo cambia la animación? ¿Por qué crees que ocurre esto? ¿Qué sucede si colocas la animación `.spring()` después del modificador anterior?
es_419: Agrega el siguiente modificador antes del modificador `.animation(_:value)`. ¿Cómo cambia esto la animación? ¿Por qué crees que sucede esto? ¿Qué pasaría si colocas la animación `.spring()` después del modificador?
fr: Ajoute le modificateur suivant avant le modificateur `.animation(_:value)`. Comment l’animation change-t-elle ? À ton avis, pourquoi ? Que se passe-t-il si tu places l’animation `.spring()` après le modificateur ci-dessus ?
it: Aggiungi il seguente modificatore prima del modificatore `.animation(_:value)`. Come cambia l'animazione? Perché, secondo te? Cosa accade se posizioni l'animazione `.spring()` dopo il modificatore qui sopra?
nl: Voeg de volgende modifier toe vóór de `.animation(_:value)`-modifier. Hoe verandert de animatie? Waarom denk je dat dit is? Wat gebeurt er als je de `.spring()`-animation na de bovenstaande modifier plaatst?
no: Legg til følgende modifikator før `.animation(_:value)`-modifikatoren. Hvordan endres animasjonen? Hvorfor tror du dette skjer? Hva skjer om du plasserer animasjonen `.spring()` etter modifikatoren ovenfor?
pt: Adicione o modificador a seguir antes do modificador `.animation(_:value)`. Como isso muda a animação? Por que você acha que isso ocorre? O que acontece se você colocar a animação `.spring()` depois do modificador acima?
sv: Lägg till följande modifierare före `.animation(_:value)`-modifieraren. Hur förändras animeringen? Varför tror du att det blir så? Vad händer om du placerar animeringen `.spring()` efter modifieraren ovan?
th: เพิ่มปุ่มปรับค่าต่อไปนี้ก่อนปุ่มปรับค่า `.animation(_:value)` ภาพเคลื่อนไหวเปลี่ยนไปอย่างไรบ้าง ทำไมคุณถึงคิดว่าเป็นแบบนี้ จะเกิดอะไรขึ้นหากคุณวางภาพเคลื่อนไหว `.spring()` หลังปุ่มปรับค่าด้านบน
tr: `.animation(_:value)` niteleyicisinden önce aşağıdaki niteleyiciyi ekle. Canlandırma nasıl değişti? Sence neden böyle oldu? Yukarıdaki niteleyiciden sonra `.spring()` canlandırmasını koyarsan ne olur?
vi: Thêm trình sửa đổi sau đây vào phía trước trình sửa đổi `.animation(_:value)`. Hiệu ứng chuyển động thay đổi như thế nào? Tại sao bạn nghĩ đến việc này? Điều gì xảy ra nếu bạn đặt hiệu ứng chuyển động `.spring()` ở phía sau trình sửa đổi nêu trên?
zh_cn: 在 `.animation(_:value)`（动画值）修饰符前添加以下修饰符。动画会如何更改？你觉得为什么会这样更改？如果在以上修饰符后放置 `.spring()`（弹簧）动画会发生什么？
zh_tw: 在 `.animation(_:value)` 修飾符的前面加入以下修飾符。動畫有什麼改變？你為什麼認為這有所改變？如果在上面的修飾符後方放置 `.spring()` 動畫，這樣會發生什麼事？

source: Change the event handler for `.onTapGestures` to `data.synchronizeOffsets()`. This causes all of your creatures to move to the same offset.
de: Ändere den Ereignishandler für `.onTapGestures` in `data.synchronizeOffsets()`. Dies sorgt dafür, dass sich alle deine Charaktere mit demselben Versatz bewegen.
es: Cambia el gestor de eventos para `.onTapGestures` a `data.synchronizeOffsets()`. Esto hace que todas las criaturas se muevan al mismo desplazamiento.
es_419: Cambia el controlador de eventos de `.onTapGestures` a `data.synchronizeOffsets()`. Esto ocasiona que todas tus criaturas se muevan con la misma desviación.
fr: Remplace le gestionnaire d’évènements pour `.onTapGestures` par `data.synchronizeOffsets()`. Cela fait se déplacer toutes tes créatures selon le même décalage.
it: Sostituisci il gestore eventi per `.onTapGestures` con `data.synchronizeOffsets()`. In questo modo tutte le tue creature si muoveranno alla stessa distanza.
nl: Wijzig de eventhandler voor `.onTapGestures` in `data.synchronizeOffsets()`. Hierdoor verplaatsen al je wezens zich naar dezelfde verschuiving.
no: Endre hendelseshåndtereren for `.onTapGestures` til `data.synchronizeOffsets()`. Dette fører til at alle skapninger flyttes til samme forskyvning.
pt: Altere o controlador de eventos de `.onTapGestures` para `data.synchronizeOffsets()`. Isso faz com que todas as criaturas se movam com o mesmo deslocamento.
sv: Ändra händelsehanteraren för `.onTapGestures` till `data.synchronizeOffsets()`. Det leder till att alla varelser flyttar till samma förskjutning.
th: เปลี่ยนตัวจัดการอีเวนต์สำหรับ `.onTapGestures` เป็น `data.synchronizeOffsets()` การทำงานนี้จะทำให้สิ่งมีชีวิตทั้งหมดของคุณเคลื่อนไหวที่ระยะห่างเดียวกัน
tr: `.onTapGestures` olay işleyiciyi `data.synchronizeOffsets()` olarak değiştir. Bu, tüm yaratıklarının aynı uzaklığa taşınmasına neden olur.
vi: Thay đổi trình xử lý sự kiện cho `.onTapGestures` thành `data.synchronizeOffsets()`. Việc này khiến tất cả các sinh vật của bạn di chuyển đến cùng một khoảng cách.
zh_cn: 将 `.onTapGestures` 的事件处理程序更改为 `data.synchronizeOffsets()`（数据同步偏移）。这会导致所有动物都产生相同的偏移。
zh_tw: 將 `.onTapGestures` 的事件處理器更改為 `data.synchronizeOffsets()`。這會導致所有生物將移動到相同的位移。

source: Remove your current `.animation` modifier for `creature.offset`.
de: Entferne den aktuellen Modifikator `.animation` für `creature.offset`.
es: Elimina el modificador actual `.animation` para `creature.offset`.
es_419: Quita tu modificador `.animation` actual de la propiedad `creature.offset`.
fr: Supprime ton modificateur `.animation` actuel pour `creature.offset`.
it: Rimuovi il modificatore `.animation` corrente per `creature.offset`.
nl: Verwijder je huidige modifier `.animation` voor `creature.offset`.
no: Fjern den aktuelle `.animation`.modifikatoren for `creature.offset`.
pt: Remova o modificador atual `.animation` para `creature.offset`.
sv: Ta bort den aktuella `.animation`-modifieraren för `creature.offset`.
th: เอาปุ่มปรับค่า `.animation` ปัจจุบันของคุณสำหรับ `creature.offset` ออก
tr: `creature.offset` için şu anki `.animation` niteleyicini sil.
vi: Xóa trình sửa đổi `.animation` hiện tại của bạn cho `creature.offset`.
zh_cn: 移除 `creature.offset` 的现有 `.animation`（动画）修饰符。
zh_tw: 移除 `creature.offset` 目前的 `.animation` 修飾符。

source: Add the following animation to make each of the animations delay a small amount.
de: Füge die folgende Animation hinzu, damit jede Animation ein wenig verzögert ist.
es: Añade la siguiente animación para que cada una de las animaciones tenga un pequeño retardo.
es_419: Agrega la siguiente animación para disminuir el retraso de cada animación.
fr: Ajoute l’animation suivante pour que chacune des animations soit légèrement retardée.
it: Aggiungi l'animazione di seguito per far aggiungere un leggero ritardo a ciascuna animazione.
nl: Voeg de volgende animatie toe om alle animaties een beetje te vertragen.
no: Legg til følgende animasjon som gjør at hver animasjon forsinkes litt.
pt: Adicione a animação seguinte para que cada uma das animações tenha um pequeno atraso.
sv: Lägg till följande animering som gör så att varenda animering fördröjs en aning.
th: เพิ่มภาพเคลื่อนไหวต่อไปนี้เพื่อทำให้ภาพเคลื่อนไหวแต่ละรายการช้าลงเล็กน้อย
tr: Canlandırmaların her birinin küçük bir miktar geciktirmek için aşağıdaki canlandırmayı ekle.
vi: Thêm hiệu ứng chuyển động sau đây để làm cho từng hiệu ứng chuyển động trì hoãn một chút.
zh_cn: 添加下列动画会让每个动画产生少量延迟。
zh_tw: 加入以下動畫來讓每個動畫少量延遲。

source: Keep tweaking your animation values until you’re happy with the result!
de: Experimentiere mit den Werten für die Animation, bis du mit dem Ergebnis zufrieden bist!
es: Sigue ajustando los valores de la animación hasta que el resultado te satisfaga.
es_419: ¡Sigue personalizando tus valores de animación hasta que consigas el resultado deseado!
fr: Continue de modifier les valeurs de ton animation jusqu’à ce que le résultat te convienne !
it: Continua a modificare i valori dell'animazione fino a quando non raggiungerai un risultato che ti soddisfa pienamente.
nl: Ga door met het aanpassen van de animatiewaarden totdat je tevreden bent met het resultaat!
no: Fortsett med å justere animasjonsverdiene til du er fornøyd med resultatet!
pt: Faça ajustes nos valores de animação até ficar contente com o resultado!
sv: Fortsätt att justera animeringsvärdena tills du är nöjd med resultatet!
th: ปรับเปลี่ยนค่าภาพเคลื่อนไหวของคุณต่อไปจนกว่าคุณจะพอใจกับผลลัพธ์!
tr: Sonuçtan memnun olana kadar canlandırma değerlerini değiştirmeye devam et!
vi: Tiếp tục tinh chỉnh các giá trị hiệu ứng chuyển động đến khi bạn hài lòng với kết quả!
zh_cn: 继续微调动画值，直到你满意为止！
zh_tw: 持續調整你的動畫值，直到你對結果滿意為止！

source: Nice work!
de: Gut gemacht!
es: ¡Buen trabajo!
es_419: ¡Muy buen trabajo!
fr: Joli travail !
it: Ottimo lavoro!
nl: Goed gedaan!
no: Bra jobbet!
pt: Bom trabalho!
sv: Snyggt jobbat!
th: ดีมาก!
tr: İyi iş!
vi: Bạn làm rất tốt!
zh_cn: 干得漂亮！
zh_tw: 做得好！

source: You’ve successfully created another view that uses your observable [data model](glossary://data%20model) shared with the [view hierarchy](glossary://view%20hierarchy).
de: Du hast erfolgreich eine neue Ansicht erstellt, die das beobachtbare [Datenmodell](glossary://data%20model) verwendet, das mit der [Ansichtenhierarchie](glossary://view%20hierarchy) geteilt wurde.
es: Has creado correctamente otra vista que usa tu [modelo de datos](glossary://data%20model) observable compartido con la [jerarquía de vistas](glossary://view%20hierarchy).
es_419: Lograste crear otra visualización que usa tu [modelo de datos](glossary://data%20model) observable compartido con la [jerarquía de visualizaciones](glossary://view%20hierarchy).
fr: Tu as réussi à créer une autre vue qui utilise ton [modèle de données](glossary://data%20model) observable partagé avec la [hiérarchie de vue](glossary://view%20hierarchy).
it: Hai raggiunto l'obiettivo di creare un'altra vista che utilizza il tuo [modello di dati](glossary://data%20model) osservabile condiviso con la [gerarchia di viste](glossary://view%20hierarchy).
nl: Het is je gelukt om nog een weergave aan te maken die gebruikmaakt van je observeerbare [gegevensmodel](glossary://data%20model) dat wordt gedeeld met de [weergavehiërarchie](glossary://view%20hierarchy).
no: Du har opprettet en annen visning som bruker den observerbare [datamodellen](glossary://data%20model) din som deles med [visningshierarkiet](glossary://view%20hierarchy).
pt: Você conseguiu criar mais uma visualização que usa o seu [modelo de dados](glossary://data%20model) observável compartilhado com a [hierarquia de visualizações](glossary://view%20hierarchy).
sv: Du har skapat en annan vy som använder din observerbara [datamodell](glossary://data%20model) som delas med [vyhierarkin](glossary://view%20hierarchy).
th: คุณทำสำเร็จแล้ว คุณได้สร้างอีกหนึ่งมุมมองที่ใช้[โมเดลข้อมูล](glossary://data%20model)ที่สังเกตเห็นได้ของคุณที่แชร์กับ[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)
tr: [Görüntü hiyerarşisi](glossary://view%20hierarchy) ile paylaşılan gözlemlenebilir [veri modelini](glossary://data%20model) kullanan başka bir görüntüyü daha başarıyla yarattın.
vi: Bạn đã tạo ra thành công một chế độ xem khác sử dụng [mô hình dữ liệu](glossary://data%20model) có thể quan sát được chia sẻ với [phân cấp xem](glossary://view%20hierarchy).
zh_cn: 你成功地创建了另一个视图，这个视图使用了与[视图层次](glossary://view%20hierarchy)共享的可观测[数据模型](glossary://data%20model)。
zh_tw: 你已經成功製作了另一個顯示區，這個顯示區使用與[顯示區階層](glossary://view%20hierarchy)共享的可觀察[資料模型](glossary://data%20model)。

source: Next, you’ll learn how to add and delete data from that data model so people can customize the app.
de: Als Nächstes lernst du, wie du Daten zu diesem Datenmodell hinzufügst und daraus entfernst, um es Benutzer:innen zu ermöglichen, die App anzupassen.
es: A continuación, aprenderás a añadir y eliminar datos de ese modelo de datos para que las personas puedan personalizar la app.
es_419: A continuación, aprenderás a agregar y eliminar datos de ese modelo de datos para que las personas puedan personalizar la app.
fr: Ensuite, tu vas apprendre comment ajouter et supprimer des données dans un modèle de données pour que des personnes puissent personnaliser ton app.
it: Nella prossima attività, imparerai come aggiungere ed eliminare dati da quel modello per consentire alle persone di personalizzare l'app.
nl: Nu ga je leren hoe je gegevens aan het gegevensmodel toevoegt en uit het gegevensmodel verwijdert zodat gebruikers de app kunnen aanpassen.
no: Nå skal du lære hvordan du legger til og sletter data fra denne datamodellen, slik at personer kan tilpasse appen.
pt: A seguir, você aprenderá a adicionar e apagar dados desse modelo de dados para permitir que as pessoas possam personalizar o app.
sv: Härnäst lär du dig att lägga till och radera data från den datamodellen så att personer kan anpassa appen.
th: ถัดไป คุณจะได้เรียนรู้วิธีเพิ่มและลบข้อมูลจากโมเดลข้อมูลนั้นเพื่อให้ผู้คนสามารถกำหนดแอปเองได้
tr: Sonra, kişilerin uygulamayı özelleştirebilmesi için o veri modelinden veri eklemeyi ve silmeyi öğreneceksin.
vi: Tiếp theo, bạn sẽ học cách thêm và xóa dữ liệu khỏi mô hình dữ liệu đó sao cho mọi người có thể tùy chỉnh ứng dụng.
zh_cn: 下一步，你将学习如何从数据模型添加和删除数据，以便用户可以自定 App。
zh_tw: 接下來，你將學習如何從資料模型加入和刪除資料，讓使用者可自訂 App。

# GuideBook..Guide0..StepAdd and delete creatures..title
source: Add and delete creatures
de: Charaktere hinzufügen und löschen
es: Añadir y eliminar criaturas
es_419: Agregar y eliminar criaturas
fr: Ajouter et supprimer des créatures
it: Aggiungere ed eliminare creature
nl: Wezens toevoegen en verwijderen
no: Legg til og slett skapninger
pt: Adicione e apague criaturas
sv: Lägg till och radera varelser
th: เพิ่มและลบสิ่งมีชีวิต
tr: Yaratık ekleme ve silme
vi: Thêm và xóa các sinh vật
zh_cn: 添加和删除动物
zh_tw: 加入和刪除生物
