Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepAdd and delete creatures..TaskdismissEditor..title
source: Dismiss the editor when you tap Add
de: Editor beim Tippen der Taste „Hinzufügen“ schließen
es: Cerrar el editor al tocar Añadir
es_419: Cerrar el editor al tocar Agregar
fr: Fermer l’éditeur lorsque tu touches Ajouter
it: Nascondere l'editor quando tocchi Aggiungi
nl: De editor sluiten wanneer je op 'Voeg toe' tikt
no: Lukk redigereren når du trykker på «Legg til»
pt: Feche o editor ao tocar em Adicionar
sv: Avfärda redigeraren när du trycker på Add
th: ปิดทิ้งตัวแก้ไขเมื่อคุณแตะเพิ่ม
tr: Ekle’ye dokunduğunda düzenleyiciyi kapatma
vi: Ẩn trình sửa khi bạn chạm vào Thêm
zh_cn: 轻点“添加”时关闭编辑器
zh_tw: 當你點按「加入」時關閉編輯器

source: After you add a creature, your `CreatureEditor` view dismisses, showing the previous view you navigated from. This is a better user experience, and it prevents you from tapping the Add button more than once, which would just add the same creature again and again.
de: Nachdem du einen Charakter hinzugefügt hast, wird die `CreatureEditor`-Ansicht geschlossen und die vorherige Ansicht angezeigt. Auf diese Weise wird nicht nur das Benutzererlebnis verbessert, sondern auch verhindert, dass die Taste „Hinzufügen“ mehr als einmal getippt und somit der gleiche Charakter mehrmals hinzugefügt wird.
es: Después de añadir una criatura, la vista `CreatureEditor` se cierra, mostrando la vista anterior desde la que se navegó. Esta experiencia de usuario es mejor y evita que toques el botón Añadir más de una vez, que añadiría la misma criatura una y otra vez.
es_419: Después de agregar una criatura, se cierra la visualización `CreatureEditor` y se muestra la visualización anterior. Esto crea una mejor experiencia para el usuario, y evita que se toque el botón Agregar más de una vez, lo cual agregaría la misma criatura una y otra vez.
fr: Lorsque tu as ajouté une créature, ta vue `CreatureEditor` se ferme, pour afficher la vue précédente à partir de laquelle tu as navigué. Cela constitue une meilleure expérience pour l’utilisateur et évite que tu touches plusieurs fois le bouton « Ajouter », ce qui ajouterait simplement la même créature encore et encore.
it: Dopo aver aggiunto una creatura, la vista `CreatureEditor` viene nascosta per lasciare il posto alla vista precedente da cui provenivi. In questo modo, l'esperienza utente sarà migliore ed eviterai di premere il pulsante Aggiungi più volte, che non farebbe altro che aggiungere ripetutamente la stessa creatura.
nl: Nadat je een wezen hebt toegevoegd, wordt de weergave `CreatureEditor` gesloten en wordt de vorige weergave weer geopend. Hierdoor ontstaat een betere gebruikerservaring en wordt voorkomen dat er meer dan eens op de knop 'Voeg toe' wordt getikt waardoor hetzelfde wezen steeds opnieuw zou worden toegevoegd.
no: Når du har lagt til en skapning, lukkes visningen `CreatureEditor`, og du ser den forrige visningen som du navigerte fra. Dette er en bedre brukeropplevelse, og det forhindrer at du trykker mer enn én gang på knappen «Legg til» og dermed legger til samme skapning flere ganger.
pt: Depois de adicionar uma criatura, a visualização `CreatureEditor` é fechada, mostrando a visualização anterior a partir da qual você navegou. Isso oferece uma experiência de usuário melhor e evita que você pressione o botão Adicionar mais de uma vez, o que apenas adicionaria a mesma criatura repetidamente.
sv: När du har lagt till en varelse avfärdas vyn `CreatureEditor` så att du ser den föregående vyn som du navigerade från. Det här är en bättre användarupplevelse och förhindrar att du trycker mer än en gång på knappen ”Lägg till” och därmed lägger till samma varelse flera gånger.
th: หลังจากที่คุณเพิ่มสิ่งมีชีวิตแล้ว มุมมอง `CreatureEditor` ของคุณจะถูกปิดทิ้งและแสดงมุมมองก่อนหน้านี้ที่คุณนำทางมา นี่เป็นประสบการณ์ผู้ใช้ที่ดีขึ้น และป้องกันไม่ให้คุณแตะปุ่มเพิ่มมากกว่าหนึ่งครั้ง ซึ่งจะเพียงแค่สร้างสิ่งมีชีวิตซ้ำแล้วซ้ำอีก
tr: Bir yaratık ekledikten sonra `CreatureEditor` görüntün kapanır ve geldiğin önceki görüntüyü gösterir. Bu daha iyi bir kullanıcı deneyimidir ve Ekle düğmesine birden fazla kez dokunup aynı yaratığı tekrar tekrar eklemeni engeller.
vi: Sau khi thêm một sinh vật, chế độ xem `CreatureEditor` của bạn ẩn đi, hiển thị chế độ xem trước đó mà bạn đã điều hướng đi. Đây là một trải nghiệm người dùng tốt hơn và ngăn không cho bạn chạm vào nút Thêm nhiều lần, vì việc đó chỉ thêm cùng một sinh vật nhiều lần.
zh_cn: 添加动物后，`CreatureEditor` 视图会关闭，并显示你导航到这个视图前的上一个视图。这样用户体验会比较好，可以防止你多次轻点“添加”按钮，导致一次又一次加入相同动物的情况。
zh_tw: 加入生物後，你的 `CreatureEditor` 顯示區會關閉，顯示你導覽的上一個顯示區。這是一種更好的使用者體驗，它可以避免你多次點按「加入」按鈕，重複加入相同的生物。

source: To dismiss the view, you need two things:
de: Zum Schließen der Ansicht brauchst du zwei Dinge:
es: Para cerrar la vista, tienes que hacer dos cosas:
es_419: Para cerrar la visualización, necesitas dos cosas:
fr: Tu as besoin de deux choses pour fermer la vue :
it: Per nascondere la vista, hai bisogno di due elementi:
nl: Om de weergave te sluiten, moet je twee dingen doen:
no: Du trenger to ting for å kunne lukke visningen:
pt: Para fechar a visualização, você precisa de duas coisas:
sv: Du behöver två saker för att kunna avfärda vyn:
th: ในการปิดทิ้งมุมมอง คุณจะต้องใช้สองสิ่ง:
tr: Görüntüyü kapatmak için iki şeye ihtiyacın var:
vi: Để ẩn chế độ xem, bạn cần hai thứ:
zh_cn: 若要关闭视图，你需要做两件事：
zh_tw: 若要關閉顯示區，你需要兩樣東西：

source: Declare the [environment](glossary://environment) value `dismiss`, which allows the app to dismiss the current view being presented in the `NavigationStack`.
de: Deklariere den [Umgebungs](glossary://environment)wert `dismiss`, mit dem die App die aktuelle Ansicht schließen kann, die gerade in `NavigationStack` dargestellt wird.
es: Declara el valor de [entorno](glossary://environment) `dismiss`, que permite a la app cerrar la vista actual que se presenta en la pila de navegación (`NavigationStack`).
es_419: Declara el valor del [entorno](glossary://environment) `dismiss`, el cual permite a la app cerrar la visualización actual que se muestra en `NavigationStack`.
fr: Déclare la valeur d’[environnement](glossary://environment) `dismiss`, qui permet à l’app de fermer la vue actuelle présentée dans la `NavigationStack`.
it: Dichiara il valore [ambiente](glossary://environment) `dismiss`, che consente all'app di nascondere la vista attuale presentata in `NavigationStack`.
nl: Declareer de [omgeving](glossary://environment)swaarde `dismiss`, waardoor de app de huidige weergave in de `NavigationStack` kan sluiten.
no: Deklarer [miljøverdien](glossary://environment) `dismiss`, noe som gjør det mulig for appen å lukke den aktuelle visningen som vises i `NavigationStack`.
pt: Declare o valor de [ambiente](glossary://environment) `dismiss`, que permite que o app ignore a visualização atual apresentada em `NavigationStack`.
sv: Deklarera [miljö](glossary://environment)värdet `dismiss`, vilket gör det möjligt för appen att avfärda den aktuella vyn som visas i `NavigationStack`.
th: ประกาศ[สภาพแวดล้อม](glossary://environment)เป็น `dismiss` ซึ่งจะช่วยให้แอปสามารถปิดทิ้งมุมมองปัจจุบันที่กำลังแสดงใน `NavigationStack` ได้
tr: Uygulamanın `NavigationStack`’te sunulan şu anki görüntüyü kapatmasını sağlayan `dismiss` [ortam](glossary://environment) değerini bildir.
vi: Khai báo giá trị [môi trường](glossary://environment) `dismiss`, cho phép ứng dụng ẩn chế độ xem hiện tại đang được trình bày trong `NavigationStack`.
zh_cn: 声明[环境](glossary://environment)值 `dismiss`（关闭），这会允许 App 关闭在 `NavigationStack` 中显示的当前视图。
zh_tw: 宣告[環境](glossary://environment)值 `dismiss` 它可讓 App 關閉目前顯示在 `NavigationStack` 中的顯示區。

source: [Call](glossary://call) `dismiss()` when tapping the Add button.
de: [Rufe](glossary://call) `dismiss()` (schließen) auf, wenn auf die Taste zum Hinzufügen getippt wird.
es: [Llama](glossary://call) a `dismiss()` cuando se toque el botón Añadir.
es_419: [Llama](glossary://call) a `dismiss()` cuando se toque el botón Agregar.
fr: [Appelle](glossary://call) `dismiss()` lorsque tu touches le bouton Ajouter.
it: [Richiama](glossary://call) `dismiss()` quando tocchi il pulsante Aggiungi.
nl: Zorg dat `dismiss()` wordt [aangeroepen](glossary://call) wanneer je op de knop 'Voeg toe' tikt.
no: [Kall](glossary://call) `dismiss()` når du trykker på knappen «Legg til».
pt: [Chame](glossary://call) `dismiss()` ao tocar no botão Adicionar.
sv: [Anropa](glossary://call) `dismiss()` när du trycker på knappen ”Lägg till”.
th: [เรียกใช้](glossary://call) `dismiss()` เมื่อแตะปุ่มเพิ่ม
tr: Ekle düğmesine dokunulduğunda `dismiss()` fonksiyonunu [çağır](glossary://call).
vi: [Gọi](glossary://call) `dismiss()` khi chạm vào nút Thêm.
zh_cn: 轻点“添加”按钮时[调用](glossary://call) `dismiss()`。
zh_tw: 點一下「加入」按鈕時[呼叫](glossary://call) `dismiss()`。

source: After you’ve declared the [environment](glossary://environment) value `dismiss`, call `dismiss()` when you tap Add, after you’ve added your new creature to `data.creatures`.
de: Nachdem du den [Umgebungs](glossary://environment)wert `dismiss` deklariert hast, rufe beim Tippen der Taste „Hinzufügen“ die Funktion `dismiss()` auf, wenn ein neuer Charakter zu `data.creatures` hinzugefügt wurde.
es: Después de haber declarado el valor de [entorno](glossary://environment) `dismiss`, llama a `dismiss()` al tocar Añadir, después de haber añadido la nueva criatura a `data.creatures`.
es_419: Después de haber declarado el cierre del valor del [entorno](glossary://environment), llama a `dismiss()` cuando se toque el botón Agregar, después de haber agregado tu criatura nueva a `data.creatures`.
fr: Lorsque tu as déclaré la valeur d’[environnement](glossary://environment) `dismiss`, appelle `dismiss()` lorsque tu touches « Ajouter » après avoir ajouté ta nouvelle créature à `data.creatures`.
it: Dopo aver dichiarato il valore [ambiente](glossary://environment) `dismiss`, richiama `dismiss()` quando tocchi Aggiungi, dopo che hai aggiunto una nuova creatura a `data.creatures`.
nl: Nadat je de [omgeving](glossary://environment)swaarde `dismiss` hebt gedeclareerd, moet je `dismiss()` aanroepen wanneer je op de knop 'Voeg toe' tikt en het nieuwe wezen aan `data.creatures` is toegevoegd.
no: Når du har deklarert [miljøverdien](glossary://environment) `dismiss`, kalles `dismiss()` når du trykker på «Legg til» etter at du har lagt til den nye skapningen i `data.creatures`.
pt: Depois de declarar o valor de [ambiente](glossary://environment) como `dismiss`, chame `dismiss()` ao tocar em Adicionar, depois de adicionar a nova criatura a `data.creatures`.
sv: När du har deklarerat [miljö](glossary://environment)värdet `dismiss` anropas `dismiss()` när du trycker på Lägg till efter att du har lagt till din nya varelse i `data.creatures`.
th: หลังจากที่คุณได้ประกาศ[สภาพแวดล้อม](glossary://environment)เป็น `dismiss` แล้ว ให้เรียกใช้ `dismiss()` เมื่อคุณแตะ “เพิ่ม” หลังจากที่คุณได้เพิ่มสิ่งมีชีวิตใหม่ของคุณไปยัง `data.creatures`
tr: [Ortam](glossary://environment) değeri kapatmayı (`dismiss`) bildirmenin ardından yeni yaratığını `data.creatures`’a ekledikten sonra Ekle’ye dokunurken `dismiss()`’i çağır.
vi: Sau khi bạn đã khai báo giá trị [môi trường](glossary://environment) `dismiss`, hãy gọi `dismiss()` khi bạn chạm vào Thêm, sau khi đã thêm sinh vật mới của mình vào `data.creatures`.
zh_cn: 声明[环境](glossary://environment)值 `dismiss` 之后，当你将新动物添加到 `data.creatures` 后，轻点“添加”时会调用 `dismiss()`。
zh_tw: 在你宣告[環境](glossary://environment)值 `dismiss` 後，當你將新生物加入 `data.creatures` 時，點按「加入」來呼叫 `dismiss()`。

source: .toolbar { ToolbarItem { Button("Add") { data.creatures.append(newCreature) dismiss() } } }
de: .toolbar { ToolbarItem { Button("Hinzufügen") { data.creatures.append(newCreature) dismiss() } } }
es: .toolbar { ToolbarItem { Button("Añadir") { data.creatures.append(newCreature) dismiss() } } }
es_419: .toolbar { ToolbarItem { Button("Agregar") { data.creatures.append(newCreature) dismiss() } } }
fr: .toolbar { ToolbarItem { Button("Ajotuer") { data.creatures.append(newCreature) dismiss() } } }
nl: .toolbar { ToolbarItem { Button("Voeg toe") { data.creatures.append(newCreature) dismiss() } } }
pt: .toolbar { ToolbarItem { Button("Adicionar") { data.creatures.append(newCreature) dismiss() } } }
sv: .toolbar { ToolbarItem { Button("Lägg till") { data.creatures.append(newCreature) dismiss() } } }
tr: .toolbar { ToolbarItem { Button("Ekle") { data.creatures.append(newCreature) dismiss() } } }
vi: .toolbar { ToolbarItem { Button("Thêm") { data.creatures.append(newCreature) dismiss() } } }
zh_cn: .toolbar { ToolbarItem { Button("添加") { data.creatures.append(newCreature) dismiss() } } }

# GuideBook..Guide0..StepAdd and delete creatures..SuccessMessage..Paragraph292
source: Congratulations, you’ve created a fully functioning app!
de: Glückwunsch, du hast eine voll funktionsfähige App erstellt!
es: ¡Enhorabuena! Has creado una app totalmente funcional.
es_419: ¡Felicidades, creaste una app completamente funcional!
fr: Félicitations, tu as créé une app qui fonctionne parfaitement !
it: Congratulazioni, hai creato un'app perfettamente funzionante!
nl: Gefeliciteerd, je hebt een volledige functionele app gemaakt!
no: Gratulerer, du har laget en fullt fungerende app!
pt: Parabéns, você criou um app totalmente funcional!
sv: Grattis, du har skapat en fullt fungerande app!
th: ยินดีด้วย คุณได้สร้างแอปที่ทำงานอย่างสมบูรณ์ขึ้นมาแล้ว!
tr: Tebrikler, tamamen işlevsel bir uygulama yarattın!
vi: Chúc mừng, bạn đã tạo ra một ứng dụng đầy đủ chức năng!
zh_cn: 恭喜，你已经创建了一个功能齐全的 App！
zh_tw: 恭喜！你已經製作了一個功能完整的 App！

# GuideBook..Guide0..StepAdd and delete creatures..SuccessMessage..Paragraph293
source: You have the ability to add new creatures, view and edit them in `CreatureList`, and watch them dance in `DancingCreatures`.
de: Du kannst neue Charaktere hinzufügen, sie mit `CreatureList` in einer Charakterliste anzeigen und bearbeiten und ihnen in `DancingCreatures` beim Tanzen zuschauen.
es: Puedes añadir nuevas criaturas, verlas y editarlas en `CreatureList`, y verlas bailar en `DancingCreatures`.
es_419: Ahora puedes agregar nuevas criaturas y editarlas en `CreatureList` y luego verlas bailar en `DancingCreatures`.
fr: Tu peux ajouter de nouvelles créatures, les voir et les modifier dans `CreatureList`, et les regarder danser dans `DancingCreatures`.
it: Hai la possibilità di aggiungere nuove creature, visualizzarle e modificarle in `CreatureList` e perfino di guardarle ballare in `DancingCreatures`.
nl: Je kunt nieuwe wezens toevoegen, je kunt ze bekijken en bewerken in `CreatureList` en je kunt ze zien dansen in `DancingCreatures`.
no: Du kan legge til nye skapninger, vise og redigere dem i `CreatureList` og se dem danse i `DancingCreatures`.
pt: Você é capaz de adicionar novas criaturas, visualizar e editá‑las em `CreatureList`, e assisti‑las dançando em `DancingCreatures`.
sv: Du kan lägga till nya varelser, visa och redigera dem i `CreatureList` och se dem dansa i `DancingCreatures`.
th: คุณสามารถเพิ่มสิ่งมีชีวิตใหม่ ดูและแก้ไขสิ่งมีชีวิตใน `CreatureList` และดูสิ่งมีชีวิตเต้นรำใน `DancingCreatures` ได้
tr: Yeni yaratıklar ekleyebilir, bunları `CreatureList`’te görüntüleyebilir, düzenleyebilir ve `DancingCreatures`’ta dans etmelerini izleyebilirsin.
vi: Bạn có khả năng thêm các sinh vật mới, xem và sửa chúng trong `CreatureList` và xem chúng nhảy múa trong `DancingCreatures`.
zh_cn: 你可以加入新动物，在 `CreatureList` 中查看和编辑它们，并在 `DancingCreatures` 中观看它们跳舞。
zh_tw: 你可以加入新生物，在 `CreatureList` 中檢視和編輯它們，並在 `DancingCreatures` 中觀看它們跳舞。

# GuideBook..Guide0..StepAdd a `CreatureDetail` view..title
source: Add a `CreatureDetail` view
de: Ansicht `CreatureDetail` hinzufügen
es: Añadir una vista `CreatureDetail`
es_419: Agregar una visualización `CreatureDetail`
fr: Ajouter une vue `CreatureDetail`
it: Aggiungere una vista `CreatureDetail`
nl: Een `CreatureDetail`-weergave toevoegen
no: Legg til en `CreatureDetail`-visning
pt: Adicione uma visualização `CreatureDetail`
sv: Lägg till en `CreatureDetail`-vy
th: เพิ่มมุมมอง `CreatureDetail`
tr: `CreatureDetail` görüntüsü ekleme
vi: Thêm một chế độ xem `CreatureDetail`
zh_cn: 添加 `CreatureDetail` 视图
zh_tw: 加入一個 `CreatureDetail` 顯示區

source: Now that you know how to navigate between views, manage [local](glossary://local%20scope) state changes, share data across your whole app, and use a variety of [built-in SwiftUI views](glossary://built-in%20view), it’s time to put your skills to the test to create a new view: `CreatureDetail`, a view shows the details for a single creature in your list.
de: Du hast gelernt, wie man zwischen Ansichten navigiert, [lokale](glossary://local%20scope) Statusänderungen verwaltet, innerhalb der gesamten App Daten teilt und eine Vielzahl von [integrierten SwiftUI-Ansichten](glossary://built-in%20view) verwendet. Jetzt kannst du dein erlerntes Wissen nutzen, um eine neue Ansicht zu erstellen: `CreatureDetail`, eine Ansicht, die Details für die jeweiligen Charaktere in deiner Liste anzeigt.
es: Ahora que ya sabes cómo navegar entre las vistas, gestionar cambios de estado [locales](glossary://local%20scope), compartir datos en toda la app y utilizar una variedad de [vistas de SwiftUI integradas](glossary://built-in%20view), es hora de poner a prueba tus habilidades para crear una nueva vista: `CreatureDetail`, una vista muestra los detalles de una sola criatura de tu lista.
es_419: Ahora que sabes cómo navegar entre las visualizaciones, administrar los cambios de estado [locales](glossary://local%20scope), compartir datos entre toda tu app, y usar una variedad de [visualizaciones integradas de SwiftUI](glossary://built-in%20view), es hora de poner tus habilidades a prueba y crear una nueva visualización que muestre los detalles de una sola criatura de tu lista: `CreatureDetail`.
fr: Maintenant que tu sais naviguer entre les vues, gérer les modifications d’état [locales](glossary://local%20scope), partager des données dans toute ton app et utiliser différentes [vues SwiftUI intégrées](glossary://built-in%20view), il est temps de tester tes compétences pour créer une nouvelle vue : `CreatureDetail`. Une vue affiche les détails concernant une seule créature de ta liste.
it: Adesso che hai imparato a navigare tra le viste, a gestire i cambiamenti di stato [locali](glossary://local%20scope), a condividere dati nell'intera app e a usare una serie di [viste integrate di SwiftUI](glossary://built-in%20view), è arrivato il momento di mettere alla prova le tue capacità, creando la nuova vista `CreatureDetail`, che mostra i dettagli per una singola creatura nell'elenco.
nl: Nu je weet hoe je tussen weergaven navigeert, [lokale](glossary://local%20scope) statuswijzigingen beheert, gegevens in de hele app deelt en verschillende [ingebouwde SwiftUI-weergaven](glossary://built-in%20view) gebruikt, is het tijd om je vaardigheden in de praktijk te brengen door de nieuwe weergave `CreatureDetail` aan te maken, een weergave waarin de details van een wezen in je lijst worden weergegeven.
no: Nå når du vet hvordan du navigerer mellom visninger, håndterer [lokale](glossary://local%20scope) statusendringer, deler data i hele appen og bruker ulike [innebygde SwiftUI-visninger](glossary://built-in%20view), er det på tide at du tester ferdighetene dine ved å opprette den nye visningen `CreatureDetail`, som viser detaljene for én skapning i listen.
pt: Agora que você sabe navegar entre visualizações, gerenciar alterações de estado [locais](glossary://local%20scope), compartilhar dados por todo o app e usar diversas [visualizações integradas de SwiftUI](glossary://built-in%20view), chegou o momento de colocar suas habilidades à prova e criar uma nova visualização: `CreatureDetail`, uma visualização que mostra os detalhes de um única criatura na lista.
sv: Nu när du vet hur du navigerar mellan vyer, hanterar [lokala](glossary://local%20scope) statusändringar, delar data i hela appen och använder olika [inbyggda SwiftUI-vyer](glossary://built-in%20view) är det dags att du testar dina färdigheter genom att skapa den nya vyn `CreatureDetail` som visar detaljerna för en enskild varelse i listan.
th: ตอนนี้เมื่อคุณรู้วิธีนำทางระหว่างมุมมอง จัดการกับการเปลี่ยนแปลงสถานะ[ภายใน](glossary://local%20scope) แชร์ข้อมูลทั่วทั้งแอปของคุณ และใช้[มุมมอง SwiftUI ในตัว](glossary://built-in%20view)ที่หลากหลายแล้ว ก็ถึงเวลาทดสอบทักษะของคุณในการสร้างมุมมองใหม่: `CreatureDetail` มุมมองจะแสดงรายละเอียดของสิ่งมีชีวิตตัวเดียวในรายการของคุณ
tr: Artık görüntüler arasında dolaşmayı, [yerel](glossary://local%20scope) durum değişikliklerini yönetmeyi, uygulamanın tamamında veri paylaşmayı ve çeşitli [yerleşik SwiftUI görüntülerini](glossary://built-in%20view) kullanmayı bildiğine göre yeni bir görüntü yaratmak için becerilerini test etme zamanı geldi: listendeki tek bir yaratığın ayrıntılarını gösteren `CreatureDetail` görüntüsü.
vi: Bây giờ bạn đã biết cách điều hướng giữa các chế độ xem, quản lý các thay đổi trạng thái [cục bộ](glossary://local%20scope), chia sẻ dữ liệu trong toàn bộ ứng dụng của bạn và sử dụng nhiều [chế độ xem SwiftUI tích hợp](glossary://built-in%20view), đã đến lúc kiểm tra các kỹ năng của bạn nhằm tạo ra một chế độ xem mới: `CreatureDetail`, một chế độ xem hiển thị chi tiết cho một sinh vật đơn nhất trong danh sách của bạn.
zh_cn: 既然你知道了如何在不同视图间导航、管理[本地](glossary://local%20scope)状态更改、在整个 App 中共享数据，以及使用各种 [SwiftUI 内建视图](glossary://built-in%20view)，现在是时候测试你的技能来创建新的视图 `CreatureDetail`（动物细节）了，这是一个显示列表中单个动物细节的视图。
zh_tw: 現在你已經知道如何在顯示區之間導覽、管理[區域](glossary://local%20scope)狀態更動、在整個 App 之間共享資料以及使用各種[內建 SwiftUI 顯示區](glossary://built-in%20view)，是時候測試你的技巧來建立新的顯示區了：`CreatureDetail` 這個顯示區會顯示你列表中單一生物的詳細資訊。

source: Your list of creatures is nice to look at, but needs a bit more interactivity. What good is having all these creatures if you can’t tinker with them?
de: Die Liste mit den Charakteren sieht zwar schön aus, aber sie müsste etwas interaktiver sein. Denn was bringt dir eine schöne Liste, wenn du mit den ganzen Charakteren nichts anstellen kannst, oder?
es: Tu lista de criaturas es bonita de ver, pero necesita algo más de interacción. ¿De qué sirve tener todas estas criaturas si no puedes trastear con ellas?
es_419: Tu lista de criaturas se ve bien, pero necesita un poco más de interactividad. ¿De qué sirve tener todas esas criaturas si no puedes jugar con ellas?
fr: Ta liste de créatures est bien jolie, mais elle a besoin d’un peu plus d’interactivité. À quoi bon disposer de toutes ces créatures si tu ne peux pas jouer avec elles ?
it: Le tue creature sono molto carine da guardare, ma devono diventare un po' più interattive. Sennò a cosa serve averle se non puoi sperimentare con loro?
nl: Je lijst met wezens ziet er leuk uit, maar moet iets interactiever worden gemaakt. Wat heb je aan al die wezens als je ze niet kunt aanpassen?
no: Listen din med skapninger ser bra ut, men den bør bli litt mer interaktiv. Hva er poenget med å ha alle disse skapningene hvis du ikke kan gjøre noe med dem?
pt: A sua lista de criaturas é notável, mas precisa de um pouco mais de interatividade. Para que serve ter tantas criaturas se não é possível mexer nelas?
sv: Din lista med varelser ser bra ut, men den skulle behöva vara lite mer interaktiv. Vad är nyttan med att ha alla de här varelserna om du inte kan göra något med dem?
th: รายการสิ่งมีชีวิตของคุณดูดีนะ แต่ต้องโต้ตอบได้มากกว่านี้อีกหน่อย จะมีประโยชน์อะไรหากคุณไม่สามารถดัดแปลงสิ่งมีชีวิตเหล่านี้ได้
tr: Yaratık listen güzel görünüyor, ancak biraz daha etkileşime ihtiyacı var. Onlarla oynayamayacaksan tüm bu yaratıklara sahip olmanın anlamı ne?
vi: Danh sách các sinh vật của bạn trông rất đẹp, nhưng cần thêm một chút tính tương tác. Việc có tất cả những sinh vật này có ích gì nếu bạn không thể chơi đùa với chúng?
zh_cn: 你的动物列表看起来不错，但需要更多互动性。如果不能鼓捣它们，那拥有这些动物又有什么用呢？
zh_tw: 你的生物列表看起來很不錯，但需要更多的互動性。如果你不能修改它們，擁有這些全部生物有什麼好處？
