Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Notice that the `.foregroundColor(_:)` modifier contains special syntax. This is called a [ternary conditional operator](glossary://ternary%20conditional%20operator), a concise way of creating an `if-else` statement in a single line of code.
de: Hast du bemerkt, dass der Modifikator `.foregroundColor(_:)` eine spezielle Syntax hat? Diese wird als [dreigliedriger bedingter Operator](glossary://ternary%20conditional%20operator) bezeichnet. Mit ihm kannst du kurz und knapp eine `if-else`-Anweisung in einer einzigen Codezeile erstellen.
es: Fíjate en que el modificador`.foregroundColor(_:)` contiene una sintaxis especial. Se llama [operador condicional ternario](glossary://ternary%20conditional%20operator), una forma concisa de crear una sentencia `if-else` en una sola línea de código.
es_419: Ten en cuenta que el modificador `.foregroundColor(_:)` contiene sintaxis especial, conocida como [operador condicional ternario](glossary://ternary%20conditional%20operator), la cual ofrece una manera concisa de crear una declaración if-else` (si no) en una sola línea de código.
fr: Tu remarqueras que le modificateur `.foregroundColor(_:)` contient une syntaxe particulière. Cela s’appelle un [opérateur conditionnel ternaire](glossary://ternary%20conditional%20operator), une manière concise de créer une instruction `if-else` en une seule ligne de code.
it: Fai attenzione: il modificatore `.foregroundColor(_:)` contiene una sintassi speciale, nota come [operatore condizionale ternario](glossary://ternary%20conditional%20operator), un modo conciso di creare un'istruzione `if-else` in una sola riga di codice.
nl: Zoals je ziet heeft de modifier `.foregroundColor(_:)` een speciale syntaxis. Dit wordt een [driedelige voorwaardelijke operator](glossary://ternary%20conditional%20operator) genoemd, een beknopte manier om een `if-else`-instructie in één regel code weer te geven.
no: Legg merke til at modifikatoren `.foregroundColor(_:)` inneholder en spesiell syntaks. Dette kalles en [tredobbel betinget operator](glossary://ternary%20conditional%20operator) og er en kortfattet måte å lage et `if-else`-uttrykk på med én kodelinje.
pt: Note que o modificador`.foregroundColor(_:)` contém uma sintaxe especial. Isso se chama [operador condicional ternário](glossary://ternary%20conditional%20operator), uma maneira concisa de criar uma instrução `if-else` em uma única linha de código.
sv: Lägg märke till att modifieraren `.foregroundColor(_:)` innehåller en särskild syntax. Den kallas för en [trefaldig villkorlig operator](glossary://ternary%20conditional%20operator) och är ett kortfattat sätt att skapa ett `if-else`-uttryck med en enda kodrad.
th: สังเกตว่าปุ่มปรับค่า `.foregroundColor(_:)` มีไวยากรณ์พิเศษ สิ่งนี้เรียกว่า[ตัวดำเนินการเงื่อนไขแบบสามส่วน](glossary://ternary%20conditional%20operator) ซึ่งเป็นวิธีที่กระชับในการสร้างชุดคำสั่ง `if-else` ในโค้ดบรรทัดเทียว
tr: `.foregroundColor(_:)` niteleyicisinin özel söz dizimi içerdiğine dikkat et. Buna [üçlü koşullu işleç](glossary://ternary%20conditional%20operator) adı verilir, tek kod satırında bir `if-else` ifadesi yaratmanın kısa bir yoludur.
vi: Hãy lưu ý rằng trình sửa đổi `.foregroundColor(_:)` chứa cú pháp đặc biệt. Đây được gọi là một [toán tử điều kiện tam phân](glossary://ternary%20conditional%20operator), một cách ngắn gọn để tạo ra một câu lệnh `if-else` trong một dòng mã đơn nhất.
zh_cn: 注意，`.foregroundColor(_:)`（前景颜色）修饰符包含了特殊的语法，叫做[三元条件运算符](glossary://ternary%20conditional%20operator)。这种简洁的方法可在单行代码中创建 `if-else` 语句。
zh_tw: 請注意，`.foregroundColor(_:)` 修飾符包含特殊語法。這稱為[三元條件運算子](glossary://ternary%20conditional%20operator)，這是一種在單行程式碼中建立 `if-else` 語句的簡潔方法。

source: You can read this code as: if `isOn` is `true`, pass in the value `.yellow`; otherwise, pass in `.black`.
de: Du kannst diesen Code wie folgt lesen: wenn `isOn` den Wert `true` hat, übergib den Wert `.yellow` (gelb), andernfalls übergib `.black` (schwarz).
es: Puedes leer este código de la siguiente manera: si el valor `isOn` es `true`, pasa el valor `.yellow`; de lo contrario, pasa el valor `.black`.
es_419: Puedes leer este código así: si `isOn` es `true`, pasa el valor `.yellow`; si no, pasa el valor `.black`.
fr: Tu peux lire ce code comme suit : si `isOn` est `true`, transmettre la valeur `.yellow`. Sinon, transmettre `.black`.
it: Questo codice può essere letto come segue: se `isOn` è `true`, trasmetti il valore `.yellow`; altrimenti, trasmetti `.black`.
nl: Je kunt deze code lezen als: geef de waarde `.yellow` door als `isOn` de waarde `true` heeft, geef `.black` door als dit niet het geval is.
no: Du kan lese denne koden slik: hvis `isOn` er `true`, overføres verdien `.yellow`. Ellers overføres `.black`.
pt: Você pode ler este código como: se `isOn` for `true`, passe o valor `.yellow`; caso contrário, passe `.black`.
sv: Du kan läsa den här koden så här: om `isOn` är `true` överförs värdet `.yellow`. I annat fall överförs `.black`.
th: คุณสามารถอ่านโค้ดนี้ได้ว่า: ถ้า `isOn` เป็น `true` ให้ส่งผ่านค่า `.yellow` ถ้าไม่ใช่ ให้ส่งผ่านค่า `.black`
tr: Bu kodu şöyle okuyabilirsin: `isOn` `true` ise `.yellow` değerini geçir, değilse `.black` değerini geçir.
vi: Bạn có thể đọc mã này là: nếu `isOn` là `true`, hãy chuyển vào giá trị `.yellow`; nếu không, hãy chuyển vào `.black`.
zh_cn: 你可以将这些代码理解为：如果 `isOn` 为 `true`，传入值 `.yellow`（黄色）；否则传入 `.black`（黑色）。
zh_tw: 此段程式碼可以這樣解讀：如果 `isOn` 為 `true`，則傳入值 `.yellow`，否則，即傳入 `.black`。

source: More generically, this looks like:
de: Allgemeiner gesagt, sieht es so aus:
es: De forma más genérica, se parece a esto:
es_419: En términos generales, se ve así:
fr: De manière plus générique, voilà à quoi cela ressemble :
it: Più genericamente, ecco come risulta:
nl: In meer algemene zin ziet dit er zo uit:
no: Mer generelt ser dette slik ut:
pt: No geral, isso fica assim:
sv: Mer allmänt ser det ut så här:
th: ถ้าเขียนให้กว้างขึ้น โค้ดนี้จะมีลักษณะดังนี้:
tr: Daha genel olarak bu şöyle görünür:
vi: Nói khái quát hơn, mã này trông giống như sau:
zh_cn: 更普通地说，看起来就像这样：
zh_tw: 一般來說，看起來像這樣：

source: Try changing the color of the circle to `.purple` when `isOn` is `true`, and to a lighter shade of green, like `.mint`, when `false`.
de: Versuche, die Farbe des Kreises in `.purple` (lila) zu ändern, wenn `isOn` den Wert `true` hat, und in einen hellen Grünton, `.mint` (minzgrün), wenn er den Wert `false` hat.
es: Prueba a cambiar el color del círculo a `.purple` cuando `isOn` es `true`, y a un tono de verde más claro, como `.mint` cuando es `false`.
es_419: Intenta cambiar el color del círculo a `.purple` cuando `isOn` sea `true`, y a un tono de verde más claro, como `.mint` (menta) cuando sea `false`.
fr: Essaie de définir la couleur du cercle sur `.purple` lorsque `isOn` est `true` et sur une teinte plus claire, comme `.mint`, lorsqu’il est `false`.
it: Prova a cambiare il colore del cerchio in `.purple` quando `isOn` è `true` e in una tonalità più chiara di verde, come `.mint` quando è `false`.
nl: Probeer de kleur van de cirkel te wijzigen in `.purple` wanneer `isOn` de waarde `true` heeft en in een lichtere tint groen, zoals `.mint`, wanneer `isOn` de waarde `false` heeft.
no: Prøv å endre sirkelens farge til `.purple` når `isOn` er `true` og til en lysere nyanse av grønn, for eksempel `.mint`, når den er `false`.
pt: Tente mudar a cor do círculo para `.purple` quando `isOn` for `true`, e para um matiz de verde-claro, como `.mint`, quando for `false`.
sv: Prova att ändra cirkelns färg till `.purple` när `isOn` är `true` och till en ljusare nyans av grönt, exempelvis `.mint`, när den är `false`.
th: ลองเปลี่ยนสีของวงกลมเป็น `.purple` เมื่อ `isOn` เป็น `true` และเปลี่ยนเป็นสีเขียวที่สว่างขึ้น เช่น `.mint` เมื่อเป็น `false`
tr: Dairenin rengini `isOn` `true` olduğunda `.purple` olarak, `false` olduğunda ise `.mint` gibi daha açık bir yeşil tonu olarak değiştir.
vi: Thử thay đổi màu của hình tròn thành `.purple` khi `isOn` là `true` và thành một màu lục sáng hơn, như `.mint` khi là `false`.
zh_cn: 尝试在 `isOn` 为 `true` 时将圆圈的颜色更改为 `.purple`（紫色），为 `false` 时更改为更浅色调的绿色，如 `.mint`（薄荷绿）。
zh_tw: 當 isOn 為 true 時，嘗試將圓圈的顏色更改為 .purple，並且在為 false 時更改為較淺色調的綠色像是 .mint。

source: Add a `shadow(color:radius:)` modifier that shows a different color shadow in each state
de: Modifikator `shadow(color:radius:)` hinzufügen, um für jeden Status einen anderen Farbschatten anzuzeigen
es: Añadir un modificador `shadow(color:radius:)` que muestra un sombreado de un color diferente en cada estado
es_419: Agregar un modificador `shadow(color:radius:)` para mostrar una sombra de otro color en cada estado
fr: Ajouter un modificateur `shadow(color:radius:)` qui présente une ombre de couleur différente dans chaque état
it: Aggiungere un modificatore `shadow(color:radius:)` che mostri l'ombra di colori diversi in ciascuno stato
nl: Voeg een modifier `shadow(color:radius:)` toe die een andere kleurschaduw weergeeft bij elke status
no: Legg til en `shadow(color:radius:)`-modifikator som viser en annen fargeskygge for hver status
pt: Adicione um modificador `shadow(color:radius:)` que mostre uma sombra de cor diferente em cada estado
sv: Lägg till en `shadow(color:radius:)`-modifierare som visar en annorlunda färgskugga för varje status
th: เพิ่มปุ่มปรับค่า `shadow(color:radius:)` ที่แสดงเงาสีต่างๆ ในแต่ละสถานะ
tr: Her durumda farklı bir gölge rengi gösteren bir `shadow(color:radius:)` niteleyicisi ekleme
vi: Thêm một trình sửa đổi `shadow(color:radius:)` hiển thị một bóng đổ màu khác nhau trong mỗi trạng thái
zh_cn: 添加在每种状态中显示不同颜色阴影的 `shadow(color:radius:)` 修饰符
zh_tw: 加入一個 `shadow(color:radius:)` 修飾符，在每一種狀態中顯示不同顏色

source: Just like the `ConditionalViews` example, SwiftUI [observes](glossary://observe) the `isOn` [state property](glossary://state%20property). When the value of `isOn` changes, SwiftUI updates the `Circle` view with the new value for its `.foregroundColor(_:)` modifier.
de: Wie beim `ConditionalViews`-Beispiel [beobachtet](glossary://observe) SwiftUI die [Statuseigenschaft](glossary://state%20property) `isOn`. Wenn sich der Wert von `isOn` ändert, aktualisiert SwiftUI die `Circle`-Ansicht und berücksichtigt den neuen Wert für ihren Modifikator `.foregroundColor(_:)`.
es: Al igual que el ejemplo de `ConditionalViews`, SwiftUI [observa](glossary://observe) la [propiedad de estado](glossary://state%20property) `isOn`. Cuando el valor de `isOn` cambia, SwiftUI actualiza la vista `Circle` con el nuevo valor de su modificador `.foregroundColor(_:)`.
es_419: Al igual que el ejemplo de `ConditionalViews`, SwiftUI [observa](glossary://observe) la [propiedad de estado](glossary://state%20property) `isOn`. Cuando el valor de `isOn` cambia, SwiftUI actualiza la visualización `Circle` con el valor nuevo de su modificador `.foregroundColor(_:)`.
fr: Comme l’exemple `ConditionalViews`, SwiftUI [observe](glossary://observe) la [propriété d’état](glossary://state%20property) de `isOn`. Lorsque la valeur de `isOn` change, SwiftUI met à jour la vue `Circle` avec la nouvelle valeur pour son modificateur `.foregroundColor(_:)`.
it: Proprio come abbiamo visto nell'esempio di `ConditionalViews`, SwiftUI [osserva](glossary://observe) la [proprietà di stato](glossary://state%20property) `isOn` e quando il suo valore cambia, SwiftUI aggiorna la vista `Circle` con il nuovo valore del modificatore `.foregroundColor(_:)`.
nl: Net als in het voorbeeld van `ConditionalViews`, [observeert](glossary://observe) SwiftUI de [statuseigenschap](glossary://state%20property) `isOn`. Wanneer de waarde van `isOn` verandert, werkt SwiftUI de weergave `Circle` bij met de nieuwe waarde voor de modifier `.foregroundColor(_:)`.
no: Akkurat som i eksempelet med `ConditionalViews` [observerer](glossary://observe) SwiftUI [statusegenskapen](glossary://state%20property) `isOn`. Når verdien for `isOn` endres, oppdaterer SwiftUI `Circle`-visningen med den nye verdien for dens `.foregroundColor(_:)`-modifikator.
pt: Assim como no exemplo das `ConditionalViews`, a SwiftUI [observa](glossary://observe) a [propriedade de estado](glossary://state%20property) `isOn`. Quando o valor de `isOn` muda, a SwiftUI atualiza a visualização `Circle` com o novo valor de seu modificador `.foregroundColor(_:)`.
sv: Precis som i exemplet med `ConditionalViews` [observerar](glossary://observe) SwiftUI [statusegenskapen](glossary://state%20property) `isOn`. När värdet för `isOn` ändras uppdaterar SwiftUI `Circle`-vyn med det nya värdet för dess `.foregroundColor(_:)`-modifierare.
th: เช่นเดียวกับตัวอย่าง `ConditionalViews` SwiftUI จะ[สังเกต](glossary://observe)[คุณสมบัติสถานะ](glossary://state%20property) `isOn` เมื่อค่าของ `isOn` เปลี่ยนแปลงไป SwiftUI จะอัปเดตมุมมอง `Circle` ที่มีค่าใหม่สำหรับปุ่มปรับค่า `.foregroundColor(_:)`
tr: Tıpkı `ConditionalViews` örneğinde olduğu gibi, SwiftUI `isOn` [durum özelliğini](glossary://state%20property) [gözlemler](glossary://observe). `isOn` değeri değiştiğinde, SwiftUI `Circle` görüntüsünü `.foregroundColor(_:)` niteleyicisinin yeni değeriyle günceller.
vi: Cũng giống như ví dụ về `ConditionalViews`, SwiftUI [quan sát](glossary://observe) [thuộc tính trạng thái](glossary://state%20property) `isOn`. Khi giá trị của `isOn` thay đổi, SwiftUI cập nhật chế độ xem `Circle` với giá trị mới cho trình sửa đổi `.foregroundColor(_:)`.
zh_cn: 就像 `ConditionalViews`（条件视图）示例一样，SwiftUI 会[观测](glossary://observe) `isOn` [状态属性](glossary://state%20property)。当 `isOn` 的值更改时，SwiftUI 会使用 `.foregroundColor(_:)` 修饰符的新值来更新 `Circle` 视图。
zh_tw: 就像 `ConditionalViews` 的範例一樣，SwiftUI 會[觀察](glossary://observe) `isOn` [狀態屬性](glossary://state%20property)。當 `isOn` 的值發生變化時，SwiftUI 會使用 `.foregroundColor(_:)` 修飾符的新值來更新 `Circle` 顯示區。

source: Next, try adding another modifier, `.shadow(color:radius:)` that uses the `isOn` value to change the view’s shadow.
de: Versuche als Nächstes, den Modifikator `.shadow(color:radius:)` noch einmal einzufügen, der den `isOn`-Wert verwendet, um den Schatten der Ansicht zu ändern.
es: A continuación, prueba a añadir otro modificador, `.shadow(color:radius:)` que use el valor `isOn` para cambiar el sombreado de la vista.
es_419: A continuación, intenta agregar otro modificador, `.shadow(color:radius:)` que use el valor de `isOn` para cambiar la sombra de la visualización.
fr: Ensuite, essaie d’ajouter un autre modificateur, `.shadow(color:radius:)`, qui utilise la valeur de `isOn` pour changer l’ombre de la vue.
it: Ora prova ad aggiungere un altro modificatore, `.shadow(color:radius:)`, che utilizza il valore di `isOn` per modificare l'ombra della vista.
nl: Voeg vervolgens nog een modifier `.shadow(color:radius:)` toe die de waarde van `isOn` gebruikt om de schaduw van de weergave te wijzigen.
no: Prøv deretter å legge til en annen modifikator, `.shadow(color:radius:)`, som bruker `isOn`-verdien til å endre visningens skygge.
pt: A seguir, tente adicionar outro modificador, `.shadow(color:radius:)`, que use o valor de `isOn` para mudar a sombra da visualização.
sv: Prova sedan att lägga till en annan modifierare, `.shadow(color:radius:)`, som använder `isOn`-värdet till att ändra vyns skugga.
th: ถัดไป ให้ลองเพิ่มปุ่มปรับค่าอื่น นั่นคือ `.shadow(color:radius:)` ที่ใช้ค่า `isOn` เพื่อเปลี่ยนเงาของมุมมอง
tr: Sonra, görüntünün gölgesini değiştirmek için `isOn` değerini kullanan başka bir niteleyici (`.shadow(color:radius:)`) eklemeyi dene.
vi: Tiếp theo, hãy thử thêm một trình sửa đổi khác, `.shadow(color:radius:)` sử dụng giá trị `isOn` để thay đổi bóng đổ của chế độ xem.
zh_cn: 下一步，尝试添加另一个修饰符 `.shadow(color:radius:)`，它使用 `isOn` 值来更改视图的阴影。
zh_tw: 接下來，試著加入另一個修飾符 `.shadow(color:radius:)`，它會使用 `isOn` 值來更改顯示區的陰影。

source: First, add the modifier `.shadow(color:radius:)` to `Circle`.
de: Füge zuerst den Modifikator `.shadow(color:radius:)` zu `Circle` hinzu.
es: Primero, añade el modificador `.shadow(color:radius:)` a `Circle` (círculo).
es_419: Primero, agrega el modificador `.shadow(color:radius:)` a `Circle`.
fr: Commence par ajouter le modificateur `.shadow(color:radius:)` à `Circle`.
it: Prima di tutto aggiungi il modificatore `.shadow(color:radius:)` a `Circle`.
nl: Voeg om te beginnen de modifier `.shadow(color:radius:)` aan `Circle` toe.
no: Legg først til modifikatoren `.shadow(color:radius:)` i `Circle`.
pt: Primeiro, adicione o modificador `.shadow(color:radius:)` a `Circle`.
sv: Lägg först till modifieraren `.shadow(color:radius:)` i `Circle`.
th: ก่อนอื่นให้เพิ่มปุ่มปรับค่า `.shadow(color:radius:)` ไปยัง `Circle`
tr: Öncelikle, `.shadow(color:radius:)` niteleyicisini `Circle`’a ekle.
vi: Trước tiên, hãy thêm trình sửa đổi `.shadow(color:radius:)` vào `Circle`.
zh_cn: 首先，将修饰符 `.shadow(color:radius:)` 添加到 `Circle`。
zh_tw: 首先，將修飾符 `.shadow(color:radius:)` 加入 `Circle`。

source: For the modifier’s `color` parameter, use the [ternary conditional operator](glossary://ternary%20conditional%20operator) to change the color of the shadow based on the [state](glossary://state) of `isOn`.
de: Verwende für den `color`-Parameter des Modifikators den [dreigliedrigen bedingten Operator](glossary://ternary%20conditional%20operator), um die Farbe des Schattens zu ändern, je nachdem, welchen [Status](glossary://state) `isOn` hat.
es: Para el parámetro `color` del modificador, usa el [operador condicional ternario](glossary://ternary%20conditional%20operator) para cambiar el color del sombreado en función del [estado](glossary://state) de `isOn`.
es_419: En el parámetro `color` del modificador, usa el [operador condicional ternario](glossary://ternary%20conditional%20operator) para cambiar el color de la sombra utilizando el [estado](glossary://state) de `isOn`.
fr: Pour le paramètre `color` du modificateur, utilise l’[opérateur conditionnel ternaire](glossary://ternary%20conditional%20operator) pour changer la couleur de l’ombre en fonction de l’[état](glossary://state) de `isOn`.
it: Per il parametro `color` del modificatore, utilizza l'[operatore condizionale ternario](glossary://ternary%20conditional%20operator) per modificare il colore dell'ombra sulla base dello [stato](glossary://state) di `isOn`.
nl: Gebruik de [driedelige voorwaardelijke operator](glossary://ternary%20conditional%20operator) voor de parameter `color` van de modifier om de kleur van de schaduw te wijzigen op basis van de [status](glossary://state) van `isOn`.
no: For modifikatorens `color`-parameter bruker du den [tredoble betingede operatoren](glossary://ternary%20conditional%20operator) til å endre skyggens farge basert på [statusen](glossary://state) til `isOn`.
pt: Para o parâmetro `color` do modificador, use o [operador condicional ternário](glossary://ternary%20conditional%20operator) para mudar a cor da sombra com base no [estado](glossary://state) de `isOn`.
sv: För modifierarens `color`-parameter använder du den [trefaldiga villkorliga operatorn](glossary://ternary%20conditional%20operator) till att ändra skuggans färg baserad på [statusen](glossary://state) för `isOn`.
th: สำหรับพารามิเตอร์ `color` ของปุ่มปรับค่า ให้ใช้[ตัวดำเนินการเงื่อนไขแบบสามส่วน](glossary://ternary%20conditional%20operator)เพื่อเปลี่ยนสีของเงาตาม[สถานะ](glossary://state)ของ `isOn`
tr: Niteleyicinin `color` parametresi için `isOn`'un [durumuna](glossary://state) bağlı olarak gölgenin rengini değiştirmek üzere [üçlü koşullu işleci](glossary://ternary%20conditional%20operator) kullanın.
vi: Đối với tham số `color` của trình sửa đổi, hãy sử dụng [toán tử điều kiện tam phân](glossary://ternary%20conditional%20operator) để thay đổi màu của bóng đổ dựa trên [trạng thái](glossary://state) của `isOn`.
zh_cn: 对于修饰符的 `color`（颜色）参数，使用[三元条件运算符](glossary://ternary%20conditional%20operator)，根据 `isOn` 的[状态](glossary://state)来更改阴影的颜色。
zh_tw: 對於修飾符的`color`參數，使用[三元條件運算子](glossary://ternary%20conditional%20operator)來根據`isOn`的[狀態](glossary://state)改變陰影的顏色。

source: The ternary operator syntax looks like this:
de: Die Syntax für den dreigliedrigen Operator sieht so aus:
es: La sintaxis del operador ternario es parecida a esta:
es_419: Aquí tienes un ejemplo de la sintaxis del operador ternario:
fr: La syntaxe de l’opérateur ternaire ressemble à ce qui suit :
it: Ecco la sintassi dell'operatore ternario:
nl: De syntaxis van de driedelige operator ziet er als volgt uit:
no: Syntaksen for en tredobbel operator ser slik ut:
pt: A sintaxe do operador ternário é assim:
sv: Syntaxen för en trefaldig operator ser ut så här:
th: ไวยากรณ์ตัวดำเนินการแบบสามส่วนมีลักษณะดังนี้:
tr: Üçlü işleç söz dizimi şöyle görünür:
vi: Cú pháp toán tử tam phân trông giống như sau:
zh_cn: 三元运算符语法看起来像这样：
zh_tw: 三元運算子語法看起來像這樣：

source: This code snippet can be read as: if `isOn` is `true`, use the value `.indigo`; otherwise, use the value `.orange`.
de: Dieser Codeschnipsel kann wie folgt gelesen werden: Wenn `isOn` den Wert `true` hat, verwende den Wert `.indigo`, und wenn nicht, verwende den Wert `.orange`.
es: Este fragmento de código se puede leer de la siguiente manera: si el valor `isOn` es `true`, usa el valor `.indigo`; de lo contrario, usa el valor `.orange`.
es_419: Este fragmento de código puede leerse así: si `isOn` es `true`, usa el valor `.indigo`; si no, usa el valor `.orange`.
fr: Cet extrait de code peut être lu comme suit : si `isOn` est `true`, utiliser la valeur `.indigo` ; sinon, utiliser la valeur `.orange`.
it: Questo frammento di codice può essere letto come segue: se `isOn` è `true`, utilizza il valore `.indigo`; altrimenti utilizza `.orange`.
nl: Dit codefragment kan worden gelezen als: gebruik de waarde `.indigo` als `isOn` de waarde `true` heeft. Gebruik de waarde `.orange` als dit niet het geval is.
no: Denne kodesnutten kan leses slik: hvis `isOn` er `true`, brukes verdien `.indigo`. Ellers brukes verdien `.orange`.
pt: Esse fragmento de código pode ser interpretado como: se `isOn` for `true`, use o valor `.indigo`; caso contrário, use o valor `.orange`.
sv: Den här kodsnutten kan läsas så här: om `isOn` är `true` används värdet `.indigo` och i annat fall används värdet `.orange`.
th: ส่วนย่อยของโค้ดนี้สามารถอ่านได้ว่า: ถ้า `isOn` เป็น `true` ให้ใช้ค่า `.indigo` ถ้าไม่ใช่ ให้ใช้ค่า `.orange`
tr: Bu kod parçacığı şöyle okunabilir: `isOn` `true` ise `.indigo` değerini kullan; aksi takdirde, `.orange` değerini kullan.
vi: Đoạn mã này có thể được đọc là: nếu `isOn` là `true`, hãy sử dụng giá trị `.indigo`; nếu không, hãy sử dụng giá trị `.orange`.
zh_cn: 这个代码片段可以理解为：如果 `isOn` 为 `true`，将使用值 `.indigo`（靛蓝色）；否则使用值 `.orange`（橙色）。
zh_tw: 這個程式碼片段可以這樣解讀：如果 `isOn` 為 `true`，則使用值 `.indigo`，否則，使用值 `.orange`。

# GuideBook..Guide0..StepUsing a Conditional Modifier..TaskaddScaleModifier..title
source: Change the scale of the circle when tapping the button
de: Größe des Kreises beim Tippen auf eine Taste ändern
es: Cambiar la escala del círculo al tocar el botón
es_419: Cambiar la escala del círculo al tocar el botón
fr: Modifier l’échelle du cercle lorsque le bouton est touché
it: Modificare la scala del cerchio quando viene toccato il pulsante
nl: De grootte van de cirkel wijzigen wanneer op de knop wordt getikt
no: Endre skalaen på sirkelen når du trykker på knappen
pt: Mude a escala do círculo ao tocar no botão
sv: Ändra skalan på cirkeln när du trycker på knappen
th: เปลี่ยนขนาดของวงกลมเมื่อกดปุ่ม
tr: Düğmeye dokunulduğunda dairenin ölçeğini değiştirme
vi: Thay đổi tỷ lệ của hình tròn khi chạm vào nút
zh_cn: 更改轻点按钮时圆圈的缩放比例
zh_tw: 當點按按鈕時改變圓圈的縮放
