Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: A [ForEach](glossary://ForEach) is a structure that [iterates](glossary://iteration) over a [collection](glossary://collection) of data (such as an array) to create views for each element in the collection.
de: [ForEach](glossary://ForEach) ist eine Struktur, die über eine [Sammlung](glossary://collection) von Daten (wie einem Array) [iteriert](glossary://iteration), um Ansichten für jedes Element in der Sammlung zu erstellen.
es: [ForEach](glossary://ForEach) es una estructura que se [itera](glossary://iteration) sobre una [colección](glossary://collection) de datos (como un vector) para crear vistas para cada elemento de la colección.
es_419: Un ciclo [ForEach](glossary://ForEach) es una estructura que [itera](glossary://iteration) para recorrer una [colección](glossary://collection) de datos (como un arreglo) con el objetivo de crear una visualización para cada elemento en la colección.
fr: Un [ForEach](glossary://ForEach) est une structure qui effectue une [itération](glossary://iteration) sur une [collection](glossary://collection) de données (comme un tableau) pour créer des vues pour chaque élément de la collection.
it: [ForEach](glossary://ForEach) è una struttura che effettua un'[iterazione](glossary://iteration) su una [raccolta](glossary://collection) di dati, come, per esempio, un array, per creare viste per ciascun elemento della raccolta.
nl: Een [ForEach](glossary://ForEach) is een structuur die een [verzameling](glossary://collection) gegevens (zoals een array) [doorloopt](glossary://iteration) om weergaven voor elk element in de verzameling aan te maken.
no: En [ForEach](glossary://ForEach) er en struktur som [itererer](glossary://iteration) over en [samling](glossary://collection) med data (for eksempel en matrise) for å lage visninger for hvert element i samlingen.
pt: [ForEach](glossary://ForEach) é uma estrutura que [itera](glossary://iteration) sobre uma [coleção](glossary://collection) de dados (como um vetor) para criar visualizações para cada elemento na coleção.
sv: En [ForEach](glossary://ForEach) är en struktur som [itererar](glossary://iteration) över en [samling](glossary://collection) data (exempelvis en array) för att skapa vyer för varje element i samlingen.
th: [ForEach](glossary://ForEach) เป็นโครงสร้างที่[ทำซ้ำ](glossary://iteration)กับ[คอลเลกชั่น](glossary://collection)ของข้อมูล (เช่น อาร์เรย์) เพื่อสร้างมุมมองสำหรับแต่ละองค์ประกอบในคอลเลกชั่นนั้น
tr: [ForEach](glossary://ForEach), koleksiyondaki her öğe için görüntüler yaratmak üzere (dizi gibi) bir veri [koleksiyonu](glossary://collection) üzerinden [tekrarlayan](glossary://iteration) bir yapıdır.
vi: [ForEach](glossary://ForEach) là một cấu trúc [lặp lại](glossary://iteration) trên một [tập hợp](glossary://collection) dữ liệu (ví dụ như một dãy) để tạo ra các chế độ xem cho từng phần tử trong tập hợp.
zh_cn: [ForEach](glossary://ForEach) 是一个[迭代](glossary://iteration)数据[集合](glossary://collection)（如数组）的结构，为集合中的每个元素创建视图。
zh_tw: [ForEach](glossary://ForEach) 是一種結構，它在會在資料[集合](glossary://collection)（例如陣列）上[反覆運算](glossary://iteration)，為集合中的每一個元件製作顯示區。

source: Add the `ForEach` below your `Section` view to iterate over your `data.creatures` array, creating a custom view to display each creature’s name and emoji:
de: Füge `ForEach` unter der `Section`-Ansicht hinzu, um über das Array `data.creatures` zu iterieren. So erstellst du eine eigene Ansicht, damit du den Namen und das Emoji des jeweiligen Charakters anzeigen kannst:
es: Añade `ForEach` debajo de tu vista `Section` para recorrer en iteración el vector `data.creatures`, creando una vista personalizada para mostrar el nombre y el emoji de cada criatura:
es_419: Agrega el ciclo `ForEach` debajo de tu visualización `Section` para iterar sobre tu arreglo `data.creatures`, creando una visualización personalizada que muestra el nombre y el emoji de cada criatura:
fr: Ajoute le `ForEach` sous ta vue `Section` pour effectuer une itération sur ton tableau `data.creatures`, en créant une vue personnalisée pour afficher le nom et l’Emoji de chaque créature :
it: Aggiungi la struttura `ForEach` sotto la vista `Section` per effettuare l'iterazione sull'array `data.creatures` e creare una vista personalizzata per visualizzare il nome e l'emoji corrispondente a ciascuna creatura:
nl: Voeg de `ForEach` onder de weergave `Section` toe om de array `data.creatures` te doorlopen en zo een aangepaste weergave aan te maken met de naam en de emoji van elk wezen:
no: Legg til `ForEach` nedenfor visningen `Section` for å iterere over matrisen `data.creatures` og dermed opprette en tilpasset visning som viser hver skapnings navn og emoji:
pt: Adicione `ForEach` abaixo da visualização `Section` para iterar no vetor `data.creatures`, criando uma visualização personalizada para mostrar o nome e o emoji de cada criatura:
sv: Lägg till `ForEach` nedanför vyn `Section` för att iterera över arrayen `data.creatures` och därmed skapa en anpassad vy som visar varje varelses namn och emoji:
th: เพิ่ม `ForEach` ใต้มุมมอง `Section` เพื่อทำซ้ำอาร์เรย์ `data.creatures` ของคุณ ซึ่งจะสร้างมุมมองแบบกำหนดเองเพื่อแสดงชื่อและอิโมจิของสิ่งมีชีวิตแต่ละตัว:
tr: Her bir yaratığın adını ve emojisini görüntülemek üzere özel bir görüntü yaratarak `data.creatures` dizininde tekrarlamak için `Section` görüntünün altına `ForEach`’i ekle:
vi: Thêm `ForEach` bên dưới chế độ xem `Section` để lặp lại trên dãy `data.creatures` của bạn, tạo ra một chế độ xem tùy chỉnh để hiển thị tên và biểu tượng của từng sinh vật:
zh_cn: 在 `Section`（部分）视图下方添加 `ForEach`（针对每个）以迭代 `data.creatures`（动物数据）数组，创建显示每个动物名称和表情符号的自定视图：
zh_tw: 在 `Section` 顯示區下方加入 `ForEach` 來反覆運算你的 `data.creatures` 陣列，製作自訂顯示區以顯示每個生物的名稱和表情符號：

source: Remember how `Creature` follows the guidelines of the `Identifiable` protocol? This enables the [ForEach](glossary://ForEach) structure to uniquely identify every creature, even if they have exactly the same emoji character and name. Because it can tell apart even exact twins, this enables SwiftUI to update each view independently without mixing them up.
de: Erinnerst du dich, dass `Creature` den Richtlinien des `Identifiable`-Protokolls folgt? Dadurch kann die [ForEach](glossary://ForEach)-Struktur jeden Charakter eindeutig identifizieren, selbst wenn sie denselben Namen und dasselbe Emoji haben. Da die Schleife eventuelle Zwillinge auseinander halten kann, kann SwiftUI jede Ansicht unabhängig voneinander aktualisieren und Verwechslungen ausschließen.
es: ¿Recuerdas cómo `Creature` sigue el conjunto de pautas del protocolo `Identifiable`? Esto permite que la estructura [ForEach](glossary://ForEach) pueda identificar de forma exclusiva cada criatura, incluso si tienen exactamente el mismo emoji y el mismo nombre. Como puede distinguir incluso a los gemelos idénticos, SwiftUI puede actualizar cada vista de forma independiente sin mezclarlas.
es_419: ¿Recuerdas cómo `Creature` sigue los lineamientos del protocolo `Identifiable`? Esto permite que la estructura [ForEach](glossary://ForEach) identifique cada criatura específicamente, incluso si tienen el mismo emoji o nombre. Dado que puede diferenciar entre gemelos, esto permite a SwiftUI actualizar cada visualización por separado, sin confundirlas.
fr: Te rappelles-tu comment `Creature` suit les consignes du protocole `Identifiable` ? Cela permet à la structure [ForEach](glossary://ForEach) d’identifier de manière unique chaque créature, même si elles présentent exactement le même Emoji et le même nom. Puisqu’elle peut distinguer même des jumeaux parfaitement identiques, cela permet à SwiftUI de mettre à jour chaque vue indépendamment sans les mélanger.
it: Ti ricordi che `Creature` segue le linee guida del protocollo `Identifiable`? Questo protocollo consente alla struttura [ForEach](glossary://ForEach) di identificare in modo univoco ciascuna creatura, anche nel caso in cui il carattere emoji e il nome coincidano perfettamente. In questo modo, SwiftUI è in grado di aggiornare ciascuna vista in modo indipendente l'una dalle altre, senza confonderle.
nl: Weet je nog dat `Creature` voldoet aan de richtlijnen van het protocol `Identifiable`? Hierdoor kan de [ForEach](glossary://ForEach)-structuur elk wezen identificeren, zelfs als ze precies hetzelfde emojiteken en dezelfde naam hebben. Omdat zelfs identieke tweelingen van elkaar kunnen worden onderscheiden, kan SwiftUI alle weergaven onafhankelijk van elkaar bijwerken zonder ze door elkaar te halen.
no: Husker du hvordan `Creature` følger retningslinjene i protokollen `Identifiable`? Dette gjør det mulig for [ForEach](glossary://ForEach)-strukturen å identifisere hver skapning på en unik måte, selv om flere har nøyaktig samme emojitegn og navn. Siden den til og med kan skille tvillinger fra hverandre, kan SwiftUI oppdatere alle visninger hver for seg uten å blande dem sammen.
pt: Você se lembra que `Creature` segue as orientações do protocolo `Identifiable`? Isso permite que a estrutura [ForEach](glossary://ForEach) identifique exclusivamente cada criatura, mesmo que elas tenham exatamente o mesmo caractere de emoji e nome. Por ser capaz de distinguir até mesmo gêmeos idênticos, isso permite que a SwiftUI atualize cada visualização independentemente, sem confundi‑las.
sv: Kommer du ihåg hur `Creature` följer riktlinjerna i protokollet `Identifiable`? Det gör det möjligt för [ForEach](glossary://ForEach)-strukturen att unikt identifiera varenda varelse, även om flera har exakt samma emojitecken och namn. Eftersom den till och med kan skilja på tvillingar kan SwiftUI uppdatera alla vyer fristående utan att blanda ihop dem.
th: จำได้ไหมว่า `Creature` ทำตามแนวทางของโปรโตคอล `Identifiable` สิ่งนี้ทำให้โครงสร้าง [ForEach](glossary://ForEach) สามารถระบุสิ่งมีชีวิตทุกตัวได้อย่างไม่ซ้ำกัน แม้ว่าสิ่งมีชีวิตเหล่านั้นจะมีอักขระอิโมจิและชื่อที่เหมือนกันทุกประการ ความสามารถในการแยกแยะความแตกต่างระหว่างฝาแฝดที่เหมือนกันทุกประการนี้ทำให้ SwiftUI อัปเดตแต่ละมุมมองแยกจากกันได้โดยไม่ผสมปนเปกัน
tr: `Creature`’ın `Identifiable` protokolünün kurallarına nasıl uyduğunu hatırlıyor musun? Bu, [ForEach](glossary://ForEach) yapısının her bir yaratığı tamamen aynı emoji karakterine ve ada sahip olsa bile benzersiz şekilde tanımlamasını sağlar. İkizleri bile ayırabildiği için bu SwiftUI’ın her görüntüyü birbiriyle karıştırmadan ayrı ayrı güncellemesini sağlar.
vi: Bạn có nhớ `Creature` tuân theo các hướng dẫn của giao thức `Identifiable` như thế nào không? Việc này cho phép cấu trúc [ForEach](glossary://ForEach) xác định duy nhất mỗi sinh vật, ngay cả khi chúng có cùng tên và ký tự biểu tượng giống hệt nhau. Vì giao thức này có thể phân biệt ngay cả những cặp đôi giống hệt nhau, nên việc này cho phép SwiftUI cập nhật từng chế độ xem độc lập mà không làm chúng xáo trộn.
zh_cn: 还记得 `Creature` 是如何遵循 `Identifiable` 协议的规则吗？这可让 [ForEach](glossary://ForEach) 结构体唯一识别每个动物，即使它们具有完全相同的表情符号角色和名称。因为它甚至可以区分完全相同的双胞胎，让 SwiftUI 可以独立更新每个视图，而不混淆。
zh_tw: 還記得 `Creature` 是如何依循 `Identifiable` 協定的準則嗎？這能讓 [ForEach](glossary://ForEach) 架構可以唯一地識別每個生物，即使它們具有完全相同的表情符號字元和名稱。因為它甚至可以精確的區分雙胞胎，這使得 SwiftUI 能夠獨立更新每個顯示區，而不會混淆在一起。

source: You may have noticed the `.resizableFont()` modifier used here. This is a custom modifier defined in `ResizableFont.swift` to allow your `Text` view’s font size to scale up to fit the size of the view. Check out the code in that file to see how to create a custom modifier.
de: Dir ist wahrscheinlich der Modifikator `.resizableFont()` aufgefallen, der hier verwendet wird. Dieser spezielle Modifikator wurde in `ResizableFont.swift` definiert und ermöglicht es, die Schriftgröße der `Text`-Ansicht so zu ändern, dass sie zur Größe der Ansicht passt. Sieh dir den Code in der Datei an, um zu erfahren, wie man einen eigenen Modifikator erstellt.
es: Es posible que te hayas fijado en el modificador `.resizableFont()` que se usa aquí. Se trata de un modificador personalizado definido en `ResizableFont.swift` para permitir que el tamaño de la fuente de la vista `Text` se ajuste al tamaño de la vista. Revisa el código de ese archivo para ver cómo crear un modificador personalizado.
es_419: Puede que hayas notado que aquí se usa el modificador `.resizableFont()`. Se trata de un modificador personalizado definido en `ResizableFont.swift` para permitir que el tamaño de letra de tu visualización `Text` se ajuste al tamaño de la visualización. Consulta el código en ese archivo para averiguar cómo crear un modificador personalizado.
fr: Tu as peut-être remarqué le modificateur `.resizableFont()` qui est utilisé. Il s’agit d’un modificateur personnalisé défini dans `ResizableFont.swift` pour permettre à la taille de la police de ta vue `Text` de s’adapter à la taille de la vue. Examine le code dans ce fichier pour voir comment créer un modificateur personnalisé.
it: Probabilmente hai notato che viene usato `.resizableFont()`, un modificatore personalizzato definito in `ResizableFont.swift`, che consente di ingrandire le dimensioni del font della vista `Text` per adattarsi alle dimensioni della vista stessa. Dai un'occhiata la codice nel file per capire come viene creato un modificatore personalizzato.
nl: Je hebt misschien gezien dat hier de modifier `.resizableFont()` wordt gebruikt. Dit is een aangepaste, in `ResizableFont.swift` gedefinieerde modifier waarmee je de lettergrootte van de `Text`-weergave kunt aanpassen aan de grootte van de weergave. Bekijk de code in dat bestand om te zien hoe je een aangepaste modifier aanmaakt.
no: Du har kanskje sett at modifikatoren`.resizableFont()` brukes her. Dette er en tilpasset modifikator som defineres i `ResizableFont.swift`, slik at `Text`-visningens fontstørrelse kan skaleres opp til å passe størrelsen på visningen. Sjekk ut koden i den filen hvis du vil se hvordan du oppretter en tilpasset modifikator.
pt: Talvez você tenha notado o modificador `.resizableFont()` usado aqui. Este é um modificador personalizado, definido em `ResizableFont.swift` para permitir que o tamanho da fonte da visualização `Text` seja aumentado para se ajustar ao tamanho da visualização. Confira o código nesse arquivo para ver como criar um modificador personalizado.
sv: Du kanske har märkt att modifieraren `.resizableFont()` används här. Den är en anpassad modifierare som definieras i `ResizableFont.swift` så att `Text`-vyns typsnittsstorlek kan skalas upp till att passa storleken på vyn. Kolla in koden i den filen om du vill se hur du skapar en anpassad modifierare.
th: คุณอาจสังเกตเห็นว่ามีการใช้ปุ่มปรับค่า `.resizableFont()` ในส่วนนี้ นี่เป็นปุ่มปรับค่าแบบกำหนดเองที่กำหนดไว้ใน `ResizableFont.swift` ที่ทำให้ขนาดแบบอักษรของมุมมอง `Text` ขยายใหญ่ขึ้นเพื่อให้พอดีกับขนาดของมุมมอง ลองดูโค้ดในไฟล์นั้นเพื่อดูวิธีสร้างปุ่มปรับค่าแบบกำหนดเอง
tr: Burada kullanılan `.resizableFont()` niteleyicisini fark etmiş olabilirsin. Bu, `Text` görüntünün font puntosunun görüntünün büyüklüğüne uyacak şekilde yukarıya doğru ölçeklenmesini sağlayan ve `ResizableFont.swift`’te tanımlanan özel bir niteleyicidir. Özel bir niteleyiciyi nasıl yaratabileceğini görmek için o dosyadaki koda bir bak.
vi: Có thể bạn đã nhận thấy trình sửa đổi `.resizableFont()` đã được sử dụng tại đây. Đây là một trình sửa đổi tùy chỉnh được định nghĩa trong `ResizableFont.swift` để cho phép tăng cỡ chữ của chế độ xem `Text` để vừa với kích cỡ của chế độ xem. Hãy kiểm tra mã trong tệp đó để biết cách tạo ra một trình sửa đổi tùy chỉnh.
zh_cn: 你可能已经注意到这里使用的 `.resizableFont()`（可调整尺寸字体）修饰符。这是 `ResizableFont.swift` 中定义的自定修饰符，可让 `Text` 视图的字体大小按比例放大来适应视图的尺寸。查看这个文件中的代码，了解如何创建自定修饰符。
zh_tw: 你可能已經注意到這裡使用的 `.resizableFont()` 修飾符。這是在 `ResizableFont.swift` 中定義的自訂修飾符，能讓你的 `Text` 顯示區字體放大以符合顯示區的大小。請查看檔案中的程式碼以瞭解如何製作自訂修飾符。

# GuideBook..Guide0..StepSharing Data Between Views..TaskaddModelData..title
source: Make your model data accessible to the entire app
de: Modelldaten in der gesamten App verfügbar machen
es: Hacer que los datos de tu modelo sean accesibles en toda la app
es_419: Hacer que el modelo de datos sea accesible para toda la app
fr: Rendre les données du modèle accessibles à toute l’app
it: Rendere il tuo modello di dati accessibile all'intera app
nl: De gegevens van je model toegankelijk maken voor de hele app
no: Gjør modelldata tilgjengelig i hele appen
pt: Torne o modelo de dados acessível ao app inteiro
sv: Gör modelldata tillgängliga i hela appen
th: ทำให้ข้อมูลโมเดลของคุณเข้าถึงได้ทั้งแอป
tr: Model verilerini tüm uygulama tarafından erişilebilir hâle getirme
vi: Làm cho dữ liệu mô hình của bạn có thể truy cập được trong toàn bộ ứng dụng
zh_cn: 让模型数据可在整个 App 中访问
zh_tw: 讓你的模型資料能讓整個 App 取用

source: Now that you’ve successfully used your observable object data in a single view, it’s time to share that data with the entire app from `MyApp.swift`.
de: Du hast schon erfolgreich die beobachtbaren Objektdaten in einer Ansicht verwendet. Jetzt ist es an der Zeit, diese Daten mit der gesamten App aus `MyApp.swift` zu teilen.
es: Ahora que has usado los datos de tu objeto observable en una sola vista correctamente, es hora de compartir esos datos con toda la app desde `MyApp.swift`.
es_419: Ahora que has usado con éxito los datos de tu objeto observable en una sola visualización, es hora de compartir esos datos con toda la app desde `"MyApp.swift"`.
fr: Maintenant que tu as bien utilisé les données de ton objet observable dans une vue unique, il est temps de partager ces données avec l’ensemble de l’app depuis `MyApp.swift`.
it: Adesso che hai imparato a utilizzare i dati dell'oggetto osservabile in una vista singola, è arrivato il momento di condividere gli stessi dati con l'intera app da `MyApp.swift`.
nl: Nu het je is gelukt om de gegevens van je observeerbare object in één weergave te gebruiken, is het tijd om deze gegevens met de hele app uit `MyApp.swift` te delen.
no: Nå når du har brukt de observerbare objektdataene i én visning, er det på tide å dele disse dataene med hele appen fra `MyApp.swift`.
pt: Agora que você conseguiu usar com sucesso os dados do seu objeto observável em uma única visualização, é hora de compartilhar esses dados com todo o app a partir de `MyApp.swift`.
sv: Nu när du har använt dina observerbara objektdata i en enda vy är det dags att dela dessa data med hela appen från `MyApp.swift`.
th: ตอนนี้เมื่อคุณได้ใช้ข้อมูลวัตถุที่สังเกตเห็นได้ในมุมมองเดียวสำเร็จแล้ว ก็ถึงเวลาแชร์ข้อมูลนั้นกับทั้งแอปจาก `MyApp.swift`
tr: Gözlemlenebilir nesne verilerini tek bir görüntüde başarılı bir şekilde kullandığına göre, artık bu verileri `MyApp.swift`’teki tüm uygulama ile paylaşmanın zamanı geldi.
vi: Bây giờ bạn đã sử dụng thành công dữ liệu đối tượng có thể quan sát của mình trong một chế độ xem đơn nhất, đã đến lúc chia sẻ dữ liệu đó với toàn bộ ứng dụng từ `MyApp.swift`.
zh_cn: 既然你已成功在单个视图中使用了可观测对象数据，是时候从 `MyApp.swift` 中与整个 App 共享这些数据了。
zh_tw: 現在你已經在單一顯示區中成功使用了可觀察的物件資料，是時候從 `MyApp.swift` 與整個 App共享這些資料了。

source: To make your data accessible to the entire app:
de: Der gesamten App Zugriff auf die Daten ermöglichen:
es: Para hacer que tus datos sean accesibles en toda la app:
es_419: Para hacer que tus datos sean accesibles para toda la app:
fr: Pour rendre tes données accessibles à l’ensemble de l’app :
it: Per rendere i dati accessibili dall'intera app:
nl: Je gegevens toegankelijk maken voor de hele app:
no: Slik gjør du dataene tilgjengelig i hele appen:
pt: Para tornar os dados acessíveis ao app inteiro:
sv: Så här gör du data tillgängliga i hela appen:
th: ในการทำให้ข้อมูลของคุณเข้าถึงได้ทั้งแอป:
tr: Verilerini tüm uygulama tarafından erişilebilir hâle getirmek için:
vi: Để có thể truy cập dữ liệu của bạn trong toàn bộ ứng dụng:
zh_cn: 若要让数据在整个 App 中可访问：
zh_tw: 若要讓你的資料可供整個 App 取用：

source: Create an instance of `CreatureZoo` as a [state object](glossary://state%20object) in `MyApp`.
de: Erstelle eine Instanz von `CreatureZoo` als [Statusobjekt](glossary://state%20object) in `MyApp`.
es: Crea una instancia de `CreatureZoo` como [objeto de estado](glossary://state%20object) en `MyApp`.
es_419: Crea una instancia de `CreatureZoo` como un [objeto de estado](glossary://state%20object) en `MyApp`.
fr: Crée une instance de `CreatureZoo` en tant qu’[objet d’état](glossary://state%20object) dans `MyApp`.
it: Crea un'istanza di `CreatureZoo` come un [oggetto di stato](glossary://state%20object) in `MyApp`.
nl: Maak een instantie van `CreatureZoo` aan als een [statusobject](glossary://state%20object) in `MyApp`.
no: Opprett en instans av `CreatureZoo` som et [statusobjekt](glossary://state%20object) i `MyApp`.
pt: Crie uma instância de `CreatureZoo` como um [objeto de estado](glossary://state%20object) em `MyApp`.
sv: Skapa en instans av `CreatureZoo` som ett [statusobjekt](glossary://state%20object) i `MyApp`.
th: สร้างชื่อแทนประเภทของ `CreatureZoo` เป็น[วัตถุสถานะ](glossary://state%20object)ใน `MyApp`
tr: `MyApp`’te [durum nesnesi](glossary://state%20object) olarak bir `CreatureZoo` örneği yarat.
vi: Tạo ra một thể hiện của `CreatureZoo` dưới dạng một [đối tượng trạng thái](glossary://state%20object) trong `MyApp`.
zh_cn: 在 `MyApp` 中，创建一个 `CreatureZoo` 的实例作为[状态对象](glossary://state%20object)。
zh_tw: 在 `MyApp` 中建立一個 `CreatureZoo` 實例作為[狀態物件](glossary://state%20object)。

source: Pass it into your [top-level view](glossary://top-level%20view), `NavigationStack`, as an [environment object](glossary://environment%20object).
de: Übergib sie an die [oberste Ansicht](glossary://top-level%20view) `NavigationStack` als [Umgebungsobjekt](glossary://environment%20object).
es: Pásala a tu [vista de nivel superior](glossary://top-level%20view), la pila de navegación (`NavigationStack`), como un [objeto de entorno](glossary://environment%20object).
es_419: Pásala a tu [visualización principal](glossary://top-level%20view), `NavigationStack`, como un [objeto de entorno](glossary://environment%20object).
fr: Transmets-les à ta [vue au plus haut niveau](glossary://top-level%20view), `NavigationStack`, en tant qu’[objet d’environnement](glossary://environment%20object).
it: Trasmettilo alla [vista di livello superiore](glossary://top-level%20view), `NavigationStack`, come un [oggetto ambiente](glossary://environment%20object).
nl: Geef het door aan je [weergave op het hoogste niveau](glossary://top-level%20view), `NavigationStack`, als een [omgevingsobject](glossary://environment%20object).
no: Overfør den til [toppnivåvisningen](glossary://top-level%20view), `NavigationStack`, som et [miljøobjekt](glossary://environment%20object).
pt: Passe‑a para a [visualização de nível superior](glossary://top-level%20view), `NavigationStack`, como um [objeto de ambiente](glossary://environment%20object).
sv: Överför till [vyn på översta nivån](glossary://top-level%20view), `NavigationStack`, som ett [miljöobjekt](glossary://environment%20object).
th: ส่งผ่านไปยัง[มุมมองระดับบนสุด](glossary://top-level%20view)ของคุณ หรือก็คือ `NavigationStack` เป็น[วัตถุสภาพแวดล้อม](glossary://environment%20object)
tr: `NavigationStack` [üst düzey görüntünü](glossary://top-level%20view) bir [ortam nesnesi](glossary://environment%20object) olarak geçir.
vi: Hãy chuyển dữ liệu vào [chế độ xem cấp cao nhất](glossary://top-level%20view) của bạn, `NavigationStack`, dưới dạng một [đối tượng môi trường](glossary://environment%20object).
zh_cn: 将它作为[环境对象](glossary://environment%20object)传入[顶层视图](glossary://top-level%20view) `NavigationStack`。
zh_tw: 傳入你的[最上層顯示區](glossary://top-level%20view) `NavigationStack` 作為[環境物件](glossary://environment%20object)。
