Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Now that you have access to your app data, it’s time to build something fun with it. First, you’ll stack all your creatures on top of each other, then, whenever you tap one, they’ll scatter in different directions.
de: Super, der Zugriff auf deine App-Daten ist nun möglich. Jetzt ist es an der Zeit, etwas Tolles damit zu machen. Im nächsten Schritt stapelst du alle Charaktere übereinander und wenn du auf einen davon tippst, fliegen sie alle in verschiedene Richtungen.
es: Ahora que tienes acceso a los datos de tu app, es el momento de crear algo divertido con ellos. En primer lugar, apilarás todas tus criaturas una encima de otra y luego, cada vez que toques una, se dispersarán en diferentes direcciones.
es_419: Ahora que tienes acceso a los datos de tu app, es hora de crear algo divertido con ellos. Primero, debes apilar todas tus criaturas una encima de otra, y luego, cuando toques una, se deben dispersar en diferentes direcciones.
fr: Maintenant que tu as accès aux données de ton app, il est temps de créer quelque chose d’amusant avec. Tu vas commencer par empiler toutes tes créatures les unes sur les autres. Ensuite, dès que tu en toucheras une, elles se disperseront dans différentes directions.
it: Ora che hai accesso ai dati dell'app, è arrivato il momento di usarli per creare qualcosa di divertente. Innanzitutto, potresti mettere le tue creature una sopra l'altra e poi, quando ne tocchi una, farle disperdere in tante direzioni diverse.
nl: Nu je toegang tot je appgegevens hebt, is het tijd om daar iets leuks mee te doen. Eerst stapel je al je wezens op elkaar en als je vervolgens op een wezen tikt, verspreiden ze zich in alle richtingen.
no: Nå når du har tilgang til appdataene, er det på tide å bygge noe gøy med dem. Først stabler du alle skapningene oppå hverandre, og deretter spres de i ulike retninger når du trykker på en av dem.
pt: Agora que você tem acesso aos dados do app, chegou a hora de criar algo divertido com isso. Primeiro, você empilhará todas as criaturas uma sobre a outra e, depois, sempre que tocar em uma delas, elas se espalharão em direções diferentes.
sv: Nu när du har tillgång till dina appdata är det dags att bygga något roligt med dem. Först travar du alla varelserna ovanpå varandra, och sedan skingras de i olika riktningar när du trycker på en av dem.
th: ตอนนี้เมื่อคุณสามารถเข้าถึงข้อมูลแอปของคุณได้แล้ว ถึงเวลาที่จะสร้างอะไรสนุกๆ กับสิ่งนี้กันแล้ว ก่อนอื่น คุณจะนำสิ่งมีชีวิตทั้งหมดของคุณมาซ้อนทับกัน จากนั้น ทุกครั้งที่คุณแตะสิ่งมีชีวิตเหล่านั้น สิ่งมีชีวิตจะกระจายออกไปในทิศทางต่างๆ
tr: Artık uygulama verilerine erişimin olduğuna göre bunlarla eğlenceli bir şeyler oluşturma zamanı. Öncelikle, yaratıklarının tümünü üst üste yığacaksın, sonra bunlardan birine her dokunduğunda yaratıklar farklı yönlere dağılacaklar.
vi: Bây giờ bạn đã có quyền truy cập vào dữ liệu ứng dụng, đã đến lúc xây dựng một thứ gì đó thú vị với dữ liệu đó. Trước tiên, bạn sẽ xếp chồng tất cả các sinh vật của mình lên nhau, sau đó, bất kỳ lúc nào bạn chạm vào một sinh vật, chúng sẽ phân tán theo các hướng khác nhau.
zh_cn: 你现在可以访问 App 数据了。接下来用它来构建一些有趣的东西吧。首先，你需要将所有动物一个个堆叠在一起，然后在你轻点一个动物时，它们会朝不同的方向散开。
zh_tw: 現在你可以取用你的 App 資料了。是時候用來建構一些有趣的東西了。首先，你將所有的生物堆疊在一起；然後，每當你點按它們時，它們就會朝不同的方向散開來。

source: Add this code inside your `VStack`:
de: Füge diesen Code in den `VStack` ein:
es: Añade este código a la pila `VStack`:
es_419: Agrega este código dentro de `VStack`:
fr: Ajoute ce code dans ta `VStack` :
it: Aggiungi questo codice al tuo `VStack`:
nl: Voeg deze code toe in de `VStack`:
no: Legg til denne koden inni `VStack`:
pt: Adicione este código dentro do `VStack`:
sv: Lägg till den här koden inuti `VStack`:
th: เพิ่มโค้ดนี้ภายใน `VStack` ของคุณ`:
tr: Bu kodu `VStack`’inin içine ekle:
vi: Thêm mã này bên trong `VStack` của bạn:
zh_cn: 在 `VStack`（垂直堆叠）内添加这些代码：
zh_tw: 在你的 `VStack` 內加入這段程式碼`：

source: Understanding the animation code
de: Wie der Animationscode funktioniert
es: Entender el código de la animación
es_419: Cómo funciona el código de animación
fr: Comprendre le code d’animation
it: Capire il codice delle animazioni
nl: Hoe de code voor animaties werkt
no: Forstå animasjonskoden
pt: Entendendo o código de animação
sv: Förstå animeringskoden
th: การทำความเข้าใจโค้ดภาพเคลื่อนไหว
tr: Canlandırma kodunu anlama
vi: Tìm hiểu về mã hiệu ứng chuyển động
zh_cn: 了解动画代码
zh_tw: 瞭解動畫程式碼

source: To create this animation, a [ForEach](glossary://ForEach) iterates through each of your creatures in `CreatureZoo.creatures`, creating a `Text` view for each one.
de: Um die Animation zu erstellen, iteriert eine [ForEach](glossary://ForEach)-Schleife über alle Charaktere in `CreatureZoo.creatures` und es wird für jeden einzelnen eine `Text`-Ansicht erstellt.
es: Para crear esta animación, se itera un bucle [ForEach](glossary://ForEach) por cada una de las criaturas en `CreatureZoo.creatures`, creando una vista `Text` para cada una.
es_419: Para crear esta animación, un ciclo [ForEach](glossary://ForEach) itera cada una de tus criaturas en `CreatureZoo.creatures`, y crea una visualización `Text` para cada una.
fr: Pour créer cette animation, un [ForEach](glossary://ForEach) effectue une itération pour chacune de tes créatures dans `CreatureZoo.creatures`, ce qui crée une vue `Text` pour chacune.
it: Per creare questa animazione, un ciclo [ForEach](glossary://ForEach) esegue l'iterazione per ognuna delle tue creature in `CreatureZoo.creatures`, creando una vista `Text` per ciascuna di esse.
nl: Om deze animatie aan te maken, itereert een [ForEach](glossary://ForEach) door elk van je wezens in `CreatureZoo.creatures`, waarbij voor elk wezen een `Text`-weergave wordt aangemaakt.
no: For å opprette denne animasjonen itererer [ForEach](glossary://ForEach) gjennom alle skapningene i `CreatureZoo.creatures` og lager en `Text`-visning for hver av dem.
pt: Para criar esta animação, um [ForEach](glossary://ForEach) itera em todas as criaturas em `CreatureZoo.creatures`, criando uma visualização `Text` para cada uma.
sv: För att skapa den här animeringen itererar [ForEach](glossary://ForEach) genom alla varelserna i `CreatureZoo.creatures` och skapar en `Text`-vy för var och en.
th: ในการสร้างภาพเคลื่อนไหวนี้ [ForEach](glossary://ForEach) จะทำซ้ำผ่านสิ่งมีชีวิตแต่ละตัวของคุณใน `CreatureZoo.creatures` ซึ่งจะสร้างมุมมอง `Text` สำหรับแต่ละตัว
tr: [ForEach](glossary://ForEach), bu canlandırmayı yaratmak amacıyla `CreatureZoo.creatures`’daki yaratıklarının her biri için bir `Text` görüntüsü yaratarak bunların her birinde tekrarlanır.
vi: Để tạo ra hiệu ứng chuyển động này, một [ForEach](glossary://ForEach) lặp lại thông qua từng sinh vật của bạn trong `CreatureZoo.creatures`, tạo ra một chế độ xem `Text` cho từng sinh vật.
zh_cn: 若要制作这个动画，[ForEach](glossary://ForEach) 需要迭代 `CreatureZoo.creatures`（动物园动物）中的每一个动物，为每个动物创建一个 `Text` 视图。
zh_tw: 為了製作這個動畫，[ForEach](glossary://ForEach)會反覆運算 `CreatureZoo.creatures` 中的每個生物，為每個生物製作一個 `Text` 顯示區。

source: The `Text` view uses the creature’s `offset` and `rotation` [properties](glossary://property) as arguments to the `.offset` and `.rotationEffect` modifiers.
de: Die `Text`-Ansicht verwendet die [Eigenschaften](glossary://property) `offset` und `rotation` des Charakters als Argument für die Modifikatoren `.offset` und `.rotationEffect`.
es: La vista `Text` usa las [propiedades](glossary://property) `offset` y `rotation` de la criatura como argumentos de los modificadores `.offset` y `.rotationEffect`.
es_419: La visualización `Text` usa las [propiedades](glossary://property) `offset` y `rotation` como argumentos de los modificadores `.offset` y `.rotationEffect`.
fr: La vue `Text` utilise les [propriétés](glossary://property) `offset` et `rotation` de la créature comme arguments pour les modificateurs `.offset` et `.rotationEffect`.
it: La vista `Text` utilizza le [proprietà](glossary://property) `offset` e `rotation` come argomenti dei modificatori `.offset` e `.rotationEffect`.
nl: In de `Text`-weergave worden de [eigenschappen](glossary://property) `offset` en `rotation` als argument gebruikt voor de modifiers `.offset` en `.rotationEffect`.
no: `Text`-visningen bruker skapningens [egenskaper](glossary://property) `offset` og `rotation` som argumenter for modifikatorene `.offset` og `.rotationEffect`.
pt: A visualização `Text` usa as [propriedades](glossary://property) `offset` e `rotation` das criaturas como argumentos para os modificadores `.offset` e `.rotationEffect`.
sv: `Text`-vyn använder varelsens [egenskaper](glossary://property) `offset` och `rotation` som argument för modifierarna `.offset` och `.rotationEffect`.
th: มุมมอง `Text` จะใช้[คุณสมบัติ](glossary://property) `offset` และ `rotation` เป็นอาร์กิวเมนต์ไปยังปุ่มปรับค่า `.offset` และ `.rotationEffect`
tr: `Text` görüntüsü yaratığın `offset` ve `rotation` [özelliklerini](glossary://property) `.offset` ve `.rotationEffect` niteleyicilerine argüman olarak kullanır.
vi: Chế độ xem `Text` sử dụng các [thuộc tính](glossary://property) `offset` và `rotation` của sinh vật dưới dạng các đối số cho các trình sửa đổi `.offset` và `.rotationEffect`.
zh_cn: `Text` 视图使用动物的 `offset` 和 `rotation` [属性](glossary://property)作为 `.offset` 和 `.rotationEffect`（旋转效果）修饰符的实参。
zh_tw: `Text` 顯示區使用生物的 `offset` 和 `rotation` [屬性](glossary://property)作為 `.offset` 和 `.rotationEffect` 修飾符的引數。

source: Because `CreatureZoo.creatures` is a [published value](glossary://published%20value), SwiftUI updates the `DancingCreatures` view whenever a creature’s `offset` or `rotation` changes.
de: Da `CreatureZoo.creatures` ein [veröffentlichter Wert](glossary://published%20value) ist, wird die Ansicht `DancingCreatures` durch SwiftUI jedes Mal aktualisiert, wenn sich `offset` oder `rotation` des Charakters ändert.
es: Dado que `CreatureZoo.creatures` es un [valor publicado](glossary://published%20value), SwiftUI actualiza la vista `DancingCreatures` cada vez que cambien los valores `offset` o `rotation` de una criatura.
es_419: Dado que `CreatureZoo.creatures` es un [valor publicado](glossary://published%20value), SwiftUI actualiza la visualización `DancingCreatures` cada vez que se modifican los valores de `offset` o `rotation` de una criatura.
fr: Puisque `CreatureZoo.creatures` est une [vue publiée](glossary://published%20value), SwiftUI met à jour la vue `DancingCreatures` dès que les propriétés `offset` ou `rotation` d’une créature changent.
it: Poiché `CreatureZoo.creatures` è un [valore pubblicato](glossary://published%20value), SwiftUI aggiorna la vista `DancingCreatures` ogni qualvolta le proprietà `offset` o `rotation` cambiano.
nl: Omdat `CreatureZoo.creatures` een [gepubliceerde waarde](glossary://published%20value) is, werkt SwiftUI de weergave `DancingCreatures` bij wanneer de `offset` of `rotation` van een wezen verandert.
no: Siden `CreatureZoo.creatures` er en [publisert verdi](glossary://published%20value), oppdaterer SwiftUI visningen for `DancingCreatures` så snart en skapnings `offset` eller `rotation` endres.
pt: Como `CreatureZoo.creatures` é um [valor publicado](glossary://published%20value), a SwiftUI atualiza a visualização `DancingCreatures` sempre que o `offset` ou `rotation` de uma criatura muda.
sv: Eftersom `CreatureZoo.creatures` är ett [publicerat värde](glossary://published%20value) uppdaterar SwiftUI vyn för `DancingCreatures` så fort en varelses `offset` eller `rotation` ändras.
th: เนื่องจาก `CreatureZoo.creatures` เป็น[ค่าที่เผยแพร่](glossary://published%20value) SwiftUI จะอัปเดตมุมมอง `DancingCreatures` ทุกครั้งที่ `offset` หรือ `rotation` ของสิ่งมีชีวิตเปลี่ยนแปลงไป
tr: `CreatureZoo.creatures` [yayımlanan değer](glossary://published%20value) olduğundan bir yaratığın `offset` veya `rotation` değeri değiştiğinde SwiftUI, `DancingCreatures` görüntüsünü günceller.
vi: Vì `CreatureZoo.creatures` là một [giá trị đã đăng](glossary://published%20value) nên SwiftUI cập nhật chế độ xem `DancingCreatures` bất kỳ lúc nào `offset` hoặc `rotation` của một sinh vật thay đổi.
zh_cn: 由于 `CreatureZoo.creatures` 是一个[发布值](glossary://published%20value)，SwiftUI 会在动物的 `offset` 或 `rotation` 更改时更新 `DancingCreatures` 视图。
zh_tw: 因為 `CreatureZoo.creatures` 是一個[發佈的數值](glossary://published%20value)，每當生物的 `offset` 或 `rotation` 改變時，SwiftUI 即會更新 `DancingCreatures` 顯示區。

source: The `.onTapGesture` modifier runs some code whenever you tap the view. When tapped, `data.randomizeOffsets()` changes the `offset` and `rotation` values for each creature, allowing the view to update each creature to its new location and rotation.
de: Der Modifikator `.onTapGesture` führt Code aus, wenn auf die Ansicht getippt wird. In diesem Fall ändert `data.randomizeOffsets()` die Werte `offset` und `rotation` für den jeweiligen Charakter. Dadurch kann die Ansicht die Position und Rotation jedes Charakters aktualisieren.
es: El modificador `.onTapGesture` ejecuta un código cada vez que tocas la vista. Cuando se toca, `data.randomizeOffsets()` cambia los valores `offset` y `rotation` de cada criatura, lo que permite a la vista actualizar cada criatura a su nueva ubicación y rotación.
es_419: El modificador `.onTapGesture` ejecuta código cada vez que se toca la visualización. Cuando se toca, `data.randomizeOffsets()` cambia los valores de `offset` y `rotation` de cada criatura, lo cual permite que la visualización actualice cada criatura a su nueva ubicación y rotación.
fr: Le modificateur `.onTapGesture` exécute du code lorsque tu touches la vue. Lorsque c’est le cas, `data.randomizeOffsets()` change les valeurs `offset` et `rotation` pour chaque créature, ce qui permet à la vue de mettre à jour chaque créature selon son nouvel emplacement et sa rotation.
it: Il modificatore `.onTapGesture` esegue del codice ogni volta che tocchi la vista. Quando viene toccata, `data.randomizeOffsets()` modifica i valori `offset` e `rotation` di ciascuna creatura, consentendo alla vista di aggiornare il loro aspetto con la loro nuova posizione e il grado di rotazione.
nl: De modifier `.onTapGesture` voert code uit wanneer je op de weergave tikt. Nadat erop is getikt, verandert `data.randomizeOffsets()` de waarden `offset` en `rotation` voor elk wezen zodat de locatie en rotatie van elk wezen kunnen worden bijgewerkt in de weergave.
no: Modifikatoren `.onTapGesture` kjører en kode hver gang du trykker på visningen. Når den blir trykt på, endrer `data.randomizeOffsets()` verdiene `offset` og `rotation` for alle skapninger, slik at visningen kan oppdatere hver skapning til dets nye sted og rotasjon.
pt: O modificador `.onTapGesture` executa um código sempre que a visualização é tocada. Quando tocada, `data.randomizeOffsets()` muda os valores de `offset` e `rotation` de cada criatura, permitindo que a visualização atualize cada criatura para uma nova localização e rotação.
sv: Modifieraren `.onTapGesture` kör en kod varje gång du trycker på vyn. När den blir tryckt på ändrar `data.randomizeOffsets()` värdena `offset` och `rotation` för alla varelser så att vyn kan uppdatera varenda varelse till dess nya plats och rotation.
th: ปุ่มปรับค่า `.onTapGesture` สามารถรันบางโค้ดได้ตลอดเวลาที่คุณแตะมุมมอง เมื่อแตะแล้ว `data.randomizeOffsets()` จะเปลี่ยนค่า `offset` และ `rotation` สำหรับสิ่งมีชีวิตแต่ละตัว ทำให้มุมมองสามารถอัปเดตสิ่งมีชีวิตแต่ละตัวไปยังตำแหน่งและการหมุนใหม่ได้
tr: `.onTapGesture` niteleyicisi, görüntüye her dokunduğunda bazı kodlar çalıştırır. Dokunulduğunda, `data.randomizeOffsets()` her yaratığın `offset` ve `rotation` değerlerini değiştirerek görüntünün her yaratığı yeni konumu ve yönü ile güncellemesini sağlar.
vi: Trình sửa đổi `.onTapGesture` chạy một số mã bất kỳ lúc nào bạn chạm vào chế độ xem. Khi được chạm, `data.randomizeOffsets()` thay đổi các giá trị `offset` và `rotation` cho từng sinh vật, cho phép chế độ xem cập nhật từng sinh vật đến vị trí và hướng xoay mới.
zh_cn: `.onTapGesture`（轻点手势）修饰符会在你轻点视图时运行一些代码。轻点时，`data.randomizeOffsets()`（数据随机化偏移）会更改每个动物的 `offset` 和 `rotation` 值，以允许视图将每个动物更新到它的新位置和旋转方向。
zh_tw: `.onTapGesture` 修飾符會在你每次點按顯示區時執行一些程式碼。點按時，`data.randomizeOffsets()` 會改變每個生物的 `offset` 和 `rotation` 值，允許顯示區將每個生物更新到其新的位置和旋轉。

source: Animate the creatures
de: Charaktere animieren
es: Animar las criaturas
es_419: Animar las criaturas
fr: Animer les créatures
it: Animare le creature
nl: De wezens animeren
no: Animer skapningene
pt: Anime as criaturas
sv: Animera varelserna
th: ทำให้สิ่งมีชีวิตเคลื่อนไหว
tr: Yaratıkları canlandırma
vi: Tạo hiệu ứng cho các sinh vật
zh_cn: 给动物赋予动画
zh_tw: 以動畫呈現生物

source: Try tapping the view.
de: Tippe auf die Ansicht.
es: Prueba a tocar la vista.
es_419: Intenta tocar la visualización.
fr: Essaie de toucher la vue.
it: Prova a toccare la vista.
nl: Tik op de weergave.
no: Prøv å trykke på visningen.
pt: Experimente tocar na visualização.
sv: Prova att trycka på vyn.
th: ลองแตะมุมมอง
tr: Görüntüye dokunmayı dene.
vi: Thử chạm vào chế độ xem.
zh_cn: 尝试轻点视图。
zh_tw: 試著點一下顯示區。

source: The creatures are moving, but its not very interesting looking. Next, you’ll animate them to their new positions for a dancier vibe.
de: Die Charaktere bewegen sich zwar, aber so richtig spannend sieht das noch nicht aus. Daher animierst du sie im nächsten Schritt auf dem Weg zu ihrer neuen Position, um ihnen mehr Groove zu verleihen.
es: Las criaturas se mueven, pero su aspecto no es muy interesante. A continuación, las animarás a sus nuevas posiciones para darles un aire más bailón.
es_419: Las criaturas se están moviendo, pero no lo hacen con gracia. Ahora, anímalas para que cuando cambien a su nueva posición lo hagan con estilo.
fr: Les créatures bougent, mais leur mouvement n’est pas très intéressant. Par la suite, tu vas les animer vers leur nouvel emplacement pour créer un mouvement plus dansant.
it: Le creature si stanno muovendo, ma il risultato non è molto interessante. Nella prossima attività le animerai in modo da creare un effetto più ballerino.
nl: De wezens bewegen wel, maar het ziet er niet erg interessant uit. Daarom ga je hierna een animatie maken zodat de wezens naar hun nieuwe positie dansen.
no: Skapningene beveger faktisk på seg, men det ser ikke spesielt bra ut. Nå skal du animere dem til sine nye posisjoner for å få en mer dansende følelse.
pt: As criaturas estão se movendo, mas o visual não é muito interessante. A seguir, você as animará para suas novas posições com um clima mais dançante.
sv: Varelserna rör faktiskt på sig, men det ser inte särskilt kul ut. Härnäst animerar du dem till sina nya platser för en mer dansant känsla.
th: สิ่งมีชีวิตกำลังเคลื่อนไหว แต่ดูไม่น่าสนใจนัก ถัดไป คุณจะได้ทำให้สิ่งมีชีวิตเคลื่อนไหวไปยังตำแหน่งใหม่ของตัวเองเพื่อให้ดูน่าตื่นเต้นยิ่งขึ้น
tr: Yaratıklar hareket ediyor ancak pek de ilginç değiller. Bundan sonra, dans havası katmak için onları yeni konumlarına canlandırarak götüreceksin.
vi: Các sinh vật đang di chuyển, nhưng nhìn chúng không thú vị lắm. Tiếp theo, bạn sẽ tạo hiệu ứng cho chúng đến các vị trí mới để có động tác nhảy múa đẹp hơn.
zh_cn: 这些动物正在移动，但看起来却不是特别有趣。下一步，你将用动画让动物跳着舞移到它们的新位置。
zh_tw: 這些生物正在移動，但是看起來不是很有趣。接下來，你將用動畫讓它們移動到新的位置，以呈現更動感的氛圍。

source: To animate the creatures to a new position, you need to tell SwiftUI which animation to use and which value to animate. In this case, you want to animate each creature’s `offset` property.
de: Um die Charaktere auf ihrem Weg zur neuen Position zu animieren, musst du SwiftUI mitteilen, welche Animation verwendet und welcher Wert animiert werden soll. In diesem Fall soll die Eigenschaft `offset` (Versatz) des jeweiligen Charakters animiert werden.
es: Para animar las criaturas a una nueva posición, tienes que indicarle a SwiftUI qué animación usar y qué valor animar. En este caso, quieres animar la propiedad `offset` de cada criatura.
es_419: Para animar las criaturas conforme se mueven a una nueva posición, necesitas indicarle a SwiftUI qué animación usar y qué valor animar. En este caso, debes animar la propiedad `offset` de cada criatura.
fr: Pour animer les créatures vers une nouvelle position, tu dois indiquer à SwiftUI quelle animation utiliser et quelle valeur animer. Dans ce cas, tu veux animer la propriété `offset` de chaque créature.
it: Per animare le creature in modo da cambiare la loro posizione, dovrai indicare a SwiftUI quale animazione usare e quale valore animare. In questo caso, animeremo la proprietà `offset` di ciascuna creatura.
nl: Om de wezens via een animatie naar een nieuwe positie te verplaatsen, moet je opgeven welke animatie SwiftUI moet gebruiken en welke waarde in de animatie moet worden opgenomen. In dit geval ga je een animatie maken van de eigenschap `offset` van elk wezen.
no: Når du vil animere skapningene til en ny posisjon, må du fortelle SwiftUI hvilken animasjon som skal brukes og hvilken verdi som skal animeres. I dette tilfellet vil du animere hver skapnings `offset`-egenskap.
pt: Para animar as criaturas para uma nova posição, você precisa dizer à SwiftUI qual animação usar e qual o valor a ser animado. Neste caso, você quer animar a propriedade `offset` de cada criatura.
sv: När du vill animera varelserna till en ny plats måste du tala om för SwiftUI vilken animering som ska användas och vilket värde som ska animeras. I det här fallet vill du animera varje varelses `offset`-egenskap.
th: ในการทำให้สิ่งมีชีวิตเคลื่อนไหวไปยังตำแหน่งใหม่ คุณจะต้องบอก SwiftUI ว่าจะใช้ภาพเคลื่อนไหวใดและจะทำให้ค่าใดเคลื่อนไหว ในกรณีนี้ คุณต้องการทำให้คุณสมบัติ `offset` ของสิ่งมีชีวิตแต่ละตัวเคลื่อนไหว
tr: Yaratıkları yeni bir konuma götürmek üzere canlandırmak için SwiftUI’a hangi canlandırmanın kullanılacağını ve hangi değerin canlandırılacağını söylemen gerekir. Bu durumda, her bir yaratığın `offset` özelliğini canlandırmak istiyorsun.
vi: Để tạo hiệu ứng các sinh vật đến một vị trí mới, bạn cần cho SwiftUI biết hiệu ứng chuyển động nào sẽ sử dụng và giá trị nào sẽ tạo hiệu ứng. Trong trường hợp này, bạn muốn tạo hiệu ứng cho thuộc tính `offset` của từng sinh vật.
zh_cn: 若要用动画将动物移到新位置，你需要告诉 SwiftUI 要使用的动物和要用动画的值。在本例中，你想要将每个动物的 `offset` 属性赋予动画效果。
zh_tw: 若要用動畫讓它們移動到新的位置，你需要告訴 SwiftUI 該使用哪一個動畫以及要用動畫呈現哪個數值。在這個例子中，你要用動畫呈現生物的 `offset` 屬性。
