Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Try using a `Text` view to label each view. Label the first one “On”.
de: Probiere die die jeweiligen Ansichten mit einer `Text`-Ansicht zu beschriften. Nenne die erste „Ein“.
es: Prueba a usar una vista `Text` (texto) para etiquetar cada vista. Etiqueta la primera como “Activado”.
es_419: Intenta usar una visualización `Text` para agregar una etiqueta a cada visualización. Etiqueta la primera como “Activado”.
fr: Essaie d’utiliser une vue `Text` pour étiqueter chaque vue. Utilise l’étiquette « On » pour la première.
it: Prova ad utilizzare una vista `Text` per assegnare un'etichetta a ciascuna vista. Assegna l'etichetta “On” (attiva) alla prima vista.
nl: Gebruik een `Text`-weergave om beide weergaven van een label te voorzien. Geef de eerste weergave het label 'Aan'.
no: Prøv å merke hver visning med en `Text`-visning. Merk den første med «På».
pt: Tente usar uma visualização `Text` para etiquetar cada visualização. Etiquete a primeira como “Ativada”.
sv: Prova att använda en `Text`-vy till att etikettera alla vyer. Etikettera den första som ”På”.
th: ลองใช้มุมมอง `Text` เพื่อติดป้ายแต่ละมุมมอง โดยติดป้ายมุมมองแรกเป็น “On”
tr: Her bir görüntüyü etiketlemek için bir `Text` görüntüsünü kullanmayı dene. İlk görüntüyü “Açık” olarak etiketle.
vi: Thử sử dụng chế độ xem `Text` để gắn nhãn cho từng chế độ xem. Gắn nhãn chế độ xem thứ nhất là “Bật”.
zh_cn: 尝试使用 `Text`（文本）视图来标记每个视图。将第一个视图标记为“打开”。
zh_tw: 嘗試使用 `Text` 顯示區來標示每一個顯示區。將第一個顯示區標示為「開啟」。

source: Text("On")
de: Text("Ein")
es: Text("Activado")
es_419: Text("Activar")
nl: Text("Aan")
no: Text("På")
pt: Text("Ativada")
sv: Text("På")
tr: Text("Açık")
vi: Text("Bật")
zh_cn: Text("打开")
zh_tw: Text("開啟")

source: Label the second view as “Off”.
de: Nenne die zweite Ansicht „Aus“.
es: Etiqueta la segunda vista como “Desactivado”.
es_419: Etiqueta la segunda como “Desactivado”.
fr: Utilise l’étiquette « Off » pour la seconde.
it: Alla seconda assegna l'etichetta “Off” (non attiva).
nl: Geef de tweede weergave het label 'Uit'.
no: Merk den andre visningen som «Av».
pt: Etiquete a segunda visualização como “Desativada”.
sv: Etikettera den andra vyn som ”Av”.
th: ติดป้ายมุมมองที่สองเป็น “Off”
tr: İkinci görüntüyü “Kapalı” olarak etiketle.
vi: Gắn nhãn chế độ xem thứ hai là “Tắt”.
zh_cn: 将第二个视图标记为“关闭”。
zh_tw: 將第二個顯示區標示為「關閉」。

source: Text("Off")
de: Text("Aus")
es: Text("Desactivado")
es_419: Text("Desactivar")
nl: Text("Uit")
no: Text("Av")
pt: Text("Desativada")
sv: Text("Av")
tr: Text("Kapalı")
vi: Text("Tắt")
zh_cn: Text("关闭")
zh_tw: Text("關閉")

source: And finally, make each view a different shape, such as a `Rectangle` or a `Capsule`.
de: Lege zum Schluss für jede Ansicht eine andere Form fest, z. B. rechteckig mit `Rectangle` oder kapselförmig mit `Capsule`.
es: Y, por último, haz que cada vista tenga una forma diferente, como un rectángulo (`Rectangle`) o una cápsula (`Capsule`).
es_419: Finalmente, asegúrate de que cada visualización tenga una figura distinta, como un rectángulo, `Rectangle` o una cápsula `Capsule`.
fr: Pour finir, donne à chaque vue une forme différente, comme un `Rectangle` ou une `Capsule`.
it: Infine, dai a ciascuna vista una forma diversa, come un `Rectangle` o una `Capsule`.
nl: Geef tot slot beide weergaven een verschillende vorm, zoals een `Rectangle` of een `Capsule`.
no: Til slutt bruker du forskjellige figurer for hver visning, for eksempel en `Rectangle` eller en `Capsule`.
pt: E, por fim, faça com que cada visualização tenha uma forma diferente, como `Rectangle` ou `Capsule`.
sv: Ge slutligen vyerna olika former, till exempel en `Rectangle` eller en `Capsule`.
th: และสุดท้าย ทำให้แต่ละมุมมองมีรูปร่างแตกต่างกัน เช่น `Rectangle` หรือ `Capsule`
tr: Son olarak, her görüntüyü `Rectangle` veya `Capsule` gibi farklı bir şekilde yap.
vi: Và cuối cùng, đảm bảo mỗi chế độ xem có một hình dạng khác nhau, ví dụ như `Rectangle` hoặc `Capsule`.
zh_cn: 最后将每个视图设为不同形状，如 `Rectangle`（矩形）或 `Capsule`（胶囊）。
zh_tw: 最後，讓每一個顯示區呈現不同的形狀，例如 `Rectangle` 或 `Capsule`。

source: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("On") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Off") }
de: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("Ein") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Aus") }
es: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("Activado") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Desactivado") }
es_419: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("Activar") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Desactivar") }
pt: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("Ativado") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Desativado") }
sv: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("På") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Av") }
tr: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("Açık") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Kapalı") }
vi: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("Bật") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("Tắt") }
zh_cn: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text("打开") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text("关闭") }
zh_tw: if isOn { Circle() .frame(maxHeight: 200) .foregroundColor(.mint) Text(“開啟") } else { Rectangle() .frame(maxHeight: 200) .foregroundColor(.gray) Text(“關閉") } ```

# GuideBook..Guide0..StepModifying State..TaskaddNewConditionalView..title
source: Add a new conditional view
de: Neue bedingte Ansicht hinzufügen
es: Añadir una nueva vista condicional
es_419: Agregar una visualización condicional nueva
fr: Ajouter une nouvelle vue conditionnelle
it: Aggiungere una nuova vista condizionale
nl: Een nieuwe voorwaardelijke weergave toevoegen
no: Legg til en ny betinget visning
pt: Adicione uma nova visualização condicional
sv: Lägg till en ny villkorlig vy
th: เพิ่มมุมมองแบบมีเงื่อนไขใหม่
tr: Yeni bir koşullu görüntü ekleme
vi: Thêm một chế độ xem điều kiện mới
zh_cn: 添加新条件视图
zh_tw: 加入新的條件顯示區

source: Now, try adding a completely new conditional view by yourself:
de: Probiere auf eigene Faust, eine komplett neue bedingte Ansicht zu erstellen:
es: Ahora, prueba a añadir una vista condicional completamente nueva por tu cuenta:
es_419: Ahora, intenta agregar una visualización condicional totalmente nueva por tu cuenta:
fr: Maintenant, essaie d’ajouter une vue conditionnelle entièrement nouvelle par toi-même :
it: Adesso, prova ad aggiungere una nuova vista condizionale completamente in autonomia:
nl: Probeer nu zelf een geheel nieuwe voorwaardelijk weergave toe te voegen:
no: Prøv nå å legge til en helt ny betinget visning på egen hånd:
pt: Agora, tente adicionar uma visualização condicional totalmente nova por sua conta:
sv: Försök nu att lägga till en alldeles ny villkorlig vy på egen hand:
th: ตอนนี้ให้ลองเพิ่มมุมมองแบบมีเงื่อนไขใหม่ทั้งหมดด้วยตัวคุณเอง:
tr: Şimdi, kendi kendine tamamen yeni bir koşullu görüntü eklemeyi dene:
vi: Bây giờ, hãy thử tự mình thêm một chế độ xem điều kiện hoàn toàn mới:
zh_cn: 现在试试自己添加一个全新的条件视图：
zh_tw: 現在，嘗試自己加入一個全新的條件顯示區：

source: Add a [state property](glossary://state%20value) outside of the [body](glossary://body) and give it an initial Boolean value.
de: Füge eine [Statuseigenschaft](glossary://state%20value) außerhalb des [Hauptteils](glossary://body) hinzu und weise ihr einen booleschen Ausgangswert zu.
es: Añade una [propiedad de estado](glossary://state%20value) fuera del [cuerpo](glossary://body) y dale un valor booleano inicial.
es_419: Agrega una [propiedad de estado](glossary://state%20value) afuera del [cuerpo](glossary://body) y dale un valor booleano inicial.
fr: Ajoute une [propriété d’état](glossary://state%20value) à l’extérieur du [corps](glossary://body) et attribue-lui une valeur booléenne initiale.
it: Aggiungi una [proprietà di stato](glossary://state%20value) al di fuori del [corpo](glossary://body) e assegnale un valore booleano iniziale.
nl: Voeg een [statuseigenschap](glossary://state%20value) buiten de [body](glossary://body) toe en geeft de eigenschap een voorlopige Booleaanse waarde.
no: Legg til en [statusegenskap](glossary://state%20value) utenfor [visningsinnholdet](glossary://body), og gi den en innledende boolsk verdi.
pt: Adicione uma [propriedade de estado](glossary://state%20value) fora do [corpo](glossary://body) e atribua‑lhe um valor booleano.
sv: Lägg till en [statusegenskap](glossary://state%20value) utanför [bodyn](glossary://body) och ge den ett inledande booleskt värde.
th: เพิ่ม[คุณสมบัติสถานะ](glossary://state%20value)ภายนอก[เนื้อหา](glossary://body)และใส่ค่าบูลีนเริ่มต้น
tr: [Gövdenin](glossary://body) dışına bir [durum özelliği](glossary://state%20value) ekle ve ona ilk Boole değerini ver.
vi: Thêm một [thuộc tính trạng thái](glossary://state%20value) bên ngoài [phần thân](glossary://body) và cung cấp một giá trị Boolean ban đầu.
zh_cn: 在[主体](glossary://body)之外添加[状态属性](glossary://state%20value)，并赋予它一个初始布尔值。
zh_tw: 在[主體](glossary://body)之外加入一個[狀態屬性](glossary://state%20value)，並且為它指定一個初始布林值。

source: Create an [if statement](glossary://if%20statement) that shows one view if the value of your state property is `true`, and another view if it’s `false`.
de: Erstelle eine [if-Anweisung](glossary://if%20statement), die eine Ansicht anzeigt, wenn die Statuseigenschaft den Wert `true` hat, und eine andere, wenn der Wert `false` ist.
es: Crea una [sentencia if](glossary://if%20statement) que muestre una vista si el valor de la propiedad de estado es `true` (verdadero), y otra vista si es `false` (falso).
es_419: Crea un [enunciado `if`](glossary://if%20statement) que muestre una visualización si el valor de tu propiedad de estado es `true`, y otra visualización si es `false`.
fr: Crée une [instruction if](glossary://if%20statement) qui affiche une vue si la valeur de ta propriété d’état est `true`, et une autre vue si elle est `false`.
it: Crea un'[istruzione if](glossary://if%20statement) che mostra una vista se il valore della proprietà di stato corrisponde a `true` e un'altra vista se corrisponde a `false`.
nl: Maak een [if-instructie](glossary://if%20statement) aan waarmee je de ene weergave toont als de waarde van de statuseigenschap `true` is en de andere weergave als de statuseigenschap `false` is.
no: Opprett et [if-uttrykk](glossary://if%20statement) som viser én visning hvis statusegenskapens verdi er `true` og en annen visning hvis den er `false`.
pt: Crie uma [instrução if](glossary://if%20statement) que mostra uma visualização se o valor da propriedade de estado for `true` e outra visualização se for `false`.
sv: Skapa ett [if-uttryck](glossary://if%20statement) som visar en vy om statusegenskapens värde är `true` och en annan vy om det är `false`.
th: สร้าง[ชุดคำสั่ง if](glossary://if%20statement) ที่แสดงมุมมองหนึ่งหากค่าของคุณสมบัติสถานะเป็น `true` และอีกมุมมองหนึ่งหากค่าเป็น `false`
tr: Durum özelliğinin değeri `true` ise bir görüntü, `false` ise başka bir görüntü gösteren bir [if ifadesi](glossary://if%20statement) yarat.
vi: Tạo ra một [câu lệnh if](glossary://if%20statement) hiển thị một chế độ xem nếu giá trị của thuộc tính trạng thái là `true` và một chế độ xem khác nếu giá trị là `false`.
zh_cn: 创建一个 [if 语句](glossary://if%20statement)，在状态属性值为 `true` 时显示一个视图，在它为 `false` 时显示另一个视图。
zh_tw: 建立一個 [if語句](glossary://if%20statement)，若狀態屬性為 `true`，會顯示一個顯示區，若為 `false`，則顯示另一個顯示區。

source: Create a new `Button` and toggle your state property whenever you press it.
de: Erstelle eine neue Taste mit `Button` und schalte damit die Statuseigenschaft um, wenn du die Taste drückst.
es: Crea un nuevo botón (`Button`) y alterna la propiedad de estado cada vez que lo pulses.
es_419: Crea un nuevo elemento `Button` y haz que su propiedad de estado alterne cada vez que lo presiones.
fr: Crée un nouveau `Button` et fais basculer ta propriété d’état dès que tu appuies dessus.
it: Crea un nuovo `Button` e attiva la proprietà di stato ogni volta che lo premi.
nl: Maak een nieuwe `Button` aan die de statuseigenschap wijzigt wanneer erop wordt getikt.
no: Opprett en ny `Button` som veksler statusegenskapen når du trykker på den.
pt: Crie um novo `Button` e alterne a propriedade de estado sempre que pressioná‑lo.
sv: Skapa en ny `Button` som växlar statusegenskapen när du trycker på den.
th: สร้าง `Button` ใหม่และสลับระหว่างเปิดหรือปิดคุณสมบัติสถานะของคุณทุกครั้งที่คุณกด
tr: Yeni bir `Button` yarat ve buna her bastığında durum özelliğini aç/kapat.
vi: Tạo ra một `Button` mới và chuyển đổi thuộc tính trạng thái bất kỳ lúc nào bạn nhấn nút đó.
zh_cn: 添加一个新的 `Button`，然后在它被按下时切换状态属性。
zh_tw: 建立一個新的 `Button` 並且在每次按下它時，切換你的狀態屬性。

source: Does your conditional view work as you expect?
de: Funktioniert die bedingte Ansicht so, wie du erwartet hast?
es: ¿Funciona tu vista condicional como esperabas?
es_419: ¿Funciona tu visualización condicional como esperabas?
fr: Ta vue conditionnelle fonctionne-t-elle comme prévu ?
it: Funziona come ti aspettavi?
nl: Werkt je voorwaardelijke weergave zoals je had verwacht?
no: Fungerer den betingede visningen som forventet?
pt: Será que a sua visualização condicional funciona conforme o esperado?
sv: Fungerar den villkorliga vyn som du förväntade dig?
th: มุมมองแบบมีเงื่อนไขของคุณทำงานตามที่คุณคาดหวังหรือไม่
tr: Koşullu görüntün beklediğin gibi çalışıyor mu?
vi: Chế độ xem điều kiện của bạn có hoạt động như dự kiến không?
zh_cn: 你的条件视图有按照你希望的方式运行吗？
zh_tw: 你的條件顯示區是否如預期運作？

source: Before moving on, try using the [rubber ducky method](glossary://rubber%20ducky%20method) to explain how conditional view code works in as much detail as you can. What does a state property do? How does your view know when to update? If you can’t remember something, go back and try to figure out where your knowledge is missing. Your rubber ducky will thank you!
de: Bevor es weitergeht, solltest du versuchen, mit der [Quietscheentchen-Methode](glossary://rubber%20ducky%20method) so genau wie möglich zu erklären, wie der Code für die bedingte Ansicht funktioniert. Was macht eine Statuseigenschaft? Wie weiß die Ansicht, wann sie aktualisiert werden muss? Wenn dir etwas nicht mehr einfällt, gehe zurück und finde heraus, was du nicht mehr weißt. Dein Quietscheentchen wird es dir danken!
es: Antes de seguir adelante, prueba a usar el [método del patito de goma](glossary://rubber%20ducky%20method) para explicar cómo funciona el código de la vista condicional con el mayor detalle posible. ¿Qué hace una propiedad de estado? ¿Cómo sabe la vista en qué momento debe actualizarse? Si no recuerdas algo, revisa y trata de averiguar dónde se te escapa algo. Tu patito de goma te lo agradecerá.
es_419: Antes de continuar, intenta usar el [método del patito de hule](glossary://rubber%20ducky%20method) para explicar con el mayor detalle posible cómo funciona el código de la visualización condicional. ¿Qué hace una propiedad de estado? ¿Cómo sabe tu visualización cuándo debe actualizarse? Si no recuerdas algo, regresa a la lección correspondiente y repasa lo que no te haya quedado claro. ¡Tu patito de hule te lo agradecerá!
fr: Avant de passer à la suite, essaie d’utiliser la [méthode du canard en plastique](glossary://rubber%20ducky%20method) pour expliquer comment fonctionne le code de la vue conditionnelle avec autant de détails que possible. Que fait une propriété d’état ? Comment ta vue sait-elle quand elle doit se mettre à jour ? Si tu ne te souviens pas de quelque chose, reviens en arrière et essaie de trouver où tes connaissances font défaut. Ton canard en plastique te sera reconnaissant !
it: Prima di proseguire, prova ad applicare il [metodo della paperella di gomma](glossary://rubber%20ducky%20method) per spiegare in modo quanto più dettagliato possibile come funziona il codice della vista condizionale. Qual'è la funzione di una proprietà di stato? Come fa la tua vista a sapere quando deve aggiornarsi? Se non ti ricordi qualcosa, puoi rivedere i contenuti per cercare di colmare le tue lacune. La paperella di gomma ti ringrazierà!
nl: Gebruik voordat je verdergaat de [methode met het rubber eendje](glossary://rubber%20ducky%20method) om zo nauwkeurig mogelijk uit te leggen hoe code voor voorwaardelijke weergaven werkt. Wat doet een statuseigenschap? Hoe weet je weergave wanneer die moet worden bijgewerkt? Als je iets niet meer weet, ga dan terug en probeer te achterhalen welke kennis ontbreekt. Je rubber eendje is trots op je!
no: Før du går videre kan du prøve å bruke [gummiandmetoden](glossary://rubber%20ducky%20method) til å forklare hvordan betinget visningskode fungerer, så detaljert som mulig. Hva gjør en statusegenskap? Hvordan vet visningen når den skal oppdateres? Hvis du glemmer noe, kan du gå tilbake og prøve å finne ut hvor det er hull i kunnskapen din. Gummianden kommer til å takke deg!
pt: Antes de prosseguir, tente usar o [método do patinho de borracha](glossary://rubber%20ducky%20method) para explicar como o código da visualização condicional funciona, com a maior riqueza de detalhes possível. Para que serve uma propriedade de estado? Como a visualização sabe quando precisa se atualizar? Se não se lembrar de alguma coisa, volte e tente descobrir qual parte do conhecimento está faltando. O seu patinho de borracha vai agradecer!
sv: Innan du går vidare kan du prova att använda [gummiankametoden](glossary://rubber%20ducky%20method) till att förklara hur villkorlig vykod fungerar så detaljerat du kan. Vad gör en statusegenskap? Hur vet vyn när den ska uppdateras? Om du glömmer något kan du gå tillbaka och försöka komma på var det finns hål i kunskapen. Gummiankan kommer att tacka dig!
th: ก่อนจะไปต่อ ให้ลองใช้[วิธีการตุ๊กตาเป็ดยาง](glossary://rubber%20ducky%20method)เพื่ออธิบายวิธีการทำงานของโค้ดมุมมองแบบมีเงื่อนไขให้ละเอียดมากที่สุดเท่าที่คุณจะทำได้ คุณสมบัติสถานะใช้ทำอะไร มุมมองของคุณรู้เวลาที่จะอัปเดตได้อย่างไร ถ้าคุณจำบางอย่างไม่ได้ ให้ย้อนกลับไปและพยายามค้นหาว่าคุณยังขาดความรู้ในส่วนใด ตุ๊กตาเป็ดยางจะขอบคุณมาก!
tr: Devam etmeden önce koşullu görüntü kodunun nasıl çalıştığını olabildiğince ayrıntılı olarak açıklamak için [plastik ördek metodunu](glossary://rubber%20ducky%20method) kullan. Durum özelliği ne yapar? Görüntün ne zaman güncelleneceğini nasıl bilir? Bir şeyi anımsayamazsan geri dön ve bilginin nerede eksik olduğunu anlamaya çalış. Plastik ördeğin sana teşekkür edecek!
vi: Trước khi tiếp tục, hãy thử sử dụng [phương thức vịt cao su](glossary://rubber%20ducky%20method) để giải thích cách hoạt động của mã chế độ xem điều kiện ở mức độ chi tiết nhất có thể. Thuộc tính trạng thái có nhiệm vụ gì? Làm cách nào mà chế độ xem của bạn biết thời điểm cập nhật? Nếu bạn không thể nhớ thông tin nào đó, hãy quay lại và cố gắng tìm ra nơi kiến thức của bạn bị thiếu. Vịt cao su sẽ cảm ơn bạn!
zh_cn: 在继续之前，尝试使用[小黄鸭调试法](glossary://rubber%20ducky%20method)，尽可能详细地解释条件视图代码如何工作。状态属性用来做什么？视图如何知道要什么时候更新？如果想不起来，可以回顾之前学过的内容来弄明白。小黄鸭会感谢你的！
zh_tw: 在繼續之前，請嘗試使用[橡皮鴨方法](glossary://rubber%20ducky%20method)儘可能詳細地解釋條件顯示區程式碼的工作原理。狀態屬性有什麼用途？你的顯示區如何知道何時更新？如果你不記得某事，請返回並試著找出你的知識的遺漏之處。你的橡皮鴨會感謝你的！

# GuideBook..Guide0..StepModifying State..SuccessMessage..Paragraph36
source: Wahoo!
de: Wow!
es: ¡Qué bien!
es_419: ¡Yuju!
fr: Wahou !
it: Evviva!
nl: Joehoe!
no: Woohoo!
pt: Uhuuu!
sv: Woohoo!
th: วู้ฮู้!
tr: Yaşasın!
vi: Tuyệt vời!
zh_cn: 欧耶！
zh_tw: 哇嗚！

# GuideBook..Guide0..StepModifying State..SuccessMessage..Paragraph37
source: You now understand how to use a [state property](glossary://state%20value) to update the appearance of a SwiftUI view. This state property is stored outside of the view [body](glossary://body), where you declare the UI of the view.
de: Du weißt nun, wie man eine [Statuseigenschaft](glossary://state%20value) verwendet, um das Erscheinungsbild einer SwiftUI-Ansicht zu aktualisieren. Diese Statuseigenschaft ist außerhalb des Ansicht-[Hauptteils](glossary://body) gesichert, wo du die Benutzeroberfläche der Ansicht deklarierst.
es: Ahora ya sabes cómo usar una [propiedad de estado](glossary://state%20value) para actualizar la apariencia de una vista de SwiftUI. Esta propiedad de estado se guarda fuera de la vista del [cuerpo](glossary://body), donde declaras la IU de la vista.
es_419: Ahora entiendes cómo usar una [propiedad de estado](glossary://state%20value) para actualizar el aspecto de una visualización de SwiftUI. Esta propiedad de estado se almacena fuera del [cuerpo](glossary://body) de la visualización, donde se declara la interfaz de usuario de la visualización.
fr: Tu comprends désormais comment utiliser une [propriété d’état](glossary://state%20value) pour mettre à jour l’apparence d’une vue SwiftUI. Cette propriété d’état est stockée hors du [corps](glossary://body) de la vue, où tu déclares l’IU de la vue.
it: Adesso sai come utilizzare una [proprietà di stato](glossary://state%20value) per aggiornare l'aspetto di una vista in SwiftUI. Questa proprietà di stato è salvata all'esterno del [corpo](glossary://body) della vista, dove l'interfaccia utente della vista viene dichiarata.
nl: Je weet nu hoe je een [statuseigenschap](glossary://state%20value) gebruikt om het uiterlijk van een SwiftUI-weergave te wijzigen. Deze statuseigenschap wordt buiten de [body](glossary://body) van de weergave bewaard, waar je de gebruikersinterface van de weergave declareert.
no: Nå forstår du hvordan du bruker en [statusegenskap](glossary://state%20value) til å oppdatere utseendet i en SwiftUI-visning. Denne statusegenskapen lagres utenfor visningens [visningsinnhold](glossary://body), der du deklarerer visningens brukergrensesnitt.
pt: Agora você entende como usar uma [propriedade de estado](glossary://state%20value) para atualizar a aparência de uma visualização de SwiftUI. Essa propriedade de estado é armazenada fora do [corpo](glossary://body) da visualização, onde você declara a IU da visualização.
sv: Nu förstår du hur du använder en [statusegenskap](glossary://state%20value) till att uppdatera utseendet i en SwiftUI-vy. Den här statusegenskapen lagras utanför vyns [body](glossary://body) där du deklarerar vyns UI.
th: ตอนนี้คุณเข้าใจวิธีใช้[คุณสมบัติสถานะ](glossary://state%20value)เพื่ออัปเดตรูปแบบของมุมมอง SwiftUI แล้ว คุณสมบัติสถานะนี้จัดเก็บอยู่ภายนอก[เนื้อหา](glossary://body)ของมุมมอง ซึ่งเป็นที่ที่คุณประกาศ UI ของมุมมอง
tr: Bir SwiftUI görüntüsünün görünüşünü güncellemek için [durum özelliğini](glossary://state%20value) nasıl kullanacağını artık biliyorsun. Bu durum özelliği, görüntünün kullanıcı arayüzünü bildirdiğin görüntü [gövdesinin](glossary://body) dışında saklanır.
vi: Bây giờ bạn đã hiểu cách sử dụng [thuộc tính trạng thái](glossary://state%20value) để cập nhật giao diện của chế độ xem SwiftUI. Thuộc tính trạng thái này được lưu trữ bên ngoài [phần thân](glossary://body) của chế độ xem, là nơi mà bạn khai báo UI của chế độ xem.
zh_cn: 现在你了解了如何使用[状态属性](glossary://state%20value)更新 SwiftUI 视图的外观。这个状态属性储存在你声明视图 UI 的地方，位于视图[主体](glossary://body)之外。
zh_tw: 現在你瞭解了如何使用[狀態屬性](glossary://state%20value)來更新 SwiftUI 顯示區的外觀。此狀態屬性是儲存在顯示區的[主體](glossary://body)之外，你會在其中宣告顯示區的 UI。
