Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: HStack { Text("Shadow") Slider(value: $shadowRadius) }
de: HStack { Text("Schatten") Slider(value: $shadowRadius) }
es: HStack { Text("Sombreado") Slider(value: $shadowRadius) }
fr: HStack { Text("Ombre") Slider(value: $shadowRadius) }
nl: HStack { Text("Schaduw") Slider(value: $shadowRadius) }
pt: HStack { Text("Sombra") Slider(value: $shadowRadius) }
sv: HStack { Text("Skugga") Slider(value: $shadowRadius) }
tr: HStack { Text("Gölge") Slider(value: $shadowRadius) }
vi: HStack { Text("Bóng đổ") Slider(value: $shadowRadius) }
zh_cn: HStack { Text("阴影") Slider(value: $shadowRadius) }
zh_tw: HStack { Text("陰影") Slider(value: $shadowRadius) } ```

# GuideBook..Guide0..StepAdd a `CreatureDetail` view..TaskaddScaleButton..title
source: Add a `Button` that changes the size of the creature
de: `Button` zum Ändern der Größe des Charakters hinzufügen
es: Añadir un botón (`Button`) que cambie el tamaño de la criatura
es_419: Agregar un botón (`Button`) que cambie el tamaño de la criatura
fr: Ajouter un `Button` qui change la taille de la créature
it: Aggiungere un `Button` che modifica le dimensioni della creatura
nl: Voeg een `Button` toe waarmee de grootte van het wezen wordt gewijzigd
no: Legg til en `Button` som endrer størrelsen på skapningen
pt: Adicione um `Button` que altere o tamanho da criatura
sv: Lägg till en `Button` som ändrar storleken på varelsen
th: เพิ่ม `Button` ที่เปลี่ยนขนาดของสิ่งมีชีวิต
tr: Yaratığın büyüklüğünü değiştiren bir `Button` ekleme
vi: Thêm một `Button` thay đổi kích cỡ của sinh vật
zh_cn: 添加改变动物大小的 `Button`
zh_tw: 加入一個能更改生物大小的 `Button`

source: Below the `Slider`, add a `Button` that people can use to scale the `Text` view up and down:
de: Füge unter der `Slider`-Instanz eine `Button`-Instanz hinzu, mit der die `Text`-Ansicht vergrößert oder verkleinert werden kann:
es: Debajo de `Slider` (regulador), añade un botón (`Button`) que las personas puedan usar para aumentar o disminuir la vista `Text` (texto):
es_419: Debajo de `Slider`, agrega un botón (`Button`) que se pueda usar para aumentar o reducir la escala de la visualización `Text`:
fr: Sous le `Slider`, ajoute un `Button` qui peut servir à agrandir ou réduire la vue `Text` :
it: Sotto `Slider`, aggiungi un `Button` che può essere usato per ingrandire e rimpicciolire la vista `Text`:
nl: Voeg onder de `Slider` een `Button` toe die gebruikers kunnen gebruiken om de weergave `Text` te vergroten en te verkleinen:
no: Legg til en `Button` nedenfor `Slider`, slik at personer kan bruke den til å skalere `Text`-visningen oppover og nedover:
pt: Abaixo do `Slider`, adicione um `Button` que as pessoas poderão usar para aumentar ou diminuir a visualização `Text`:
sv: Lägg till en `Button` nedanför `Slider` så att personer kan använda den till att skala `Text`-vyn uppåt och nedåt:
th: ด้านล่าง `Slider` ให้เพิ่ม `Button` ที่ผู้คนสามารถใช้เพื่อปรับขนาดมุมมอง `Text` ให้ใหญ่ขึ้นและเล็กลงได้:
tr: `Slider`’ın altına, kişilerin `Text` görüntüsünü yukarı ve aşağı ölçeklemek için kullanabileceği bir `Button` ekle:
vi: Bên dưới `Slider`, hãy thêm một `Button` mà mọi người có thể sử dụng để tăng và giảm tỷ lệ của chế độ xem `Text`:
zh_cn: 在 `Slider` 下方添加一个 `Button`，用户可以用它来放大和缩小 `Text` 视图：
zh_tw: 在 `Slider` 下方加入一個使用者可用來放大和縮小 `Text` 顯示區的 `Button`：

source: Create a new [state property](glossary://state%20property) that tracks a `Boolean` value, just like you did in `ConditionalCircle`.
de: Erstelle zum Verfolgen eines `Boolean`-Werts eine neue [Statuseigenschaft](glossary://state%20property), so wie du es in `ConditionalCircle` getan hast.
es: Crea una nueva [propiedad de estado](glossary://state%20property) que controle un valor `Boolean` (booleano), al igual que hiciste en `ConditionalCircle`.
es_419: Crea una nueva [propiedad de estado](glossary://state%20property) que supervise los cambios en el valor `Boolean`, de manera similar a lo que hiciste en `ConditionalCircle`.
fr: Crée une nouvelle [propriété d’état](glossary://state%20property) qui suit une valeur `Boolean` (booléenne), comme tu l’as fait dans `ConditionalCircle`.
it: Crea una nuova [proprietà di stato](glossary://state%20property) che monitori un valore `Boolean`, proprio come hai fatto in `ConditionalCircle`.
nl: Maak een nieuwe [statuseigenschap](glossary://state%20property) aan die een `Boolean`-waarde bijhoudt, net als je hebt gedaan in `ConditionalCircle`.
no: Opprett en ny [statusegenskap](glossary://state%20property) som sporer en `Boolean`-verdi, akkurat som du gjorde i `ConditionalCircle`.
pt: Crie uma nova [propriedade de estado](glossary://state%20property) que rastreie um valor `Boolean`, da mesma maneira como você fez em `ConditionalCircle`.
sv: Skapa en ny [statusegenskap](glossary://state%20property) som spårar ett `Boolean`-värde, precis som du gjorde i `ConditionalCircle`.
th: สร้าง[คุณสมบัติสถานะ](glossary://state%20property)ใหม่ที่ติดตามค่า `Boolean` เหมือนกับที่คุณทำใน `ConditionalCircle`
tr: Tıpkı `ConditionalCircle`’da yaptığın gibi Boole değerini izleyen yeni bir [durum özelliği](glossary://state%20property) yarat.
vi: Tạo một [thuộc tính trạng thái](glossary://state%20property) mới theo dõi giá trị `Boolean`, giống như bạn đã làm trong `ConditionalCircle`.
zh_cn: 创建一个可跟踪 `Boolean` 值的[状态属性](glossary://state%20property)，就像你在`ConditionalCircle` 中做的一样。
zh_tw: 建立一個新的[狀態屬性](glossary://state%20property)來追蹤 `Boolean` 值，就像你在 `ConditionalCircle` 中所做的一樣。

source: Add a new modifier, [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) along with a [ternary conditional operator](glossary://ternary%20conditional%20operator) to determine the scale when the Boolean is `true` versus when its `false`.
de: Füge den neuen Modifikator [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) (Größeneffekt) zusammen mit einem [dreigliedrigen bedingten Operator](glossary://ternary%20conditional%20operator) hinzu, um die Größe zu ermitteln, wenn der boolesche Wert `true` oder wenn der boolesche Wert `false` ist.
es: Añade un nuevo modificador, [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7), junto con un [operador condicional ternario](glossary://ternary%20conditional%20operator) para determinar la escala cuando el valor booleano es `true` (verdadero) frente a cuando es `false` (falso).
es_419: Agrega un modificador nuevo [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) junto con un [operador condicional ternario](glossary://ternary%20conditional%20operator) para determinar la escala cuando el valor de `Boolean` es `true` y cuando es `false`.
fr: Ajoute un nouveau modificateur, [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7), avec un [opérateur conditionnel ternaire](glossary://ternary%20conditional%20operator) pour déterminer l’échelle lorsque la valeur booléenne est `true` et lorsqu’il est `false`.
it: Aggiungi un nuovo modificatore [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) insieme a un [operatore condizionale ternario](glossary://ternary%20conditional%20operator) per determinare la scala quando il valore booleano è `true` rispetto a quando è `false`.
nl: Voeg de nieuwe modifier [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) samen met een [driedelige voorwaardelijke operator](glossary://ternary%20conditional%20operator) toe om de grootte te bepalen wanneer de Booleaanse waarde `true` is en wanneer deze `false` is.
no: Legg til den nye modifikatoren [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) sammen med en [tredobbel betinget operator](glossary://ternary%20conditional%20operator) for å fastsette skalaen som brukes når en boolsk er `true` og når den er `false`.
pt: Adicione um novo modificador, [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) junto com um [operador condicional ternário](glossary://ternary%20conditional%20operator) para determinar a escala quando um Booleano é `true` em comparação a `false`.
sv: Lägg till den nya modifieraren [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) tillsammans med en [trefaldig villkorlig operator](glossary://ternary%20conditional%20operator) för att fastställa den skala som används när en boolesk är `true` och när den är `false`.
th: เพิ่มปุ่มปรับค่าใหม่ [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) พร้อมกับ[ตัวดำเนินการเงื่อนไขแบบสามส่วน](glossary://ternary%20conditional%20operator) เพื่อกำหนดขนาดเมื่อบูลีนเป็น `true` และเมื่อเป็น `false`
tr: Boole değeri `true` ya da `false` olduğunda ölçeği belirlemek için [üçlü koşullu işlecin](glossary://ternary%20conditional%20operator) yanı sıra yeni bir niteleyici ([.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7)) ekle.
vi: Thêm một trình sửa đổi mới, [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) cùng với một [toán tử điều kiện tam phân](glossary://ternary%20conditional%20operator) để xác định tỷ lệ khi Boolean là `true` so với khi giá trị là `false`.
zh_cn: 添加一个新的修饰符 [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) 以及[三元条件运算符](glossary://ternary%20conditional%20operator)，以分别确定布尔值为 `true` 和 `false` 时的缩放比例。
zh_tw: 加入一個新的修飾符 [.scaleEffect](doc://com.apple.documentation/documentation/swiftui/view/scaleeffect(_:anchor:)-pmi7) 以及[三元條件運算子](glossary://ternary%20conditional%20operator)以決定當布林值為 `true` 和 `false` 時的縮放。

source: Change your `Button` action [closure](glossary://closure) to toggle the Boolean value between `true` and `false` states.
de: Ändere den [Funktionsabschluss](glossary://closure) für die `Button`-Aktion, um den booleschen Wert zwischen `true` und `false` umzuschalten.
es: Cambia la [clausura](glossary://closure) de la acción del botón (`Button`) para alternar el valor booleano entre los estados `true` (verdadero) y `false` (falso).
es_419: Cambia la [clausura](glossary://closure) de `Button` para alternar entre los valores booleanos `true` y `false`.
fr: Modifie la [clôture](glossary://closure) de ton action `Button` pour faire basculer la valeur booléenne entre les états `true` et `false`.
it: Modifica l'azione [chiusura](glossary://closure) di `Button` per scambiare il valore booleano tra gli stati `true` e `false`.
nl: Wijzig de [closure](glossary://closure) van je `Button`-actie om te schakelen tussen de Booleaanse waarden `true` en `false`.
no: Endre `Button`-handlingens [closure-blokk](glossary://closure) for å veksle den boolske verdien mellom statusene `true` og `false`.
pt: Altere a ação do `Button` [encerramento](glossary://closure) para alternar o valor Booleano entre os estados `true` e `false`.
sv: Ändra `Button`-åtgärdens [stängning](glossary://closure) för att växla det booleska värdet mellan lägena `true` och `false`.
th: เปลี่ยน[การปิด](glossary://closure)การทำงาน `Button` ของคุณให้สลับค่าบูลีนระหว่างสถานะ `true` และ `false`
tr: Düğmenin (`Button`) eylem [kapamasını](glossary://closure) Boole değerini `true` ve `false` durumları arasında değiştirecek şekilde düzenle.
vi: Thay đổi [bao đóng](glossary://closure) hành động của `Button` để chuyển đổi giá trị Boolean giữa các trạng thái `true` và `false`.
zh_cn: 将 `Button` 操作[闭包](glossary://closure)更改为让布尔值在 `true` 和 `false` 状态之间切换。
zh_tw: 更改你的 `Button` 動作[閉包](glossary://callback)來在 `true` 和 `false` 狀態之間切換布林值。

source: Try completing this task by looking back at the code in `ConditionalCircle`. If you need help, look at the following hints:
de: Versuche, mithilfe des Codes in `ConditionalCircle` die Aufgabe zu lösen. Wenn du Hilfe brauchst, sind hier ein paar Tipps:
es: Intenta completar esta tarea mirando el código en `ConditionalCircle`. Si necesitas ayuda, consulta los siguientes consejos:
es_419: Intenta completar esta tarea consultado el código en `ConditionalCircle`. Si necesitas ayuda, échale un ojo a las siguientes pistas:
fr: Essaie de réaliser cette tâche en regardant le code dans `ConditionalCircle`. Si tu as besoin d’aide, consulte les astuces suivantes :
it: Prova a completare l'attività facendo riferimento al codice in `ConditionalCircle`. Se hai bisogno di aiuto, puoi utilizzare i suggerimenti di seguito:
nl: Probeer deze taak uit te voeren door de code in `ConditionalCircle` te raadplegen. Bekijk de volgende tips als je hulp nodig hebt:
no: Prøv å fullføre denne oppgaven ved å se på koden i `ConditionalCircle`. Se på følgende tips hvis du trenger hjelp:
pt: Para realizar esta tarefa, olhe novamente o código em `ConditionalCircle`. Se precisar de ajuda, use as dicas a seguir:
sv: Försök att slutföra den här åtgärden genom att ta en titt på koden i `ConditionalCircle`. Ta en titt på följande tips om du behöver hjälp:
th: ลองทำงานนี้ให้เสร็จโดยย้อนกลับไปดูโค้ดใน `ConditionalCircle` ถ้าคุณต้องการความช่วยเหลือ ให้ดูคำใบ้ต่อไปนี้:
tr: `ConditionalCircle`’daki koda bakarak bu görevi tamamlamayı dene. Yardıma ihtiyacın olursa aşağıdaki ipuçlarına bak:
vi: Cố gắng hoàn thành tác vụ này bằng cách xem lại mã trong `ConditionalCircle`. Nếu bạn cần trợ giúp, hãy xem những gợi ý này:
zh_cn: 通过回顾 `ConditionalCircle` 中的代码来尝试完成这个任务。如需帮助，可查看以下提示：
zh_tw: 回想一下 `ConditionalCircle` 中的程式碼來嘗試完成此任務。如果需要協助，請查看以下提示：

source: Create a [state property](glossary://state%20property) outside of the view [body](glossary://body) that tracks a Boolean value.
de: Erstelle eine [Statuseigenschaft](glossary://state%20property) außerhalb des [Hauptteils](glossary://body) der Ansicht, die einen booleschen Wert verfolgt.
es: Crea una [propiedad de estado](glossary://state%20property) fuera de la vista del [cuerpo](glossary://body) que controle un valor booleano.
es_419: Crea una [propiedad de estado](glossary://state%20property) afuera de la visualización [cuerpo](glossary://body) que supervise un valor booleano.
fr: Crée une [propriété d’état](glossary://state%20property) en dehors du [corps](glossary://body) de la vue, qui suit une valeur booléenne.
it: Crea una [proprietà di stato](glossary://state%20property) fuori dalla vista [corpo](glossary://body) che monitora un valore booleano.
nl: Maak buiten de [body](glossary://body) van de weergave een [statuseigenschap](glossary://state%20property) aan die een Booleaanse waarde bijhoudt.
no: Opprett en [statusegenskap](glossary://state%20property) utenfor visningen [visningsinnhold](glossary://body) som sporer en boolsk verdi.
pt: Crie uma [propriedade de estado](glossary://state%20property) fora da visualização [corpo](glossary://body) que rastreie um valor booleano.
sv: Skapa en [statusegenskap](glossary://state%20property) utanför vyn [body](glossary://body) som spårar ett booleskt värde.
th: สร้าง[คุณสมบัติสถานะ](glossary://state%20property)ภายนอก[เนื้อหา](glossary://body)ของมุมมองที่ติดตามค่าบูลีน
tr: Görüntü [gövdesinin](glossary://body) dışında Boole değerini izleyen [durum özelliği](glossary://state%20property) yarat.
vi: Tạo một [thuộc tính trạng thái](glossary://state%20property) bên ngoài [phần thân](glossary://body) của chế độ xem theo dõi giá trị Boolean.
zh_cn: 在[主体](glossary://body)视图之外创建一个跟踪布尔值的[状态属性](glossary://state%20property)。
zh_tw: 在顯示區[主體](glossary://body)之外建立一個追蹤布林值的[狀態屬性](glossary://state%20property)。

source: Add the `.scaleEffect` modifier to the `Text` view that controls the scale using a [ternary conditional operator](glossary://ternary%20conditional%20operator).
de: Füge den Modifikator `.scaleEffect` zur Ansicht `Text` hinzu, die mit dem [dreigliedrigen bedingten Operator](glossary://ternary%20conditional%20operator) die Größe steuert.
es: Añade el modificador `.scaleEffect` a la vista `Text` (texto) que controla la escala usando un [operador condicional ternario](glossary://ternary%20conditional%20operator).
es_419: Agrega el modificador `.scaleEffect` a la visualización `Text` que controle la escala mediante un [operador condicional ternario](glossary://ternary%20conditional%20operator).
fr: Ajoute le modificateur `.scaleEffect` à la vue `Text` qui contrôle l’échelle avec un [opérateur conditionnel ternaire](glossary://ternary%20conditional%20operator).
it: Utilizzando l'[operatore condizionale ternario](glossary://ternary%20conditional%20operator), aggiungi il modificatore `.scaleEffect` alla vista `Text` che controlla la scala.
nl: Voeg de modifier `.scaleEffect` aan de weergave `Text` toe die de grootte regelt met een [driedelige voorwaardelijke operator](glossary://ternary%20conditional%20operator).
no: Legg til modifikatoren `.scaleEffect` i `Text`-visningen som styrer skalaen ved hjelp av en [tredobbel betinget operator](glossary://ternary%20conditional%20operator).
pt: Adicione o modificador `.scaleEffect` à visualização `Text` que controla a escala usando um [operador condicional ternário](glossary://ternary%20conditional%20operator).
sv: Lägg till modifieraren `.scaleEffect` i `Text`-vyn som styr skalan med hjälp av en [trefaldig villkorlig operator](glossary://ternary%20conditional%20operator).
th: เพิ่มปุ่มปรับค่า `.scaleEffect` ไปยังมุมมอง `Text` ที่ควบคุมขนาดโดยใช้[ตัวดำเนินการเงื่อนไขแบบสามส่วน](glossary://ternary%20conditional%20operator)
tr: [Üçlü koşullu işleç](glossary://ternary%20conditional%20operator) kullanarak ölçeği denetleyen `Text` görüntüsüne `.scaleEffect` niteleyicisini ekle.
vi: Thêm trình sửa đổi `.scaleEffect` vào chế độ xem `Text` điều khiển tỷ lệ bằng một [toán tử điều kiện tam phân](glossary://ternary%20conditional%20operator).
zh_cn: 将 `.scaleEffect` 修饰符添加到 `Text` 视图，用于通过[三元条件运算符](glossary://ternary%20conditional%20operator)控制比例。
zh_tw: 將 `.scaleEffect` 修飾符加入到使用[三元條件運算子](glossary://ternary%20conditional%20operator)來控制縮放的 `Text` 顯示區。

source: Add the `Button` and set its action to call `isScaled.toggle()`.
de: Füge `Button` hinzu und lege fest, dass die Taste die Aktion `isScaled.toggle()` aufruft.
es: Añade el botón (`Button`) y establece su acción para que llame a `isScaled.toggle()`.
es_419: Agrega una acción `Button` que llame a `isScaled.toggle()`.
fr: Ajoute le `Button` et définis son action pour appeler `isScaled.toggle()`.
it: Aggiungi il pulsante `Button` e imposta l'azione corrispondente affinché richiami `isScaled.toggle()`.
nl: Voeg de `Button` toe en stel in dat `isScaled.toggle()` wordt aangeroepen door de bijbehorende actie.
no: Legg til `Button` og angi handlingen dens til å kalle `isScaled.toggle()`.
pt: Adicione o `Button` e defina sua ação para chamar `isScaled.toggle()`.
sv: Lägg till `Button` och ställ in dess åtgärd på att anropa `isScaled.toggle()`.
th: เพิ่ม `Button` และตั้งค่าการทำงานให้เรียกใช้ `isScaled.toggle()`
tr: `Button`’ı ekle ve eylemini `isScaled.toggle()`’ı çağıracak şekilde ayarla.
vi: Thêm `Button` và đặt hành động của nút thành gọi `isScaled.toggle()`.
zh_cn: 添加 `Button`，并将它的操作设为调用 `isScaled.toggle()`（切换缩放）。
zh_tw: 加入 `Button` 並設定其動作來呼叫 `isScaled.toggle()`。

source: Button("Scale") { isScaled.toggle() }
de: Button("Größe") { isScaled.toggle() }
nl: Button("Grootte") { isScaled.toggle() }
tr: Button("Ölçekle") { isScaled.toggle() }
vi: Button("Tỷ lệ") { isScaled.toggle() }
zh_cn: Button("缩放") { isScaled.toggle() }

source: Animate your changes to `isScaled`
de: Änderungen an `isScaled` animieren
es: Animar los cambios a `isScaled`
es_419: Animar los cambios de `isScaled`
fr: Animer tes modifications apportées à `isScaled`
it: Animare le modifiche che hai applicato a `isScaled`
nl: Een animatie maken van de wijzigingen in `isScaled`
no: Animer endringer av `isScaled`
pt: Anime as alterações em `isScaled`
sv: Animera ändringar av `isScaled`
th: ทำให้การเปลี่ยนแปลงไปยัง `isScaled` เคลื่อนไหวได้
tr: `isScaled`’deki değişikliklerini canlandırma
vi: Tạo hiệu ứng các thay đổi của bạn đối với `isScaled`
zh_cn: 给 `isScaled` 的更改赋予动画效果
zh_tw: 以動畫呈現 `isScaled` 的更動

source: This scale effect falls a little flat; wouldn’t it be better if it were animated?
de: Der Effekt zum Anpassen der Größe ist ein wenig langweilig, findest du nicht? Wäre es nicht besser, wenn er animiert wäre?
es: Este efecto de escala resulta un poco aburrido; ¿no sería mejor que estuviera animado?
es_419: Este efecto de escala se queda algo corto; ¿no sería mejor si fuese animado?
fr: Cet effet d’échelle tombe un peu à plat. Ne serait-ce pas mieux s’il était animé ?
it: L'effetto scala risulta un po' piatto. Non pensi che sarebbe meglio se fosse animato?
nl: Dit vergroting-/verkleiningseffect is een beetje saai. Zou het niet beter zijn om er een animatie van te maken?
no: Denne skaleringseffekten er litt flat – hadde det ikke vært bedre om den var animert?
pt: Esse efeito de escala ficou um pouco sem graça; não seria melhor se ele fosse animado?
sv: Den här skaleffekten är lite platt – vore det inte bättre om den var animerad?
th: เอฟเฟ็กต์รูปแบบขนาดนี้ไม่น่าสนใจสักเท่าไหร่ จะดีกว่าไหมหากเอฟเฟ็กต์เคลื่อนไหวได้
tr: Bu ölçekleme efekti biraz sade kalıyor; canlandırılmış olsa daha iyi olmaz mıydı?
vi: Hiệu ứng tỷ lệ này có một chút đơn điệu; nếu đó là hiệu ứng động thì có tốt hơn không?
zh_cn: 这个缩放效果有点平淡；如果它会动的话，是不是更好一些？
zh_tw: 這個縮放效果有點平淡，如果是動畫不是更好嗎？
