Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: So why did you bother creating a `NavigationStack` if a `NavigationLink` is what takes you to another view? Well, just like you can’t ride a bicycle without wheels, you can’t navigate to another view unless your links are inside a `NavigationStack` or `NavigationSplitView`.
de: Warum hast du eigentlich `NavigationStack` erstellt, wenn du `NavigationLink` brauchst, um zu einer anderen Ansicht zu gelangen? Nun, du kannst auch nicht mit einem Fahrrad ohne Räder fahren. Und genauso kannst du nicht zu einer anderen Ansicht navigieren, wenn sich die Links nicht in `NavigationStack` oder `NavigationSplitView` befinden.
es: Entonces, ¿por qué te has molestado en crear una pila de navegación (`NavigationStack`) si lo que te lleva a otra vista es un enlace de navegación (`NavigationLink`)? Pues bien, al igual que no se puede montar en bicicleta sin ruedas, no se puede navegar a otra vista a menos que tus enlaces estén dentro de una pila de navegación (`NavigationStack`) o de una vista dividida de navegación (`NavigationSplitView`).
es_419: Entonces, ¿por qué tomarse el tiempo para crear una `NavigationStack` si el enlace `NavigationLink` te lleva a otra visualización? Bueno, al igual que no puedes pasear en una bicicleta sin llantas, tampoco puedes navegar a otra visualización a menos que tus enlaces se encuentren adentro de una `NavigationStack` o `NavigationSplitView`.
fr: Pourquoi avoir pris la peine de créer une `NavigationStack` si un `NavigationLink` est ce qui t’amène à une autre vue ? Eh bien, tout comme tu ne peux pas faire de vélo sans roues, tu ne peux pas naviguer vers une autre vue si tes liens ne sont pas dans une `NavigationStack` ou une `NavigationSplitView`.
it: Allora perché creare una `NavigationStack` se per spostarti su un'altra vista ti serve un `NavigationLink`? Per lo stesso motivo per cui non puoi andare in bicicletta senza ruote: di fatto, non puoi andare a un'altra vista a meno che i link non si trovino all'interno di una `NavigationStack` o di una `NavigationSplitView`.
nl: Dus waarom heb je de moeite genomen om een `NavigationStack` aan te maken als je een `NavigationLink` nodig hebt om naar een andere weergave te gaan? Net als dat je op een fiets zonder wielen niet kunt rijden, kun je niet naar een andere weergave navigeren als je links zich niet in een `NavigationStack` of `NavigationSplitView` bevinden.
no: Så hvorfor opprettet du en `NavigationStack` unødvendig hvis det er `NavigationLink` som tar deg til en annen visning? Vel, akkurat som at du ikke kan sykle på en sykkel uten hjul, så kan du ikke navigere til en annen visning med mindre lenkene finnes inni en `NavigationStack` eller `NavigationSplitView`.
pt: Mas por que você se importou em criar um `NavigationStack` se um `NavigationLink` é o que leva você para outra visualização? Bem, é como uma bicicleta; você não pode pedalar sem as rodas. Você não pode navegar para outra visualização sem que os links estejam dentro de um `NavigationStack` ou de uma `NavigationSplitView`.
sv: Så varför skapade du en `NavigationStack` i onödan ifall det är `NavigationLink` som tar dig till en annan vy? Jo, precis som att du inte kan cykla på en cykel utan hjul så kan du inte navigera till en annan vy ifall länkarna inte finns inuti en `NavigationStack` eller `NavigationSplitView`.
th: แล้วทำไมคุณจึงต้องกังวลกับสร้าง `NavigationStack` หาก `NavigationLink` คือสิ่งที่พาคุณไปยังมุมมองอื่น ที่จริงแล้ว สิ่งนี้ก็เหมือนกับการที่คุณไม่สามารถปั่นจักรยานได้โดยไม่มีล้อนั่นล่ะ คุณไม่สามารถนำทางไปยังมุมมองอื่นได้ เว้นแต่ลิงก์ของคุณจะอยู่ภายใน `NavigationStack` หรือ`NavigationSplitView`
tr: Peki seni başka bir görüntüye götürmek için gereken şey bir `NavigationLink` ise neden bir `NavigationStack` yaratma zahmetine girdin? Tıpkı tekerleksiz bir bisikleti süremeyeceğin gibi, bağlantıların bir `NavigationStack`’in veya `NavigationSplitView`’un içinde değilse başka bir görüntüye gidemezsin.
vi: Vậy tại sao bạn phải bận tâm đến việc tạo ra một `NavigationStack` nếu `NavigationLink` là thứ đưa bạn đến một chế độ xem khác? Chà, cũng giống như việc bạn không thể đi xe đạp mà không có các bánh xe, bạn không thể điều hướng đến một chế độ xem khác trừ khi các liên kết nằm bên trong một `NavigationStack` hoặc `NavigationSplitView`.
zh_cn: 如果 `NavigationLink` 可将你导航到另一个视图，那为什么还要创建 `NavigationStack` 呢？就像骑自行车一样，没有轮子的车子没法骑，因此，只有将链接包含在 `NavigationStack` 或 `NavigationSplitView` 内，你才能导航到另一个视图。
zh_tw: 那麼，如果 `NavigationLink` 可以帶你到另一個顯示區，為什麼還要花工夫建立 `NavigationStack`？這就像你不能騎沒有輪子的自行車一樣，除非你的連結位於 `NavigationStack` 或 `NavigationSplitView` 內，否則你無法導覽至另一個顯示區。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskaddNavLink..title
source: Create a navigation link
de: Navigations-Link erstellen
es: Crear un enlace de navegación
es_419: Crear un enlace de navegación
fr: Créer un lien de navigation
it: Creare un link di navigazione
nl: Een navigatielink aanmaken
no: Opprett en navigeringslenke
pt: Crie um link de navegação
sv: Skapa en navigeringslänk
th: สร้างลิงก์การนำทาง
tr: Dolaşma bağlantısı yaratma
vi: Tạo một liên kết điều hướng
zh_cn: 创建导航链接
zh_tw: 製作一個導覽連結

source: Your `NavigationStack` and `NavigationSplitView` can show different content based on how a person interacts with your app. For your navigation view to display a different view, create a [NavigationLink](glossary://navigation%20link), a button that a person can tap to navigate to a separate view.
de: `NavigationStack` und `NavigationSplitView` können je nach Interaktion mit der App unterschiedliche Inhalte anzeigen. Wenn die Navigationsansicht eine andere Ansicht anzeigen soll, erstelle eine Instanz von [NavigationLink](glossary://navigation%20link). Dabei handelt es sich um eine Taste, die beim Tippen zu einer anderen Ansicht navigiert.
es: Tu pila de navegación (`NavigationStack`) y la vista dividida de navegación (`NavigationSplitView`) pueden mostrar diferentes contenidos en función de cómo interactúe una persona con tu app. Para que la vista de navegación muestre una vista diferente, crea un enlace de navegación [NavigationLink](glossary://navigation%20link), un botón que esa persona puede tocar para navega a una vista distinta.
es_419: Tu visualización `NavigationStack` o `NavigationSplitView` puede mostrar diferentes contenidos en función de la forma en la que una persona interactúa con la app. Para que tu visualización de navegación muestre una visualización diferente, crea un [enlace de navegación](glossary://navigation%20link), es decir, un botón que se pueda tocar para ir a una visualización separada.
fr: Ta `NavigationStack` et ta `NavigationSplitView` peuvent afficher différents contenus en fonction de la manière dont une personne interagit avec ton app. Pour que ta vue de navigation affiche une vue différente, crée un [lien de navigation](glossary://navigation%20link), un bouton qu’une personne peut toucher pour naviguer vers une vue distincte.
it: Le viste `NavigationStack` e `NavigationSplitView` possono mostrare contenuti diversi in base al modo in cui una persona interagisce con l'app. Affinché la vista di navigazione mostri una vista diversa, crea un [link di navigazione](glossary://navigation%20link), un pulsante che una persona può toccare per passare a un'altra vista.
nl: Je `NavigationStack` en `NavigationSplitView` kunnen verschillende inhoud weergeven afhankelijk van de interactie van de gebruiker met je app. Als je navigatieweergave een andere weergave moet tonen, maak je een [NavigationLink](glossary://navigation%20link) aan. Dit is een knop die naar een afzonderlijke weergave navigeert wanneer een gebruiker erop tikt.
no: `NavigationStack` og `NavigationSplitView` kan vise forskjellig innhold basert på hvordan en person samhandler med appen. Hvis du vil at navigeringsvisningen skal vise en annen visning, oppretter du en [NavigationLink](glossary://navigation%20link) i form av en knapp som en person kan trykke på for å navigere til en separat visning.
pt: O `NavigationStack` e a `NavigationSplitView` podem mostrar um conteúdo diferente dependendo de como uma pessoa interage com o app. Para que a visualização de navegação mostre uma visualização diferente, crie um [Link de Navegação](glossary://navigation%20link), um botão que uma pessoa pode tocar para navegar para uma visualização separada.
sv: `NavigationStack` och `NavigationSplitView` kan visa olika innehåll beroende på hur en person interagerar med appen. Om du vill att navigeringsvyn ska visa en annan vy skapar du en [NavigationLink](glossary://navigation%20link) i form av en knapp som en person kan trycka på för att navigera till en separat vy.
th: `NavigationStack` และ `NavigationSplitView` สามารถแสดงเนื้อหาที่แตกต่างกันได้ตามวิธีที่คนอื่นโต้ตอบกับแอปของคุณ ถ้าต้องการให้มุมมองการนำทางของคุณแสดงมุมมองอื่น ให้สร้าง [NavigationLink](glossary://navigation%20link) ซึ่งเป็นปุ่มที่คนอื่นสามารถแตะเพื่อนำทางไปยังมุมมองแยกต่างหากได้
tr: `NavigationStack`’in ve `NavigationSplitView`’un bir kişinin uygulamanla nasıl etkileşimde bulunduğuna göre farklı içerikler gösterebilir. Dolaşma görüntünün farklı bir görüntü göstermesi için kişinin ayrı bir görüntüye gitmek üzere dokunabileceği bir düğme olan [NavigationLink](glossary://navigation%20link) yarat.
vi: `NavigationStack` và `NavigationSplitView` của bạn có thể hiển thị nội dung khác nhau dựa trên cách một người tương tác với ứng dụng của bạn. Để chế độ xem điều hướng của bạn hiển thị một chế độ xem khác, hãy tạo ra một [NavigationLink](glossary://navigation%20link), một nút mà một người có thể chạm vào để điều hướng đến một chế độ xem riêng biệt.
zh_cn: `NavigationStack` 和 `NavigationSplitView` 可基于用户与 App 的交互方式，显示不同的内容。如果要让导航视图显示不同的视图，创建一个 [NavigationLink](glossary://navigation%20link)，作为用户可轻点来导航到单独视图的按钮。
zh_tw: 你的`NavigationStack` 和 `NavigationSplitView` 可以根據使用者與你的 App 互動的方式來顯示不同的內容。若要讓你的導覽顯示區呈現不同的顯示區，請建立一個 [NavigationLink](glossary://navigation%20link)，使用者可點按此按鈕來導覽至獨立的顯示區。

source: A `NavigationLink` must contain two things:
de: Ein `NavigationLink` muss zwei Dinge enthalten:
es: Un enlace de navegación (`NavigationLink`) debe contener dos cosas:
es_419: Un enlace de navegación, `"NavigationLink"`, debe contener dos cosas:
fr: Un `NavigationLink` doit contenir deux éléments :
it: Un `NavigationLink` deve contenere due elementi:
nl: Een `NavigationLink` moet twee dingen bevatten:
no: En `NavigationLink` må inneholde to ting:
pt: Um `NavigationLink` precisa conter duas coisas:
sv: En `NavigationLink` måste innehålla två saker:
th: `NavigationLink` ต้องมีสองสิ่ง:
tr: Bir `NavigationLink` iki şey içermelidir:
vi: Một `NavigationLink` phải chứa hai thứ:
zh_cn: `NavigationLink` 必须包含两个内容：
zh_tw: `NavigationLink` 必須包含兩個東西：

source: A link to the [destination view](glossary://destination%20view).
de: Ein Link zur [Zielansicht](glossary://destination%20view).
es: Un enlace a la [vista de destino](glossary://destination%20view).
es_419: Un enlace a la [visualización de destino](glossary://destination%20view).
fr: Un lien vers la [vue de destination](glossary://destination%20view).
it: Un link alla [vista di destinazione](glossary://destination%20view).
nl: Een link naar de [doelweergave](glossary://destination%20view).
no: En lenke til [målvisningen](glossary://destination%20view).
pt: Um link para a [visualização de destino](glossary://destination%20view).
sv: En länk till [målvyn](glossary://destination%20view).
th: ลิงก์ที่ไปยัง[มุมมองปลายทาง](glossary://destination%20view)
tr: [Hedef görüntüye](glossary://destination%20view) bağlantı.
vi: Một liên kết đến [chế độ xem đích](glossary://destination%20view).
zh_cn: [目的视图](glossary://destination%20view)的链接。
zh_tw: 導向[目標顯示區](glossary://destination%20view)的連結。

source: A [label](glossary://label) (how the button should appear).
de: Ein [Etikett](glossary://label) (wie die Taste angezeigt werden soll).
es: Una [etiqueta](glossary://label) (cómo debe aparecer el botón).
es_419: Una [etiqueta](glossary://label) (cómo el botón debería mostrarse).
fr: Une [étiquette](glossary://label) (la manière dont le bouton doit s’afficher).
it: Un'[etichetta](glossary://label) (il presunto aspetto del pulsante).
nl: Een [label](glossary://label) (hoe de knop wordt weergegeven).
no: En [etikett](glossary://label) (hvordan knappen skal vises).
pt: Uma [etiqueta](glossary://label) (como o botão deve aparecer).
sv: En [etikett](glossary://label) (hur knappen ska visas).
th: [ป้าย](glossary://label) (ลักษณะที่ปุ่มควรแสดง)
tr: Bir [etiket](glossary://label) (düğmenin nasıl görünmesi gerektiği).
vi: Một [nhãn](glossary://label) (cách mà nút xuất hiện).
zh_cn: [标签](glossary://label)（按钮应当如何显示）。
zh_tw: [標籤](glossary://label)（按鈕的顯示方式）。

source: The destination can be any view you want – something simple like a `Text` or `Image` view, or even a [composed view](glossary://composed%20view) you’ve created yourself.
de: Als Ziel kannst du jede gewünschte Ansicht auswählen. Das kann so etwas Einfaches sein wie eine `Text`- oder `Image`-Ansicht oder sogar eine [zusammengesetzte Ansicht](glossary://composed%20view), die du selbst erstellt hast.
es: El destino puede ser cualquier vista que quieras: algo tan simple como una vista `Text` o `Image`, o incluso una [vista compuesta](glossary://composed%20view) que hayas creado tú mismo.
es_419: El destino puede ser cualquier visualización que quieras; algo sencillo como una visualización `"Text"` o `"Image"`, o incluso tu propia [visualización compuesta](glossary://composed%20view).
fr: La destination peut être n’importe quelle vue que tu veux, quelque chose de simple comme une vue `Text` ou `Image`, ou même une [vue composée](glossary://composed%20view) que tu as toi-même créée.
it: La destinazione può corrispondere a una vista di qualsiasi tipo: da quelle più semplici come le viste `Text` o `Image`, fino a quelle [composte](glossary://composed%20view) che hai creato tu.
nl: Je bepaalt zelf welke doelweergave je wilt gebruiken, iets eenvoudigs als een `Text`- of `Image`-weergave of een [samengestelde weergave](glossary://composed%20view) die je zelf hebt gemaakt.
no: Målet kan være hvilken som helst visning: noe enkelt som en `Text`- eller `Image`-visning, eller til og med en [sammenstilt visning](glossary://composed%20view) som du selv har opprettet.
pt: O destino pode ser qualquer visualização que você quiser, desde algo simples como uma visualização `Text` ou `Image` até uma [visualização composta](glossary://composed%20view) criada por você.
sv: Målet kan vara vilken vy du vill: något enkelt som en `Text`- eller `Image`-vy eller till och med en [sammanställd vy](glossary://composed%20view) som du själv har skapat.
th: ปลายทางสามารถเป็นมุมมองใดก็ได้ที่คุณต้องการ ไม่ว่าจะเป็นมุมมองอย่างง่าย เช่น มุมมอง `Text` หรือ `Image` หรือแม้กระทั่ง[มุมมองที่ถูกประกอบ](glossary://composed%20view)ที่คุณได้สร้างด้วยตัวเอง
tr: Hedef istediğin herhangi bir görüntü, `Text` veya `Image` görüntüsü gibi basit bir şey ya da kendi yarattığın [oluşturulmuş görüntü](glossary://composed%20view) bile olabilir.
vi: Đích có thể là bất kỳ chế độ xem nào mà bạn muốn – một thứ gì đó đơn giản như một chế độ xem `Text` hoặc `Image` hay thậm chí là một [chế độ xem tổ hợp](glossary://composed%20view) mà bạn đã tạo ra cho chính mình.
zh_cn: 目的位置可以是你想要的任何视图，可以简单点像 `Text` 或 `Image` 视图，还甚至可以是自己已创建的[组合视图](glossary://composed%20view)。
zh_tw: 目標可以是任何你想要的顯示區：簡單的像 `Text` 或 `Image` 顯示區，甚至是你自己製作的[組合式顯示區](glossary://composed%20view)。

source: The code below creates a `NavigationLink` with a `Text` view as the [label](glossary://label) and a `Text` view as the [destination](glossary://destination%20view).
de: Der unten aufgeführte Code erstellt einen `NavigationLink` mit einer `Text`-Ansicht als [Etikett](glossary://label) und einer `Text`-Ansicht als [Ziel](glossary://destination%20view).
es: El código siguiente crea un enlace de navegación (`NavigationLink`) con una vista `Text` (texto) como [etiqueta](glossary://label) y una vista `Text` (texto) como [destino](glossary://destination%20view).
es_419: El siguiente código crea un enlace `"NavigationLink"` con una visualización `"Text"` como [etiqueta](glossary://label) y otra visualización `"Text"` como [destino](glossary://destination%20view).
fr: Le code ci-dessous crée un `NavigationLink` avec une vue `Text` comme [étiquette](glossary://label) et une vue `Text` comme [destination](glossary://destination%20view).
it: Il codice mostrato sotto crea un `NavigationLink` con una vista `Text` come [etichetta](glossary://label) e una vista `Text` come [destinazione](glossary://destination%20view).
nl: Met de onderstaande code maak je een `NavigationLink` aan met een `Text`-weergave als het [label](glossary://label) en een `Text`-weergave als het [doel](glossary://destination%20view).
no: Koden nedenfor oppretter en `NavigationLink` med en `Text`-visning som [etikett](glossary://label) og en `Text`-visning som [mål](glossary://destination%20view).
pt: O código abaixo cria um `NavigationLink` com uma visualização `Text` como [etiqueta](glossary://label) e uma visualização `Text` como o [destino](glossary://destination%20view).
sv: Koden nedanför skapar en `NavigationLink` med en `Text`-vy som [etikett](glossary://label) och en `Text`-vy som [mål](glossary://destination%20view).
th: โค้ดด้านล่างจะสร้าง `NavigationLink` ที่มีมุมมอง `Text` เป็น[ป้าย](glossary://label)และมุมมอง `Text` เป็น[ปลายทาง](glossary://destination%20view)
tr: Aşağıdaki kod, [etiket](glossary://label) olarak `Text` görüntüsü ve [hedef](glossary://destination%20view) olarak `Text` görüntüsü ile bir `NavigationLink` yaratır.
vi: Mã bên dưới tạo ra một `NavigationLink` với một chế độ xem `Text` dưới dạng [nhãn](glossary://label) và một chế độ xem `Text` dưới dạng [đích](glossary://destination%20view).
zh_cn: 以下代码创建了一个 `NavigationLink`，其中包含一个作为[标签](glossary://label)的 `Text` 视图，以及一个作为[目的位置](glossary://destination%20view)的 `Text` 视图。
zh_tw: 下面的程式碼會建立一個 `NavigationLink`，其中一個 `Text` 顯示區作為[標籤](glossary://label)，一個 `Text` 顯示區作為[目標](glossary://destination%20view)。

source: Try adding the `NavigationLink` below and tap the link in the preview.
de: Versuche, den `NavigationLink` unten einzufügen, und tippe auf den Link in der Vorschau.
es: Prueba a añadir el enlace de navegación (`NavigationLink`) debajo y toca el enlace de la vista previa.
es_419: Intenta agregar el `NavigationLink` debajo, y luego toca el enlace en la vista previa.
fr: Essaie d’ajouter le `NavigationLink` ci-dessous et touche le lien dans l’aperçu.
it: Prova ad aggiungere il `NavigationLink` di seguito e a toccare il link nell'anteprima.
nl: Voeg de onderstaande `NavigationLink` toe en tik op de link in de voorvertoning.
no: Prøv å legge til `NavigationLink` nedenfor, og trykk på lenken i forhåndsvisningen.
pt: Tente adicionar o `NavigationLink` abaixo e toque no link da pré‑visualização.
sv: Prova att lägga till `NavigationLink` nedan och tryck på länken i förhandsvisningen.
th: ลองเพิ่ม `NavigationLink` ด้านล่างแล้วแตะที่ลิงก์ในการแสดงตัวอย่าง
tr: Aşağıda `NavigationLink`’i eklemeyi dene ve önizlemede bağlantıya dokun.
vi: Thử thêm `NavigationLink` ở bên dưới và chạm vào liên kết trong bản xem trước.
zh_cn: 尝试在下方添加 `NavigationLink`，然后轻点预览中的链接。
zh_tw: 嘗試加入下方的 `NavigationLink` 並且在預覽中點一下連結。

source: NavigationLink("Push Me!") { Text("I'm the destination View") .navigationTitle("Destination") }
de: NavigationLink("Drück mich!") { Text("Ich bin die Zielansicht") .navigationTitle("Ziel") }
es: NavigationLink("¡Púlsame!") { Text("Soy la vista de destino") .navigationTitle("Destino") }
es_419: NavigationLink("¡Presióname!") { Text("Soy la visualización de destino") .navigationTitle("Destino") }
fr: NavigationLink("Appuie sur moi !") { Text("Je suis la vue de destination") .navigationTitle("Destination") }
it: NavigationLink("Premimi!") { Text("Sono la vista di destinazione") .navigationTitle("Destination") }
nl: NavigationLink("Tik hier!") { Text("Ik ben de doelweergave") .navigationTitle("Doel") }
pt: NavigationLink("Push Me!") { Text("Sou a Visualização de destino") .navigationTitle("Destination") }
sv: NavigationLink("Tryck på mig!") { Text("Jag är målvyn") .navigationTitle("Destination") }
th: NavigationLink("กดฉันสิ!") { Text("ฉันคือมุมมองปลายทาง") .navigationTitle("ปลายทาง") }
tr: NavigationLink(“Bana Bas!”) { Text("Ben hedef görüntüyüm") .navigationTitle("Hedef") }
vi: NavigationLink("Hãy đẩy tôi!") { Text("Tôi là chế độ xem đích") .navigationTitle("Đích") }
zh_cn: NavigationLink("按下我！") { Text("我是目的视图") .navigationTitle("目的位置") }
zh_tw: NavigationLink("Push Me!") { Text(“我是目標顯示區") .navigationTitle("Destination") } ```

source: Add one more navigation link, and try navigating to the different views in your `NavigationStack`.
de: Füge einen weiteren Navigations-Link hinzu und versuche, zu den verschiedenen Ansichten in `NavigationStack` zu navigieren.
es: Añade un enlace de navegación más e intenta navegar a las diferentes vistas de la pila de navegación (`NavigationStack`).
es_419: Agrega un enlace de navegación más e intenta navegar a distintas visualizaciones de tu `NavigationStack`.
fr: Ajoute un autre lien de navigation et essaie de naviguer vers les différentes vues de ta `NavigationStack`.
it: Aggiungi un altro link di navigazione e prova a navigare verso le diverse viste in `NavigationStack`.
nl: Voeg nog een navigatielink toe en probeer naar de andere weergaven in je `NavigationStack` te navigeren.
no: Legg til en navigeringslenke til, og prøv å navigere til de ulike visningene i `NavigationStack`.
pt: Adicione mais um link de navegação e tente navegar para as outras visualizações no `NavigationStack`.
sv: Lägg till ytterligare en navigeringslänk och prova att navigera till de olika vyerna i `NavigationStack`.
th: เพิ่มลิงก์การนำทางอีกหนึ่งลิงก์ แล้วลองนำทางไปยังมุมมองต่างๆ ใน `NavigationStack` ของคุณ
tr: Bir tane daha dolaşma bağlantısı ekle ve `NavigationStack`’inde farklı görüntülere gitmeyi dene.
vi: Thêm một liên kết điều hướng nữa và thử điều hướng đến các chế độ xem khác nhau trong `NavigationStack` của bạn.
zh_cn: 再添加一个导航链接，然后尝试导航到 `NavigationStack` 中的不同视图。
zh_tw: 再加入一個導覽連結，並嘗試導覽至 `NavigationStack` 中的不同顯示區。
