Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: To create a new creature, [initialize](glossary://initialization) it by giving it a name and passing in a single emoji character. When adding creatures to the array, separate each creature’s data with a comma; for example:
de: Um einen neuen Charakter zu erstellen, [initialisiere](glossary://initialization) ihn, indem du ihm einen Namen gibst und ein Emoji übergibst. Beim Hinzufügen von Charakteren zum Array müssen die Daten der jeweiligen Charaktere durch ein Komma getrennt sein, z. B.:
es: Para crear una nueva criatura, se debe [inicializar](glossary://initialization) dándole un nombre y pasando un único emoji. Al añadir criaturas al vector, separa los datos de cada criatura con una coma; por ejemplo:
es_419: Para crear una criatura nueva, [inicialízala](glossary://initialization) dándole un nombre y pasando un solo emoji. Cuando agregues criaturas al arreglo, tienes que separar cada una con una coma; por ejemplo:
fr: Pour créer une nouvelle créature, [initialise](glossary://initialization)-la en lui donnant un nom et en transmettant un Emoji. Lorsque tu ajoutes des créatures au tableau, sépare les données de chacune d’entre elles par une virgule. Voici un exemple :
it: Per programmare una nuova creatura, [inizializzala](glossary://initialization) assegnandole un nome e trasmettendo un singolo carattere emoji. Quando aggiungi una creatura all'array, separa i dati di ciascuna di esse con una virgola. Ad esempio:
nl: Om een nieuw wezen aan te maken, [initialiseer](glossary://initialization) je het door het een naam te geven en er een afzonderlijk emojiteken aan door te geven. Als je wezens aan de array toevoegt, moet je de gegevens van elk wezen van elkaar scheiden met een komma, zoals:
no: Når du vil lage en ny skapning, [initialiserer](glossary://initialization) du den ved å navngi skapningen og overføre ett emojitegn. Når du legger til skapninger i matrisen, må du separere hver skapnings data med et komma, for eksempel:
pt: Para criar uma nova criatura, dê um nome a ela e passe um único caractere de emoji para [inicializá-la](glossary://initialization). Ao adicionar criaturas ao vetor, separe os dados de cada criatura com uma vírgula, por exemplo:
sv: När du vill skapa en ny varelse [initierar](glossary://initialization) du den genom att namnge varelsen och överföra ett enda emojitecken. När du lägger till varelser i arrayen måste du separera varje varelses data med ett kommatecken, till exempel:
th: ในการสร้างสิ่งมีชีวิตใหม่ ให้[สร้างค่าเริ่มต้น](glossary://initialization)สำหรับสิ่งมีชีวิตโดยตั้งชื่อสิ่งมีชีวิตและส่งผ่านอักขระอิโมจิตัวเดียว เมื่อเพิ่มสิ่งมีชีวิตไปยังอาร์เรย์ ให้แยกข้อมูลของสิ่งมีชีวิตแต่ละตัวด้วยจุลภาค ตัวอย่างเช่น:
tr: Yeni bir yaratık yaratmak için ona bir ad verip tek bir emoji karakterini geçirerek yaratığa bir [ilk değer ata](glossary://initialization). Diziye yaratık eklerken her bir yaratık verisini virgülle ayır; örneğin:
vi: Để tạo ra một sinh vật mới, hãy [khởi tạo](glossary://initialization) sinh vật bằng cách cung cấp một tên và chuyển vào một ký tự biểu tượng đơn nhất. Khi thêm các sinh vật vào dãy, hãy tách dữ liệu của từng sinh vật bằng một dấu phẩy; ví dụ:
zh_cn: 若要创建新动物，给动物命名并传入单个表情符号角色来将它[初始化](glossary://initialization)。在将动物添加到数组时，用逗号来分隔每个动物数据；例如：
zh_tw: 若要製作新的生物，請為它命名並傳入單一的表情符號字元來將它[初始化](glossary://initialization)。在陣列中加入生物時，要用逗號將每一個生物的資料分隔開來，例如：

source: Creature(name: "T-Rex", emoji: "🦖"),
es: Creature(name: "Tiranosaurio Rex", emoji: "🦖"),
zh_cn: Creature(name: "霸王龙", emoji: "🦖"),

source: Add at least one more creature to your array.
de: Füge mindestens noch einen Charakter zu deinem Array hinzu.
es: Añade al menos una criatura más a tu vector.
es_419: Agrega al menos una criatura más a tu arreglo.
fr: Ajoute au moins une autre créature à ton tableau.
it: Aggiungi almeno un'altra creatura al tuo array.
nl: Voeg ten minste nog één wezen toe aan je array.
no: Legg til minst én ekstra skapning i matrisen.
pt: Adicione ao menos mais uma criatura ao vetor.
sv: Lägg till minst en till varelse i arrayen.
th: เพิ่มสิ่งมีชีวิตอย่างน้อยอีกหนึ่งชนิดไปยังอาร์เรย์ของคุณ
tr: Dizine en az bir yaratık daha ekle.
vi: Thêm ít nhất một sinh vật nữa vào dãy của bạn.
zh_cn: 再添加至少一个动物到数组中。
zh_tw: 在你的陣列中再加入至少一個生物。

source: Creature(name: "Ladybug", emoji: "🐞"),
de: Creature(name: "Marienkäfer", emoji: "🐞"),
es: Creature(name: "Mariquita", emoji: "🐞"
fr: Creature(name: "Coccinelle", emoji: "🐞"),
no: Creature(name: "Marihøne", emoji: "🐞"),
pt: Creature(name: "Joaninha”, emoji: "🐞&quot,
tr: Creature(name: "Uğur Böceği", emoji: "🐞"),
vi: Creature(name: "Bọ rùa", emoji: "🐞"),
zh_cn: Creature(name: "瓢虫", emoji: "🐞"),

# GuideBook..Guide0..StepSharing Data Between Views..TaskusingCreatureZoo..title
source: Create a `StateObject`
de: `StateObject` erstellen
es: Crear un `StateObject`
es_419: Crear un objeto de estado
fr: Créer un `StateObject`
it: Creare uno `StateObject`
nl: Een `StateObject` aanmaken
no: Opprett et `StateObject`
pt: Crie um `StateObject`
sv: Skapa ett `StateObject`
th: สร้าง `StateObject`
tr: `StateObject` yaratma
vi: Tạo ra một `StateObject`
zh_cn: 创建 `StateObject`
zh_tw: 建立一個 `StateObject`

source: Before sharing your [observable object](glossary://observable%20object) across views, you’ll first explore what it looks like to use the data model in a single view.
de: Bevor du das [beobachtbare Objekt](glossary://observable%20object) mit anderen Ansichten teilst, lernst du, wie man das Datenmodell in einer Ansicht verwendet.
es: Antes de compartir tu [objeto observable](glossary://observable%20object) en las vistas, primero explorarás cómo es el uso del modelo de datos en una sola vista.
es_419: Antes de compartir tu [objeto observable](glossary://observable%20object) con varias visualizaciones, primero explorarás cómo se usa el modelo de datos en una sola visualización.
fr: Avant de partager ton [objet observable](glossary://observable%20object) entre des vues, tu vas commencer par explorer à quoi ressemble l’utilisation du modèle de données dans une seule vue.
it: Prima di condividere l'[oggetto osservabile](glossary://observable%20object) tra più viste, dovrai imparare come utilizzare il modello di dati in una vista singola.
nl: Voordat je je [observeerbare object](glossary://observable%20object) met de weergaven deelt, ga je eerst bekijken hoe het delen van het gegevensmodel in een afzonderlijke weergave werkt.
no: Før du deler det [observerbare objektet](glossary://observable%20object) mellom visninger, skal du først undersøke hvordan det er mulig å bruke datamodellen i én visning.
pt: Antes de compartilhar o [objeto observável](glossary://observable%20object) pelas visualizações, explore como é usar o modelo de dados em uma única visualização.
sv: Innan du delar ditt [observerbara objekt](glossary://observable%20object) mellan vyer ska du först undersöka hur det går till att använda datamodellen i en enda vy.
th: ก่อนจะแชร์[วัตถุที่สังเกตเห็นได้](glossary://observable%20object)ของคุณกับมุมมองต่างๆ คุณจะได้สำรวจก่อนว่าการใช้โมเดลข้อมูลในมุมมองเดียวมีลักษณะอย่างไร
tr: [Gözlemlenebilir nesneni](glossary://observable%20object) görüntüler genelinde paylaşmadan önce veri modelini tek bir görüntüde kullanmanın nasıl göründüğünü keşfedeceksin.
vi: Trước khi chia sẻ [đối tượng có thể quan sát](glossary://observable%20object) của bạn trong các chế độ xem, trước tiên bạn sẽ khám phá xem việc sử dụng mô hình dữ liệu trong một chế độ xem đơn nhất trông như thế nào.
zh_cn: 在视图间共享[可观测对象](glossary://observable%20object)前，你要先探索在单个视图中使用数据模型时它可能的外观。
zh_tw: 在不同的顯示區共享你的[可觀察的物件](glossary://observable%20object)之前，你要先探索在單一顯示區中使用資料模型的狀況。

source: In `ContentView`, initialize your observable object and create a list of creature views with the data.
de: Initialisiere in `ContentView` das beobachtbare Objekt und erstelle mit den Daten eine Liste mit Charakteransichten.
es: En `ContentView`, inicializa tu objeto observable y crea una lista de vistas de criaturas con los datos.
es_419: En la visualización `ContentView`, inicializa tu objeto observable y crea una lista de visualizaciones de criaturas con los datos.
fr: Dans `ContentView`, initialise ton objet observable et crée une liste de vues de créature avec les données.
it: In `ContentView`, inizializza il tuo oggetto osservabile e crea un elenco di viste delle creature con i dati.
nl: Initialiseer je observeerbare object in `ContentView` en maak een lijst met weergaven van wezens aan met de gegevens.
no: Du initialiserer det observerbare objektet i `ContentView` og oppretter en liste som inneholder skapningsvisninger sammen med dataene.
pt: Em `ContentView`, inicialize o seu objeto observável e crie uma lista de visualizações de criatura com os dados.
sv: Du initierar det observerbara objektet i `ContentView` och skapar en lista som innehåller varelsevyer tillsammans med data.
th: ใน `ContentView` ให้สร้างค่าเริ่มต้นสำหรับวัตถุที่สังเกตเห็นได้ของคุณและสร้างรายการสิ่งมีชีวิตที่มีข้อมูล
tr: `ContentView`’da, gözlemlenebilir nesnene ilk değer ata ve verilerle yaratık görüntülerinin bir listesini yarat.
vi: Trong `ContentView`, hãy khởi chạy đối tượng có thể quan sát của bạn và tạo ra một danh sách các chế độ xem sinh vật bằng dữ liệu đó.
zh_cn: 在 `ContentView` 中，初始化可观测对象，并使用这些数据创建动物视图列表。
zh_tw: 在 `ContentView` 中初始化你的可觀察物件，並使用資料製作一個生物顯示區列表。

source: To initialize an observable object like `CreatureZoo`, use a special property wrapper, `@StateObject`, so that SwiftUI can manage the data.
de: Verwende zum Initialisieren eines beobachtbaren Objekts wie `CreatureZoo` den speziellen Eigenschaftswrapper `@StateObject`, sodass SwiftUI die Daten verwalten kann.
es: Para inicializar un objeto observable como `CreatureZoo`, usa un contenedor de propiedades especial (`@StateObject`) para que SwiftUI pueda gestionar los datos.
es_419: Para inicializar un objeto observable, como `CreatureZoo`, debes usar un contenedor de propiedades especial, `@StateObject`, para que SwiftUI pueda administrar los datos.
fr: Pour initialiser un objet observable tel que `CreatureZoo`, utilise un wrapper de propriété spécial, `@StateObject`, afin que SwiftUI puisse gérer les données.
it: Per inizializzare un oggetto osservabile come `CreatureZoo`, utilizza un wrapper di proprietà specifico, `@StateObject`, in modo che SwiftUI riesca a gestire i dati.
nl: Om een observeerbaar object, zoals `CreatureZoo`, te initialiseren, gebruik je een speciale eigenschapwrapper, `@StateObject`, waarmee SwiftUI de gegevens kan beheren.
no: Du initialiserer et observerbart objekt som `CreatureZoo` med den bestemte egenskapsinnpakningen `@StateObject`, slik at SwiftUI kan håndtere dataene.
pt: Para inicializar um objeto observável como `CreatureZoo`, use um empacotador de propriedades especial, `@StateObject`, para que a SwiftUI possa gerenciar os dados.
sv: Du initierar ett observerbart objekt som `CreatureZoo` med den särskilda egenskapspaketeraren `@StateObject` så att SwiftUI kan hantera dess data.
th: ในการสร้างค่าเริ่มต้นให้กับวัตถุที่สังเกตเห็นได้อย่าง `CreatureZoo` ให้ใช้ตัวหุ้มคุณสมบัติพิเศษ `@StateObject` เพื่อให้ SwiftUI สามารถจัดการข้อมูลได้
tr: `CreatureZoo` gibi bir gözlemlenebilir nesneye ilk değer atamak için özel bir özellik sarmalayıcı (`@StateObject`) kullan, böylece SwiftUI bu verileri yönetebilir.
vi: Để khởi tạo một đối tượng có thể quan sát như `CreatureZoo`, hãy sử dụng một trình đóng gói thuộc tính đặc biệt, `@StateObject`, sao cho SwiftUI có thể quản lý dữ liệu.
zh_cn: 若要初始化 `CreatureZoo` 等可观测对象，使用特殊的属性包装器 `@StateObject`（状态对象），以便 SwiftUI 可以管理这些数据。
zh_tw: 若要初始化可觀察的物件（如 `CreatureZoo`）請使用特殊的屬性包覆 `@StateObject`，讓 SwiftUI 能管理資料。

source: You use the `@StateObject` property wrapper to tell SwiftUI to manage the observable object for you, similar to how you use `@State` to have SwiftUI manage a property in a view as a [state property](glossary://state%20property).
de: Verwende den Eigenschaftswrapper `@StateObject`, um SwiftUI anzuweisen, das beobachtbare Objekt für dich zu verwalten. Das funktioniert ähnlich wie bei der Verwendung von `@State`, um von SwiftUI eine Eigenschaft in einer Ansicht als [Statuseigenschaft](glossary://state%20property) verwalten zu lassen.
es: Utiliza el contenedor de propiedades `@StateObject` para decirle a SwiftUI que gestione el objeto observable por ti, al igual que se utiliza `@State` para que SwiftUI gestione una propiedad en una vista como una [propiedad de estado](glossary://state%20property).
es_419: Usa el contenedor de propiedades `@StateObject` para decirle a SwiftUI que administre el objeto observable por ti, parecido a cuando usas `@State` para hacer que SwiftUI administre una propiedad en una visualización como una [propiedad de estado](glossary://state%20property).
fr: Tu utilises le wrapper de propriété `@StateObject` pour indiquer à SwiftUI de gérer l’objet observable pour toi, de la même manière que tu utilises `@State` pour que SwiftUI gère une propriété dans une vue en tant que [propriété d’état](glossary://state%20property).
it: Utilizza il wrapper di proprietà `@StateObject` per indicare a SwiftUI di gestire l'oggetto osservabile al posto tuo, in modo analogo a come usi `@State` per consentire a SwiftUI di gestire una proprietà in una vista come [proprietà di stato](glossary://state%20property).
nl: Je gebruikt de eigenschapwrapper `@StateObject` om SwiftUI opdracht te geven om het observeerbare object voor jou te beheren. Dit is vergelijkbaar met de manier waarop je `@State` gebruikt om een eigenschap in een weergave als een [statuseigenschap](glossary://state%20property) te laten beheren door SwiftUI.
no: Du bruker egenskapsinnpakningen `@StateObject` til å be SwiftUI om å håndtere det observerbare objektet for deg, omtrent som når du bruker `@State` til å la SwiftUI håndtere en egenskap i en visning som en [statusegenskap](glossary://state%20property).
pt: Use o empacotador de propriedade `@StateObject` para ordenar que a SwiftUI gerencie o objeto observável, similar a como você usa `@State` para que a SwiftUI gerencie uma propriedade em uma visualização como uma [propriedade de estado](glossary://state%20property).
sv: Du använder egenskapspaketeraren `@StateObject` till att säga åt SwiftUI att hantera det observerbara objektet åt dig, ungefär som när du använder `@State` till att låta SwiftUI hantera en egenskap i en vy som en [statusegenskap](glossary://state%20property).
th: คุณใช้ตัวหุ้มคุณสมบัติ `@StateObject` เพื่อบอกให้ SwiftUI จัดการวัตถุที่สังเกตเห็นได้ให้กับคุณ ซึ่งคล้ายกับวิธีที่คุณใช้ `@State` เพื่อให้ SwiftUI จัดการคุณสมบัติในมุมมองเป็น[คุณสมบัติสถานะ](glossary://state%20property)
tr: Tıpkı SwiftUI’ın bir görüntüdeki özelliği [durum özelliği](glossary://state%20property) olarak yönetmesini sağlamak için `@State`’i kullanman gibi, SwiftUI’a gözlemlenebilir nesneyi senin için yönetmesini söylemek üzere `@StateObject` özellik sarmalayıcısını kullanırsın.
vi: Bạn sử dụng trình đóng gói thuộc tính `@StateObject` để yêu cầu SwiftUI quản lý đối tượng có thể quan sát cho mình, tương tự như cách bạn sử dụng `@State` để yêu cầu SwiftUI quản lý một thuộc tính trong một chế độ xem dưới dạng [thuộc tính trạng thái](glossary://state%20property).
zh_cn: 你使用 `@StateObject` 属性包装器让 SwiftUI 为你管理可观测对象，就像你使用 `@State` 让 SwiftUI 在视图中将属性作为[状态属性](glossary://state%20property)来管理一样。
zh_tw: 你使用`@StateObject` 屬性包覆告訴 SwiftUI 為你管理可觀察的物件，類似於你如何使用`@State` 讓 SwiftUI 管理顯示區中的屬性作為[狀態屬性](glossary://state%20property)。

source: In this case, you’re initializing the observable object `CreatureZoo`, and asking SwiftUI to manage it as a [state object](glossary://state%20object).
de: In diesem Fall initialisierst du das beobachtbare Objekt `CreatureZoo` und weist SwiftUI an, es als [Statusobjekt](glossary://state%20object) zu verwalten.
es: En este caso, estás inicializando el objeto observable `CreatureZoo` y pidiendo a SwiftUI que lo gestione como un [objeto de estado](glossary://state%20object).
es_419: En este caso, debes inicializar el objeto observable `CreatureZoo`, y pedirle a SwiftUI que lo administre como un [objeto de estado](glossary://state%20object).
fr: Dans ce cas, tu initialises l’objet observable `CreatureZoo` et tu demandes à SwiftUI de le gérer comme un [objet d’état](glossary://state%20object).
it: In questo caso, stai inizializzando l'oggetto osservabile `CreatureZoo` e stai chiedendo a SwiftUI di gestirlo come un [oggetto di stato](glossary://state%20object).
nl: In dit geval initialiseer je het observeerbare object `CreatureZoo` en vraag je SwiftUI om het te beheren als een [statusobject](glossary://state%20object).
no: I dette tilfellet initialiserer du det observerbare objektet `CreatureZoo` og ber SwiftUI om å håndtere det som et [statusobjekt](glossary://state%20object).
pt: Neste caso, você está inicializando o objeto observável `CreatureZoo` e pedindo à SwiftUI para gerenciá-lo como um [objeto de estado](glossary://state%20object).
sv: I det här fallet initierar du det observerbara objektet `CreatureZoo` och ber SwiftUI att hantera det som ett [statusobjekt](glossary://state%20object).
th: ในกรณีนี้ คุณจะสร้างค่าเริ่มต้นให้กับวัตถุที่สังเกตเห็นได้ `CreatureZoo` และขอให้ SwiftUI จัดการวัตถุนี้เป็น[วัตถุสถานะ](glossary://state%20object)
tr: Bu durumda, `CreatureZoo` gözlemlenebilir nesnesine ilk değer atıyorsun ve SwiftUI’dan bunu bir [durum nesnesi](glossary://state%20object) olarak yönetmesini istiyorsun.
vi: Trong trường hợp này, bạn đang khởi tạo đối tượng có thể quan sát `CreatureZoo` và yêu cầu SwiftUI quản lý dưới dạng một [đối tượng trạng thái](glossary://state%20object).
zh_cn: 在本例中，你正在初始化可观测对象 `CreatureZoo`，并告诉 SwiftUI 将它作为[状态对象](glossary://state%20object)来管理。
zh_tw: 在這個例子中，你正在初始化可觀察的物件 `CreatureZoo`，並要求 SwiftUI 將其作為[狀態物件](glossary://state%20object)來進行管理。

# GuideBook..Guide0..StepSharing Data Between Views..TaskcreateAList..title
source: Use model data in a view
de: Modelldaten in einer Ansicht verwenden
es: Usar el modelo de datos en una vista
es_419: Usar un modelo de datos en una visualización
fr: Utiliser les données d’un modèle dans une vue
it: Utilizzare il modello di dati in una vista
nl: Modelgegevens in een weergave gebruiken
no: Bruk modelldata i en visning
pt: Use o modelo de dados em uma visualização
sv: Använd modelldata i en vy
th: ใช้ข้อมูลโมเดลในมุมมอง
tr: Model verilerini bir görüntüde kullanma
vi: Sử dụng dữ liệu mô hình trong một chế độ xem
zh_cn: 在视图中使用模型数据
zh_tw: 在顯示區中使用模型資料

source: After initializing your data, you’ll use it to create a basic view. You’ll add a [ForEach](glossary://ForEach) view inside your `List` to show each of your creatures vertically in a column layout.
de: Nach der Initialisierung deiner Daten erstellst du damit eine einfache Ansicht. Du fügst eine [ForEach](glossary://ForEach)-Ansicht in `List` ein, um jeden Charakter vertikal in einem Spaltenlayout anzuzeigen.
es: Después de inicializar tus datos, los utilizarás para crear una vista básica. Añadirás una vista [ForEach](glossary://ForEach) dentro de `List` para mostrar cada una de tus criaturas verticalmente en una disposición en columnas.
es_419: Ahora que inicializaste tus datos, los usarás para crear una visualización básica. Debes agregar una visualización para el [ciclo ForEach](glossary://ForEach) dentro de tu visualización `List` con el objetivo de mostrar cada una de tus criaturas verticalmente en una disposición por columnas.
fr: Après avoir initialisé tes données, tu vas les utiliser pour créer une vue de base. Tu vas ajouter une vue [ForEach](glossary://ForEach) à l’intérieur de ta `List` pour afficher chacune de tes créatures verticalement dans une disposition en colonne.
it: Una volta che avrai inizializzato i dati, li userai per creare una vista di base. Aggiungerai una vista [ForEach](glossary://ForEach) all'interno di `List` affinché ciascuna creatura venga visualizzata in verticale in un layout a colonne.
nl: Nu het initialiseren van je gegevens ga je deze gebruiken om een basisweergave aan te maken. Je gaat een [ForEach](glossary://ForEach)-weergave toevoegen in je `List` om elk wezen verticaal in een kolomweergave te tonen.
no: Når du har initiert dataene, skal du bruke dem til å opprette en enkel visning. Du skal legge til en [ForEach](glossary://ForEach)-visning inni `List`, slik at alle skapningene vises vertikalt i en kolonnelayout.
pt: Depois de inicializar os dados, você os usará para criar uma visualização básica. Você adicionará uma visualização [ForEach](glossary://ForEach) dentro de `List` para mostrar cada uma das criaturas verticalmente em um layout de colunas.
sv: När du har initierat dina data ska du använda dem till att skapa en enkel vy. Du ska lägga till en [ForEach](glossary://ForEach)-vy inuti `List` så att alla varelserna visas vertikalt i en kolumnlayout.
th: หลังจากสร้างค่าเริ่มต้นให้กับข้อมูลของคุณแล้ว คุณจะได้ใช้ข้อมูลนี้เพื่อสร้างมุมมองพื้นฐาน คุณจะได้เพิ่มมุมมอง [ForEach](glossary://ForEach) ภายใน `List` ของคุณเพื่อแสดงสิ่งมีชีวิตแต่ละตัวของคุณในแนวตั้งในเค้าโครงคอลัมน์
tr: Verilerine ilk değer atadıktan sonra onları temel bir görüntü yaratmak için kullanacaksın. Yaratıklarının her birini sütun yerleşiminde düşey olarak göstermek için listenin (`List`) içine [ForEach](glossary://ForEach) görüntüsü ekleyeceksin.
vi: Sau khi khởi tạo dữ liệu, bạn sẽ sử dụng dữ liệu đó để tạo ra một chế độ xem cơ bản. Bạn sẽ thêm một chế độ xem [ForEach](glossary://ForEach) bên trong `List` để hiển thị từng sinh vật của mình theo chiều dọc trong một bố cục cột.
zh_cn: 初始化数据后，你将用它来创建基础视图。你将在 `List` 内添加一个 [ForEach](glossary://ForEach)（针对每个）视图，以分栏布局垂直显示每个动物。
zh_tw: 將資料初始化之後，你會使用它來製作基本顯示區。你將在 `List` 內加入一個 [ForEach](glossary://ForEach) 顯示區，以便在直欄佈局中垂直顯示每一個生物。
