Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..title
source: Keep Going with Apps
de: Weiter so mit Apps
es: Sigue adelante con las apps
es_419: Apps avanzadas
fr: Continuer avec des apps
it: Continua con le app
nl: Doorgaan met apps
no: Fortsett med apper
pt: Continue com Apps
sv: Fortsätt med appar
th: สร้างแอปต่อไป อย่ายอมแพ้!
tr: Uygulamalara Devam
vi: Tiếp tục với các ứng dụng
zh_cn: 继续构建 App
zh_tw: 繼續製作 App

# GuideBook..IntroKeep Going with Apps..title
source: Keep Going with Apps
de: Weiter so mit Apps
es: Sigue adelante con las apps
es_419: Apps avanzadas
fr: Continuer avec des apps
it: Continua con le app
nl: Doorgaan met apps
no: Fortsett med apper
pt: Continue com Apps
sv: Fortsätt med appar
th: สร้างแอปต่อไป อย่ายอมแพ้!
tr: Uygulamalara Devam
vi: Tiếp tục với các ứng dụng
zh_cn: 继续构建 App
zh_tw: 繼續製作 App

# GuideBook..IntroKeep Going with Apps..Paragraph0
source: In Get Started with Apps, you learned how to use SwiftUI [views](glossary://view) to create a simple user interface. In SwiftUI, [views](glossary://view) are [UI](glossary://user%20interface) building blocks that you can place inside one another to piece together more complex [composed views](glossary://composed%view).
de: In „Los gehts mit Apps“ hast du gelernt, wie du SwiftUI-[Ansichten](glossary://view) verwendest, um eine einfache Benutzeroberfläche zu erstellen. [Ansichten](glossary://view) sind in SwiftUI Bausteine für die [Benutzeroberfläche](glossary://user%20interface), die ineinander platziert werden können, um komplexere [zusammengesetzte Ansichten](glossary://composed%view) zu erzeugen.
es: En “Empieza a usar las apps”, has aprendido a usar las [vistas](glossary://view) de SwiftUI para crear una interfaz de usuario sencilla. En las [vistas](glossary://view) de SwiftUI están los elementos básicos de la [IU](glossary://user%20interface) que puedes colocar unos dentro de otros para componer [vistas compuestas](glossary://composed%view) más complejas.
es_419: En Introducción a las apps, aprendiste a usar [visualizaciones](glossary://view) de SwiftUI para crear una interfaz de usuario sencilla. En SwiftUI, las [visualizaciones](glossary://view) son bloques de construcción de la [interfaz de usuario](glossary://user%20interface) que puedes colocar unos dentro de otros para crear [visualizaciones compuestas](glossary://composed%view) más complejas.
fr: Dans Premiers pas avec les apps, tu as appris à utiliser les [vues](glossary://view) SwiftUI pour créer une interface utilisateur simple. Dans SwiftUI, les [vues](glossary://view) sont des composantes de l’[interface utilisateur](glossary://user%20interface) que tu peux placer les unes dans les autres pour constituer des [vues composées](glossary://composed%view) plus complexes.
it: In “Introduzione alle app”, hai imparato come utilizzare le [viste](glossary://view) in SwiftUI per creare una semplice interfaccia utente. In SwiftUI, le [viste](glossary://view) sono i blocchi costitutivi dell'[interfaccia utente](glossary://user%20interface) che puoi inserire uno dentro l'altro per creare [viste composte](glossary://composed%view) di complessità crescente.
nl: In Aan de slag met apps heb je geleerd hoe je SwiftUI-weergaven gebruikt om een eenvoudige gebruikersinterface aan te maken. Ter herinnering, [weergaven](glossary://view) zijn in SwiftUI bouwstenen voor de [gebruikersinterface](glossary://user%20interface) die in andere weergaven kunnen worden geplaatst om meer complexe [samengestelde weergaven](glossary://composed%view) aan te maken.
no: I Kom i gang med apper lærte du å bruke SwiftUI-[visninger](glossary://view) til å lage et enkelt brukergrensesnitt. [Visninger](glossary://view) i SwiftUI er [UI](glossary://user%20interface)-byggesteiner som du kan plassere inni hverandre for å bygge mer komplekse [sammenstilte visninger](glossary://composed%view).
pt: Em Comece com Apps, você aprendeu a usar as [visualizações](glossary://view) da SwiftUI para criar uma interface de usuário simples. Em SwiftUI, as [visualizações](glossary://view) são os blocos de construção de [IU](glossary://user%20interface) que você coloca dentro de outros para montar [visualizações compostas](glossary://composed%view) mais complexas.
sv: I Kom igång med appar lärde du dig att använda SwiftUI-[vyer](glossary://view) till att skapa ett enkelt användargränssnitt. [Vyer](glossary://view) i SwiftUI är [UI](glossary://user%20interface)-byggstenar som du kan placera inuti varandra för att bygga mer komplexa [sammanställda vyer](glossary://composed%view).
th: ใน[เริ่มต้นใช้ด้วยแอป](link://getstartedwithApps) คุณได้เรียนรู้วิธีใช้[มุมมอง](glossary://view) SwiftUI เพื่อสร้างอินเทอร์เฟซผู้ใช้อย่างง่าย ใน SwiftUI [มุมมอง](glossary://view)เป็นองค์ประกอบหลักของ [UI](glossary://user%20interface) ที่คุณสามารถวางไว้ภายในกันและกันเพื่อรวมเป็น[มุมมองที่ถูกประกอบ](glossary://composed%view)ที่ซับซ้อนมากยิ่งขึ้นได้
tr: Uygulamaları Kullanmaya Başlama’da, basit bir kullanıcı arayüzü yaratmak için SwiftUI [görüntülerini](glossary://view) nasıl kullanacağını öğrendin. SwiftUI’da [görüntüler](glossary://view), daha karmaşık [oluşturulmuş görüntüleri](glossary://composed%view) bir araya getirmek için birbirinin içine yerleştirebileceğin [kullanıcı arayüzü](glossary://user%20interface) yapı taşlarıdır.
vi: Trong phần Bắt đầu với các ứng dụng, bạn đã học cách sử dụng các [chế độ xem](glossary://view) của SwiftUI để tạo ra một giao diện người dùng đơn giản. Trong SwiftUI, [chế độ xem](glossary://view) là các khối xây dựng [UI](glossary://user%20interface) mà bạn có thể đặt bên trong nhau để kết hợp cùng nhau thành các [chế độ xem tổ hợp](glossary://composed%view) phức tạp hơn.
zh_cn: 在“开始构建 App”中，你学习了如何使用 SwiftUI [视图](glossary://view)创建一个简单的用户界面。在 SwiftUI 中，[视图](glossary://view)即 [UI](glossary://user%20interface) 构建块，可放置在另一个视图内以拼凑出更复杂的[组合视图](glossary://composed%view)。
zh_tw: 在「App 使用入門」中，你學習了如何使用 SwiftUI [顯示區](glossary://view)來建立簡單的使用者介面。在 SwiftUI 中，[顯示區](glossary://view)是 [UI](glossary://user%20interface) 的建構基礎，你可以將它們放在彼此內部來拼湊出更複雜的[組合式顯示區](glossary://composed%view)。

# GuideBook..IntroKeep Going with Apps..Paragraph1
source: Here, you’ll learn about [state](glossary://state) and [data flow](glossary://data%20flow) in SwiftUI. Data flow is the movement of values throughout your app, and how SwiftUI updates your UI to reflect any changes to those values. Importantly, you’ll learn how to [separate your app data](glossary://data%20separation) from the views that display it, and why this separation is beneficial.
de: Hier erfährst du mehr über die Konzepte [Status](glossary://state) und [Datenfluss](glossary://data%20flow) in SwiftUI. Unter Datenfluss versteht man die Bewegung von Werten durch die App und die Art und Weise, wie SwiftUI die Benutzeroberfläche aktualisiert, um Änderungen an diesen Werten darzustellen. Du lernst hier etwas sehr Wichtiges, und zwar wie du [deine App-Daten getrennt](glossary://data%20separation) von den Ansichten hältst, die diese Daten anzeigen, und wieso diese Trennung sinnvoll ist.
es: Aquí aprenderás sobre el [estado](glossary://state) y el [flujo de datos](glossary://data%20flow) en SwiftUI. El flujo de datos es el movimiento de valores por toda tu app, y cómo SwiftUI actualiza la IU para reflejar cualquier cambio en esos valores. Lo más importante es que aprenderás a [separar los datos de tu app](glossary://data%20separation) de las vistas que la muestran, y por qué esta separación es beneficiosa.
es_419: Aquí, aprenderás sobre el [estado](glossary://state) y el [flujo de datos](glossary://data%20flow) en SwiftUI. El flujo de datos se refiere al movimiento de valores por toda tu app y a la forma en la que SwiftUI actualiza tu interfaz de usuario para reflejar cualquier cambio en dichos valores. Específicamente, aprenderás a [separar los datos de tu app](glossary://data%20separation) de las visualizaciones que los muestran, y entenderás por qué esto es tan útil.
fr: Ici, tu vas découvrir l’[état](glossary://state) et le [flux de données](glossary://data%20flow) dans SwiftUI. Le flux de données est le mouvement de valeurs à travers ton app et la manière dont SwiftUI met à jour ton interface utilisateur pour refléter toute modification de ces valeurs. Surtout, tu apprendras comment [séparer les données de ton app](glossary://data%20separation) des vues qui les affichent, et pourquoi cette séparation est bénéfique.
it: In questa attività, acquisirai informazioni sullo [stato](glossary://state) e sul [flusso di dati](glossary://data%20flow) in SwiftUI. Il flusso di dati è il movimento di valori all'interno dell'app e il modo in cui SwiftUI aggiorna l'interfaccia utente in risposta alle modifiche apportate a tali valori. Imparerai, inoltre, come [separare i dati della tua app](glossary://data%20separation) dalle viste che la visualizzano e perché tale separazione rappresenta un vantaggio.
nl: In deze zelfstudie ga je meer leren over de concepten [status](glossary://state) en [gegevensstroom](glossary://data%20flow) in SwiftUI. Met een gegevensstroom wordt de verplaatsing van gegevens in een app bedoeld en de manier waarop SwiftUI de gebruikersinterface bijwerkt om veranderingen in die waarden weer te geven. Je gaat leren hoe je de [appgegevens scheidt](glossary://data%20separation) van de weergaven waarin die gegevens worden getoond en welke voordelen deze scheiding oplevert.
no: Her lærer du om [statuser](glossary://state) og [dataflyter](glossary://data%20flow) i SwiftUI. En dataflyt er bevegelsen av verdier gjennom appen og hvordan SwiftUI oppdaterer brukergrensesnittet for å gjenspeile endringer av disse verdiene. En viktig ting du lærer deg er å [separere appdata](glossary://data%20separation) fra visningene som viser dem, og hvordan du drar nytte av denne separasjonen.
pt: Aqui, você aprenderá sobre o [estado](glossary://state) e [fluxo de dados](glossary://data%20flow) em SwiftUI. Fluxo de dados é o movimento de valores por todo o app e como a SwiftUI atualiza a IU para refletir qualquer alteração nesses valores. Não menos importante, você aprenderá como [separar os dados do app](glossary://data%20separation) das visualizações que os mostram e por que essa separação é benéfica.
sv: Här lär du dig om [statusar](glossary://state) och [dataflöden](glossary://data%20flow) i SwiftUI. Ett dataflöde är rörelsen av värden genom appen och hur SwiftUI uppdaterar UI:t för att återspegla ändringar av de värdena. En viktig sak du lär dig är att [separera appdata](glossary://data%20separation) från vyerna som visar dem och hur du drar nytta av den här separeringen.
th: ในส่วนนี้ คุณจะได้เรียนรู้เกี่ยวกับ[สถานะ](glossary://state)และ[ลำดับข้อมูล](glossary://data%20flow)ใน SwiftUI ลำดับข้อมูลคือการเคลื่อนไหวของค่าต่างๆ ภายในแอปของคุณ และวิธีที่ SwiftUI อัปเดต UI ของคุณเพื่อสะท้อนการเปลี่ยนแปลงของค่าเหล่านั้น ที่สำคัญ คุณจะได้เรียนรู้วิธี[แยกข้อมูลแอปของคุณ](glossary://data%20separation)ออกจากมุมมองที่แสดงข้อมูลนั้น และเหตุผลที่การแยกนี้เป็นประโยชน์
tr: Burada, SwiftUI'daki [durum](glossary://state) ve [veri akışı](glossary://data%20flow) hakkında bilgi edineceksin. Veri akışı, uygulamandaki değerlerin hareketi ve SwiftUI’ın bu değerlerdeki değişiklikleri yansıtmak üzere kullanıcı arayüzünü güncelleme şeklidir. Daha da önemlisi, uygulama verilerini onu görüntüleyen görüntülerden nasıl [ayıracağını](glossary://data%20separation) ve bu ayırmanın neden yararlı olduğunu öğreneceksin.
vi: Tại đây, bạn sẽ tìm hiểu về [trạng thái](glossary://state) và [luồng dữ liệu](glossary://data%20flow) trong SwiftUI. Luồng dữ liệu là sự chuyển động của các giá trị trong suốt ứng dụng của bạn và cách SwiftUI cập nhật UI của bạn để phản ánh bất kỳ thay đổi nào đối với những giá trị đó. Quan trọng là bạn sẽ học cách [tách dữ liệu ứng dụng](glossary://data%20separation) khỏi các chế độ xem hiển thị dữ liệu đó và tại sao việc tách này có ích.
zh_cn: 在这里，你将学习 SwiftUI 中的[状态](glossary://state)和[数据流](glossary://data%20flow)。数据流是 App 中值的移动，以及 SwiftUI 如何更新你的 UI 来反映这些值的更改。重要的是，你将学习如何从显示 App 数据的视图中[分离 App 数据](glossary://data%20separation)，以及为什么这样分离是有好处的。
zh_tw: 在這裡，你將學習 SwiftUI 中的[狀態](glossary://state)和[資料流](glossary://data%20flow)。資料流是整個 App 中數值的移動，以及 SwiftUI 如何更新你的 UI 來反映對這些數值的任何更動。重要的是，你將學習如何從呈現它的顯示區中[分離你的 App 資料](glossary://data%20separation)，以及為什麼這樣分離是有用處的。

# GuideBook..IntroKeep Going with Apps..Paragraph2
source: By the end of this tutorial, you will create a fully functioning SwiftUI app that people can add, delete, and modify emoji creatures in. Get started and you’ll have an app created in no time.
de: Am Ende dieser Anleitung kannst du eine voll funktionsfähige SwiftUI-App erstellen, in der Benutzer:innen Emoji-Charaktere hinzufügen, löschen und ändern können. Lege jetzt los und erstelle im Handumdrehen deine eigene App.
es: Al final de este tutorial, crearás una app de SwiftUI totalmente funcional en la que las personas podrán añadir, eliminar y modificar criaturas emoji. Empieza y habrás creado una app en un visto y no visto.
es_419: Al final de este tutorial, serás capaz de crear una app de SwiftUI completamente funcional donde las personas podrán agregar, eliminar y modificar criaturas de emoji. ¡Empieza ahora y verás que pronto tendrás tu primera app!
fr: D’ici la fin de ce tutoriel, tu créeras une app SwiftUI qui fonctionnera parfaitement, dans laquelle des personnes pourront ajouter, supprimer et modifier des créatures Emoji. Lance-toi et tu auras créé une app très prochainement.
it: Al termine di questa attività, avrai imparato a creare un'app in SwiftUI perfettamente funzionante, in cui le persone saranno in grado di aggiungere, eliminare e modificare creature basate sulle emoji. Inizia subito per creare la tua app in men che non si dica!
nl: Aan het einde van deze zelfstudie ga je een volledig functionele SwiftUI-app maken waarin gebruikers emojiwezens kunnen toevoegen, verwijderen en wijzigen. Ga aan de slag en voordat je het weet heb je je eerste app gemaakt.
no: Ved slutten av denne opplæringen kommer du til å lage en fullt fungerende SwiftUI-app der personer kan legge til, slette og endre emojiskapninger. Kom i gang nå, så har du snart laget en app på null komma niks.
pt: No final deste tutorial, você criará um app de SwiftUI totalmente funcional onde as pessoas poderão adicionar, apagar e modificar criaturas de emoji. Comece para criar um app em um piscar de olhos.
sv: I slutet av det här övningsexemplet kommer du att skapa en fullt fungerande SwiftUI-app där personer kan lägga till, radera och ändra emojivarelser. Sätt igång så har du snart skapat en app på nolltid.
th: ในตอนท้ายของคู่มือสอนใช้งานนี้ คุณจะได้สร้างแอป SwiftUI ที่ทำงานได้อย่างสมบูรณ์ ซึ่งผู้คนสามารถเพิ่ม ลบ และแก้ไขสิ่งมีชีวิตอิโมจิได้ เริ่มต้นตอนนี้ แล้วคุณจะมีแอปที่สร้างขึ้นเองในเวลาไม่นาน
tr: Bu öğreticinin sonunda kişilerin içinde emoji yaratıkları ekleyebileceği, silebileceği ve değiştirebileceği tam işlevli bir SwiftUI uygulaması yaratacaksın. Kullanmaya başla, kısa sürede bir uygulama yaratmış olacaksın.
vi: Khi kết thúc phần hướng dẫn này, bạn sẽ có thể tạo ra một ứng dụng SwiftUI đầy đủ chức năng mà mọi người có thể thêm, xóa và sửa đổi các sinh vật biểu tượng. Hãy bắt đầu và bạn sẽ nhanh chóng tạo ra một ứng dụng.
zh_cn: 在这个教程的最后，你将创建一个功能完善的 SwiftUI App，用户可以在里面添加、删除和修改表情符号动物。开始编程，很快你就能创建出自己的 App。
zh_tw: 在本教學結束時，你將製作一個功能齊全的 SwiftUI App，使用者可以在其中加入、刪除和修改表情符號生物。現在就開始製作一個 App 吧。

# GuideBook..Guide0..StepModifying State..title
source: Modifying State
de: Status ändern
es: Modificar el estado
es_419: Modificar estados
fr: Modification de l’état
it: Modificare lo stato
nl: De status aanpassen
no: Endre status
pt: Modificando o Estado
sv: Ändra status
th: การแก้ไขสถานะ
tr: Durumu Değiştirme
vi: Sửa đổi trạng thái
zh_cn: 修改状态
zh_tw: 修改狀態

# GuideBook..Guide0..StepModifying State..LearningCenterContent..Paragraph4
source: In coding, the term [state](glossary://state) refers to the current value of a variable. A [state change](glossary://state%20change) is when the value of one or more variables change in your app.
de: Beim Programmieren bezeichnet der Begriff [Status](glossary://state) den aktuellen Wert einer Variable. Eine [Statusänderung](glossary://state%20change) tritt auf, wenn sich der Wert einer oder mehrerer Variablen in der App ändert.
es: En programación, el término [estado](glossary://state) se refiere al valor actual de una variable. Un [cambio de estado](glossary://state%20change) es cuando cambia el valor de una o más variables en tu app.
es_419: En programación, el término [estado](glossary://state) se refiere al valor actual de una variable. Un [cambio de estado](glossary://state%20change) se produce cuando hay un cambio en el valor de una o más variables en tu app.
fr: En codage, le terme [état](glossary://state) fait référence à la valeur actuelle d’une variable. Une [modification d’état](glossary://state%20change) se produit lorsque la valeur d’une ou plusieurs variables change dans ton app.
it: Nell'ambito della programmazione, il termine [stato](glossary://state) si riferisce al valore corrente di una variabile. Quando il valore di una o più variabili nella tua app cambia si verifica un [cambiamento di stato](glossary://state%20change).
nl: Bij programmeren verwijst de term [status](glossary://state) naar de huidige waarde van een variabele. Een [statuswijziging](glossary://state%20change) treedt op wanneer de waarde van een of meer variabelen in je app verandert.
no: Innen koding henviser termen [status](glossary://state) til den aktuelle verdien til en variabel. En [statusendring](glossary://state%20change) er når én eller flere variabler endres i appen.
pt: Em programação, o termo [estado](glossary://state) se refere ao valor atual de uma variável. Uma [alteração de estado](glossary://state%20change) ocorre quando o valor de uma ou mais variáveis no app é alterado.
sv: I programmering avser termen [status](glossary://state) det aktuella värdet för en variabel. En [statusändring](glossary://state%20change) är när en eller flera variabler ändras i appen.
th: ในการเขียนโค้ด คำว่า[สถานะ](glossary://state)หมายถึงค่าปัจจุบันของตัวแปร [การเปลี่ยนแปลงสถานะ](glossary://state%20change)คือการที่ค่าของตัวแปรอย่างน้อยหนึ่งตัวเปลี่ยนแปลงไปในแอปของคุณ
tr: Kodlamada, [durum](glossary://state) terimi bir değişkenin şu anki değerine referans verir. [Durum değişikliği](glossary://state%20change), uygulamanda bir veya daha fazla değişkenin değerinin değişmesidir.
vi: Trong mã hóa, thuật ngữ [trạng thái](glossary://state) đề cập đến giá trị hiện tại của một biến. Một sự [thay đổi trạng thái](glossary://state%20change) là khi giá trị của một hoặc nhiều biến thay đổi trong ứng dụng của bạn.
zh_cn: 在编程中，术语[状态](glossary://state)是指变量的当前值。App 中一个或多个变量的值发生更改时会产生[状态更改](glossary://state%20change)。
zh_tw: 在程式設計中，[狀態](glossary://state)這個詞彙意指變數目前的值。[狀態更動](glossary://state%20change)是指 App 中的一或多個變數的值發生變化。

# GuideBook..Guide0..StepModifying State..LearningCenterContent..Paragraph5
source: One big advantage of SwiftUI is that it can update your views’ appearances automatically whenever your app’s [state changes](glossary://state%20change).
de: Ein großer Vorteil von SwiftUI ist, dass SwiftUI das Erscheinungsbild deiner Ansichten automatisch aktualisieren kann, wenn [Statusänderungen](glossary://state%20change) bei der App auftreten.
es: Una gran ventaja de SwiftUI es que puede actualizar las apariencias de las vistas automáticamente cada vez que [cambia el estado](glossary://state%20change) de la app.
es_419: Una de las grandes ventanjas de SwiftUI es que puede actualizar el aspecto de tus visualizaciones automáticamente cada vez que hay un [cambio de estado](glossary://state%20change) en tu app.
fr: Un avantage considérable de SwiftUI est qu’il peut mettre à jour l’apparence de tes vues automatiquement dès que ton app présente des [modifications d’état](glossary://state%20change).
it: Un grande vantaggio di SwiftUI è che può aggiornare l'aspetto delle tue viste automaticamente in corrispondenza a ogni [cambiamento di stato](glossary://state%20change) della tua app.
nl: SwiftUI kan het uiterlijk van je weergaven automatisch bijwerken wanneer er een [statuswijziging](glossary://state%20change) in je app optreedt. Dit is een groot voordeel van SwiftUI.
no: En stor fordel med SwiftUI er at det kan oppdatere visningenes utseende automatisk når appens [status endres](glossary://state%20change).
pt: Uma das grandes vantagens da SwiftUI é que ela pode atualizar as aparências das suas visualizações automaticamente, sempre que o seu app [mudar de estado](glossary://state%20change).
sv: En stor fördel med SwiftUI är att den automatiskt kan uppdatera vyns utseende när appens [status ändras](glossary://state%20change) .
th: ข้อดีอย่างหนึ่งของ SwiftUI คือความสามารถในการอัปเดตรูปแบบมุมมองของคุณโดยอัตโนมัติทุกครั้งที่แอปของคุณ[เปลี่ยนแปลงสถานะ](glossary://state%20change)
tr: SwiftUI'ın büyük bir avantajı da uygulamanın [durumu değiştiğinde](glossary://state%20change) görüntülerinin görünüşlerini güncelleyebilmesidir.
vi: Một lợi thế lớn của SwiftUI là có thể tự động cập nhật giao diện của chế độ xem bất kỳ lúc nào ứng dụng của bạn [thay đổi trạng thái](glossary://state%20change).
zh_cn: SwiftUI 的一大优势是，它可以在 App 发生[状态更改](glossary://state%20change)时自动更新视图的外观。
zh_tw: SwiftUI 的一大優勢是它可以在 App 的[狀態更動](glossary://state%20change)時自動更新顯示區的外觀。
