Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: If you want to customize the appearance of your `NavigationLink`, you can use a different [initializer](glossary://initializer) that takes a custom [label](glossary://label).
de: Wenn du das Erscheinungsbild von `NavigationLink` ändern möchtest, kannst du eine andere [Initialisierung](glossary://initializer) nutzen, die ein eigenes [Etikett](glossary://label) verwendet.
es: Si quieres personalizar el aspecto de tu `NavigationLink`, puedes usar un [inicializador](glossary://initializer) diferente que tenga una [etiqueta](glossary://label) personalizada.
es_419: Si quieres personalizar el aspecto de tu enlace `NavigationLink`, puedes usar un [inicializador](glossary://initializer) diferente que tome una [etiqueta](glossary://label) personalizada.
fr: Si tu veux personnaliser l’apparence de ton `NavigationLink`, tu peux utiliser un autre [initialiseur](glossary://initializer) qui accepte une [étiquette](glossary://label) personnalisée.
it: Se vuoi personalizzare l'aspetto del tuo `NavigationLink`, puoi usare un [inizializzatore](glossary://initializer) diverso che supporta un'[etichetta](glossary://label) personalizzata.
nl: Als je het uiterlijk van je `NavigationLink` wilt aanpassen, kun je een andere [initializer](glossary://initializer) gebruiken die een aangepast [label](glossary://label) ontvangt.
no: Hvis du vil tilpasse utseendet på en `NavigationLink`, kan du bruke en annen [initialiserer](glossary://initializer) som tar en tilpasset [etikett](glossary://label).
pt: Se quiser personalizar a aparência do `NavigationLink`, você pode usar um [inicializador](glossary://initializer) diferente que aceite uma [etiqueta](glossary://label) personalizada.
sv: Om du vill anpassa utseendet på en `NavigationLink` kan du använda en annan [initierare](glossary://initializer) som tar en anpassad [etikett](glossary://label).
th: ถ้าคุณต้องการกำหนดรูปแบบของ `NavigationLink` คุณสามารถใช้[ตัวเริ่มต้น](glossary://initializer)อื่นที่ใช้[ป้าย](glossary://label)แบบกำหนดเองได้
tr: `NavigationLink`’inin görünüşünü özelleştirmek istiyorsan özel bir [etiket](glossary://label) alan farklı bir [ilk değer atayıcı](glossary://initializer) kullanabilirsin.
vi: Nếu muốn tùy chỉnh giao diện của `NavigationLink` thì bạn có thể sử dụng một [trình khởi tạo](glossary://initializer) khác sử dụng một [nhãn](glossary://label) tùy chỉnh.
zh_cn: 如果要自定 `NavigationLink` 的外观，你可以使用另一个[构造器](glossary://initializer)，来接收自定[标签](glossary://label)。
zh_tw: 如果要自訂 `NavigationLink` 的外觀，你可以使用不同的[初始化程式](glossary://initializer)，它會採用自訂[標籤](glossary://label)。

source: The code below creates a `NavigationLink` with a custom [label](glossary://label), composed of an `HStack` with a `Text` and `Image` view. As with the destination content, the label can be any view you want!
de: Der Code unten erstellt einen `NavigationLink` mit einem eigenen [Etikett](glossary://label). Er besteht aus einem `HStack` mit einer `Text`- und einer `Image`-Ansicht. Wie beim Zielinhalt kannst du für das Etikett die gewünschte Ansicht auswählen!
es: El código siguiente crea un enlace de navegación (`NavigationLink`) con una [etiqueta](glossary://label) personalizada, y se compone de una pila `HStack` con una vista de `Text` (texto) y de `Image` (imagen). Al igual que con el contenido de destino, la etiqueta puede ser cualquier vista que quieras.
es_419: El siguiente código crea un enlace `NavigationLink` con una [etiqueta](glossary://label) personalizada, compuesta por una `HStack` con una visualización `Text` e `Image`. Al igual que con el contenido de destino, la etiqueta puede ser cualquier visualización que quieras.
fr: Le code ci-dessous crée un `NavigationLink` avec une [étiquette](glossary://label) personnalisée, composé d’une `HStack` avec une vue `Text` et `Image`. Comme avec le contenu de destination, l’étiquette peut être la vue que tu souhaites !
it: Il codice mostrato sotto crea un `NavigationLink` con un'[etichetta](glossary://label) personalizzata, composta da un `HStack` con una vista `Text` e `Image`. Come avviene per il contenuto di destinazione, l'etichetta può corrispondere alla vista che preferisci.
nl: Met de onderstaande code maak je een `NavigationLink` aan met een aangepast [label](glossary://label) dat bestaat uit een `HStack` met een `Text`- en een `Image`-weergave. Net als bij de doelinhoud kun je voor het label elke gewenste weergave gebruiken!
no: Koden nedenfor oppretter en `NavigationLink` med en tilpasset [etikett](glossary://label) som består av en `HStack` med en `Text`- og `Image`-visning. I likhet med målinnholdet kan etiketten være hvilken som helst visning.
pt: O código abaixo cria um `NavigationLink` com uma [etiqueta](glossary://label) personalizada, composta de um `HStack` com uma visualização `Text` e `Image`. Assim como o conteúdo de destino, a etiqueta pode ser qualquer visualização que você queira!
sv: Koden nedanför skapar en `NavigationLink` med en anpassad [etikett](glossary://label) som består av en `HStack` med en `Text`- och `Image`-vy. I likhet med målinnehållet kan etiketten vara vilken vy som helst!
th: โค้ดด้านล่างจะสร้าง `NavigationLink` ที่มี[ป้าย](glossary://label)แบบกำหนดเอง ซึ่งประกอบด้วย `HStack` พร้อมกับมุมมอง `Text` และ `Image` และเช่นเดียวกับเนื้อหาปลายทาง ป้ายสามารถเป็นมุมมองใดก็ได้ที่คุณต้องการ!
tr: Aşağıdaki kod, `Text` ve `Image` görüntüsüne sahip bir `HStack`’ten oluşan özel bir [etiketle](glossary://label) bir `NavigationLink` yaratır. Hedef içerikte olduğu gibi etiket de istediğin görüntü olabilir!
vi: Mã bên dưới tạo ra một `NavigationLink` với một [nhãn](glossary://label) tùy chỉnh, bao gồm một chế độ xem `HStack` với `Text` và `Image`. Cũng giống như nội dung đích, nhãn có thể là bất kỳ chế độ xem nào mà bạn muốn!
zh_cn: 以下代码创建了一个 `NavigationLink` 和一个自定[标签](glossary://label)，由带有 `Text` 和 `Image` 视图的 `HStack`（水平堆栈）组成。就像目的内容一样，标签可以是你想要的任何视图！
zh_tw: 下面的程式碼會製作帶有自訂[標籤](glossary://label)的 `NavigationLink`，由一個帶有 `Text` 和 `Image` 顯示區的 `HStack` 組成。與目標內容一樣，標籤可以是你想要的任何顯示區！

source: NavigationLink { SlidingRectangle() .navigationTitle("Sliding Rectangle") } label: { HStack { Text("Tap To Navigate") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
de: NavigationLink { SlidingRectangle() .navigationTitle("Gleitendes Rechteck") } label: { HStack { Text("Zum Navigieren tippen") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
es: NavigationLink { SlidingRectangle() .navigationTitle("Sliding Rectangle") } label: { HStack { Text("Toca para navegar") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
es_419: NavigationLink { SlidingRectangle() .navigationTitle("Rectángulo deslizable") } label: { HStack { Text("Toca para navegar") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
fr: NavigationLink { SlidingRectangle() .navigationTitle("Rectangle glissant") } label: { HStack { Text("Touchez pour naviguer") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
it: NavigationLink { SlidingRectangle() .navigationTitle("Rettangolo che scorre") } label: { HStack { Text("Tocca per navigare") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
nl: NavigationLink { SlidingRectangle() .navigationTitle("Schuivende rechthoek") } label: { HStack { Text("Tik om te navigeren") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
no: NavigationLink { SlidingRectangle() .navigationTitle("Sliding Rectangle") } label: { HStack { Text("Trykk for å navigere") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
pt: ```NavigationLink { SlidingRectangle() .navigationTitle("Sliding Rectangle") } label: { HStack { Text("Toque para Navegar") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } } ```
sv: NavigationLink { SlidingRectangle() .navigationTitle("Sliding Rectangle") } label: { HStack { Text("Tryck för att navigera") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
th: NavigationLink { SlidingRectangle() .navigationTitle("สี่เหลี่ยมเลื่อนได้") } label: { HStack { Text("แตะเพื่อนำทาง") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
tr: NavigationLink { SlidingRectangle() .navigationTitle("Kayan Dikdörtgen") } label: { HStack { Text("Gitmek İçin Dokun") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
vi: NavigationLink { SlidingRectangle() .navigationTitle("Hình chữ nhật trượt") } label: { HStack { Text("Chạm để điều hướng") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
zh_cn: NavigationLink { SlidingRectangle() .navigationTitle("滑动矩形") } label: { HStack { Text("轻点以导航") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } }
zh_tw: NavigationLink { SlidingRectangle() .navigationTitle("Sliding Rectangle") } label: { HStack { Text("點一下來導覽") Spacer() Image(systemName: "arrow.forward.circle") .font(.largeTitle) } } ```

source: Try adding a new `NavigationLink`, giving it a destination, label, and navigation title. Try navigating to one of the other views in the app, such as the `ConditionalCircle` view.
de: Versuche, einen neuen `NavigationLink` hinzuzufügen, gib ihm ein Ziel, Etikett und einen Navigationstitel. Versuche dann, zu einer der anderen Ansichten in der App zu navigieren, z. B. zur Ansicht `ConditionalCircle` (bedingter Kreis).
es: Prueba a añadir un nuevo enlace de navegación (`NavigationLink`), dándole un destino, una etiqueta y un título de navegación. Prueba a navegar a una de las otras vistas de la app, como la vista `ConditionalCircle`.
es_419: Intenta agregar un enlace `"NavigationLink"` nuevo y asígnale un destino, una etiqueta y un título. Intenta navegar a una de las otras visualizaciones de tu app, por ejemplo a `"ConditionalCircle"`.
fr: Essaie d’ajouter un nouveau `NavigationLink`, en lui attribuant une destination, une étiquette et un titre de navigation. Essaie de naviguer vers l’une des autres vues de ton app, comme la vue `ConditionalCircle`.
it: Prova ad aggiungere un nuovo `NavigationLink`, assegnagli una destinazione, un'etichetta e un titolo di navigazione. Prova ad andare su una delle altre viste dell'app, ad esempio, sulla vista `ConditionalCircle`.
nl: Voeg een nieuwe `NavigationLink` toe en ken er een doel, label en navigatietitel aan toe. Probeer naar een van de andere weergaven in de app te navigeren, zoals de weergave `ConditionalCircle`.
no: Prøv å legge til en `NavigationLink` med et mål, en etikett og en navigeringstittel. Prøv å navigere til en av de andre visningene i appen, for eksempel visningen `ConditionalCircle`.
pt: Experimente adicionar um novo `NavigationLink`, atribuindo‑lhe um destino, etiqueta e título de navegação. Tente navegar para uma das outras visualizações do app, como a visualização `ConditionalCircle`, por exemplo.
sv: Prova att lägga till en ny `NavigationLink` med ett mål, en etikett och en navigeringstitel. Prova att navigera till en av de andra vyerna i appen, exempelvis vyn `ConditionalCircle`.
th: ลองเพิ่ม `NavigationLink` ใหม่โดยใส่ปลายทาง ป้าย และชื่อการนำทาง ลองนำทางไปยังหนึ่งในมุมมองอื่นๆ ในแอป เช่น มุมมอง `ConditionalCircle`
tr: Yeni bir `NavigationLink` eklemeyi, ona bir hedef, etiket ve dolaşma başlığı vermeyi dene. `ConditionalCircle` görüntüsü gibi uygulamadaki diğer görüntülerden birine gitmeyi dene.
vi: Thử thêm một `NavigationLink` mới, cung cấp một đích, nhãn và tiêu đề điều hướng. Hãy thử điều hướng đến một trong các chế độ xem khác trong ứng dụng, ví dụ như chế độ xem `ConditionalCircle`.
zh_cn: 尝试添加一个新的 `NavigationLink`，给它提供一个目的位置、标签和导航标题。试着导航到 App 中的其他视图，如 `ConditionalCircle` 视图。
zh_tw: 嘗試加入一個新的 `NavigationLink`，指定一個目標、標籤和導覽標題。試著導覽至 App 中的其他顯示區之一，如 `ConditionalCircle` 顯示區。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..title
source: Understand how your app displays views
de: Wie die App Ansichten anzeigt
es: Entender cómo tu app muestra las vistas
es_419: Cómo se muestran visualizaciones en una app
fr: Comprendre comment une app affiche des vues
it: Capire il modo in cui la tua app mostra le viste
nl: Hoe je app weergaven toont
no: Forstå hvordan appen viser visninger
pt: Entenda como o app mostra as visualizações
sv: Förstå hur appen visar vyer
th: ทำความเข้าใจวิธีที่แอปของคุณแสดงมุมมอง
tr: Uygulamanın görüntüleri nasıl gösterdiğini anlama
vi: Tìm hiểu cách ứng dụng của bạn hiển thị các chế độ xem
zh_cn: 了解 App 如何显示视图
zh_tw: 瞭解你的 App 如何呈現顯示區

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..Page75..Paragraph145
source: Now that you’ve experimented with adding [navigation links](glossary://navigation%20link) inside of a `NavigationStack` and `NavigationSplitView`, your goal is to make the first view your app displays a `NavigationStack`. After adding navigation links, this allows people to navigate to different views when they use your app.
de: Du hast nun schon mit dem Hinzufügen von [Navigations-Links](glossary://navigation%20link) zu `NavigationStack` und `NavigationSplitView` experimentiert. Dein nächstes Ziel ist es, `NavigationStack` zur ersten Ansicht zu machen, die deine App anzeigt. Nachdem du Navigations-Links hinzugefügt hast, können Benutzer:innen beim Verwenden der App zu den verschiedenen Ansichten navigieren.
es: Ahora que has probado a añadir [enlaces de navegación](glossary://navigation%20link) dentro de una pila de navegación (`NavigationStack`) y de una vista dividida de navegación (`NavigationSplitView`), tu objetivo es hacer que la primera vista que muestre tu app sea una pila de navegación (`NavigationStack`). Después de añadir enlaces de navegación, esto permitirá a las personas navegar a diferentes vistas al usar tu app.
es_419: Ahora que has experimentado con agregar [enlaces de navegación](glossary://navigation%20link) dentro de `NavigationStack` y `NavigationSplitView`, tu objetivo es hacer que la primera visualización que tu app muestre sea una pila `NavigationStack`. Si se agregan enlaces de navegación, esto permite que las personas naveguen a otras visualizaciones cuando usen tu app.
fr: Maintenant que tu as expérimenté l’ajout de [liens de navigation](glossary://navigation%20link) à l’intérieur d’une `NavigationStack` et d’une `NavigationSplitView`, ton objectif est que la première vue de ton app affiche une `NavigationStack`. Après avoir ajouté des liens de navigation, cela permet à des personnes de naviguer vers différentes vues lorsqu’elles utilisent ton app.
it: Ora che hai provato ad aggiungere [link di navigazione](glossary://navigation%20link) all'interno di una `NavigationStack` e `NavigationSplitView`, il tuo obiettivo è di trasformare la prima vista mostrata dalla tua app in una `NavigationStack`. Una volta che avrai aggiunto i link di navigazione, le persone avranno la possibilità di andare da una vista all'altra quando usano la tua app.
nl: Nu je hebt geëxperimenteerd met het toevoegen van [navigatielinks](glossary://navigation%20link) in een `NavigationStack` en `NavigationSplitView`, ga je ervoor zorgen dat je app als eerste weergave een `NavigationStack` toont. Nadat je navigatielinks hebt toegevoegd, kunnen gebruikers via deze weergave naar andere weergaven navigeren wanneer ze je app gebruiken.
no: Nå når du har eksperimentert med å legge til [navigeringslenker](glossary://navigation%20link) inni en `NavigationStack` og `NavigationSplitView`, er målet ditt at den første visningen som appen viser, skal være en `NavigationStack`. Når du har lagt til navigeringslenker, kan personer navigere til forskjellige visninger når de bruker appen.
pt: Agora que você experimentou com a adição de [links de navegação](glossary://navigation%20link) dentro de um `NavigationStack` e `NavigationSplitView`, o objetivo é fazer com que a primeira visualização do app mostre um `NavigationStack`. Depois de adicionar links de navegação, isso permitirá que as pessoas naveguem para visualizações diferentes quando usarem o seu app.
sv: Nu när du har experimenterat med att lägga till [navigeringslänkar](glossary://navigation%20link) inuti en `NavigationStack` och `NavigationSplitView` är målet att den första vyn som appen visar ska vara en `NavigationStack`. När du har lagt till navigeringslänkar kan personer navigera till olika vyer när de använder appen.
th: ตอนนี้เมื่อคุณได้ทดลองเพิ่ม[ลิงก์การนำทาง](glossary://navigation%20link)ภายใน `NavigationStack` และ `NavigationSplitView` แล้ว เป้าหมายของคุณคือการทำให้มุมมองแรกที่แอปของคุณแสดงเป็น `NavigationStack` หลังจากเพิ่มลิงก์การนำทางแล้ว การทำเช่นนี้จะทำให้ผู้คนสามารถนำทางไปยังมุมมองต่างๆ เมื่อใช้แอปของคุณได้
tr: Bir `NavigationStack`’in ve `NavigationSplitView`’un içine [dolaşma bağlantıları](glossary://navigation%20link) eklemeyi deneyimlediğine göre hedefin uygulamanın görüntülediği ilk görüntünün bir `NavigationStack` olmasıdır. Dolaşma bağlantılarını ekledikten sonra bu, kişilerin uygulamanı kullanırken farklı görüntülere gitmesine olanak tanır.
vi: Bây giờ bạn đã thử nghiệm việc thêm các [liên kết điều hướng](glossary://navigation%20link) bên trong một `NavigationStack` và `NavigationSplitView`, mục tiêu của bạn là làm cho chế độ xem đầu tiên mà ứng dụng của bạn hiển thị là một `NavigationStack`. Sau khi thêm các liên kết điều hướng, việc này cho phép mọi người điều hướng đến các chế độ xem khác nhau khi họ sử dụng ứng dụng của bạn.
zh_cn: 既然已经尝试了在 `NavigationStack` 和 `NavigationSplitView` 内添加[导航链接](glossary://navigation%20link)，别忘了你的目标是将 App 显示的第一个视图设为 `NavigationStack`。添加导航链接后，用户可在使用你的 App 时导航到其他视图。
zh_tw: 現在你已經體驗了在 `NavigationStack` 和 `NavigationSplitView` 內加入[導覽連結](glossary://navigation%20link)，你的目標是讓 App 的第一個顯示區顯示 `NavigationStack`。加入導覽連結後，就能讓使用者在執行你的 App 時導覽到不同的顯示區。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..Page76..Paragraph146
source: You tell your app which view to display first in your app definition. Here, you can see that your app is named `MyApp` by default, and it follows the guidelines of the `App` [protocol](glossary://protocol), which allows it to run on your device just like any other app.
de: In der App-Definition weist du die App an, welche Ansicht sie als erstes anzeigen soll. Dort kannst du sehen, dass die App standardmäßig den Namen `MyApp` trägt und den Richtlinien des `App`-[Protokolls](glossary://protocol) folgt, damit sie auf deinem Gerät wie jede andere App ausgeführt werden kann.
es: En la definición de tu app le indicas qué vista debe mostrar primero. Aquí puedes ver que tu app se llama `MyApp` (Mi aplicación) por omisión y que sigue el conjunto de pautas del [protocolo](glossary://protocol) `App`, que permite que se ejecute en tu dispositivo como cualquier otra app.
es_419: En la definición de tu app debes indicar qué visualización debe mostrarse primero. Aquí puedes ver que tu app se llama `"MyApp"` de forma predeterminada, y que cumple con el [protocolo](glossary://protocol) `"App"`, el cual permite ejecutar tu app en tu dispositivo como cualquier otra app.
fr: Tu indiques à ton app quelle vue afficher en premier dans la définition de ton app. Tu peux voir que ton app s’appelle `MyApp` par défaut et qu’elle suit les consignes du [protocole](glossary://protocol) `App`, ce qui lui permet de s’exécuter sur ton appareil comme n’importe quelle autre app.
it: Nella definizione dell'app, indica all'app quale vista deve essere mostrata per prima. Qui puoi vedere che, di default, l'app si chiama `MyApp` e segue le linee guida del [protocollo](glossary://protocol) `App`, grazie al quale può essere eseguita sul tuo dispositivo, proprio come qualsiasi altra app.
nl: In de appdefinitie geef je op welke weergave als eerste in je app wordt getoond. Hier kun je zien dat je app standaard de naam `MyApp` heeft en de richtlijnen van het `App`-[protocol](glossary://protocol) volgt, waardoor je app net als andere apps op je apparaat kan worden uitgevoerd.
no: Du forteller appen hvilken visning som skal vises først i appdefinisjonen. Her kan du se at appen som standard heter `MyApp`. Den følger retningslinjene i [protokollen](glossary://protocol) `App`, noe som tillater at den kjøres på enheten din akkurat som andre apper.
pt: Você diz ao app quais visualizações ele deve mostrar primeiro na definição do seu app. Aqui, você pode ver que o app se chama `MyApp` por padrão, e ele segue as orientações do [protocolo](glossary://protocol) `App`, o que permite que ele seja executado no seu dispositivo como qualquer outro app.
sv: Du talar om för appen vilken vy som ska visas först i appdefinitionen. Här kan du se att appen som förval heter `MyApp`. Den följer riktlinjerna i [protokollet](glossary://protocol) `App`, vilket tillåter att den körs på din enhet precis som alla andra appar.
th: คุณบอกแอปของคุณว่าจะแสดงมุมมองใดเป็นมุมมองแรกในคำจำกัดความแอปของคุณ ในส่วนนี้ คุณจะเห็นว่าแอปของคุณถูกตั้งชื่อเป็น `MyApp` ตามค่าเริ่มต้น และแอปจะเป็นไปตามแนวทางของ[โปรโตคอล](glossary://protocol) `App` ซึ่งทำให้แอปสามารถทำงานบนอุปกรณ์ของคุณได้เหมือนกับแอปอื่นๆ
tr: Uygulamana uygulama tanımında ilk olarak hangi görüntünün gösterileceğini söylersin. Burada, uygulamanın saptanmış olarak `MyApp` şeklinde adlandırıldığını ve tıpkı diğer uygulamalar gibi aygıtında çalışmasına izin veren `App` [protokolünün](glossary://protocol) kılavuzlarını izlediğini görebilirsin.
vi: Bạn cho ứng dụng biết chế độ xem nào sẽ hiển thị đầu tiên trong định nghĩa ứng dụng. Tại đây, bạn có thể nhìn thấy rằng ứng dụng của mình được đặt tên là `MyApp` theo mặc định và tuân theo các hướng dẫn của [giao thức](glossary://protocol) `App`, cho phép ứng dụng đó chạy trên thiết bị của bạn giống như bất kỳ ứng dụng nào khác.
zh_cn: 你在 App 定义中告诉 App 首先要显示的视图。在这里你可以看到，App 默认叫做 `MyApp`（我的 App），它遵循 `App` [协议](glossary://protocol)的规则，使它可以像其他任何 App 一样在你的设备上运行。
zh_tw: 你告訴 App 首先要顯示 App 定義中的哪一個顯示區。在這裡，你可以看到你的 App 預設命名為 `MyApp`，它依循 `App` [協議](glossary://protocol) 的準則，讓它像任何其他 App 一樣在你的裝置上執行。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..Page76..Paragraph147
source: Try running the current project as an app by pressing the run button (▶︎). You shouldn’t see much yet. 🙈
de: Versuche, das aktuelle Projekt als App auszuführen, indem du die Taste zum Ausführen (▶︎) drückst. Es gibt allerdings noch nicht viel zu sehen. 🙈
es: Prueba a ejecutar el proyecto actual como una app pulsando el botón de ejecución (▶︎). Aún no se debería ver gran cosa. 🙈
es_419: Presiona el botón de ejcución (▶︎) para intentar ejecutar el proyecto actual como una app. Aún no deberían ocurrir muchas cosas. 🙈
fr: Essaie d’exécuter le projet actuel comme une app en appuyant sur le bouton d’exécution (▶︎). Tu ne devrais pas voir grand-chose pour le moment. 🙈
it: Prova a eseguire il progetto attuale come un'app premendo il pulsante di esecuzione (▶︎). In questa fase, non dovresti vedere molto. 🙈
nl: Probeer het huidige project als een app uit te voeren door op de uitvoerknop (▶︎) te tikken. Vermoedelijk is er nog niet veel te zien. 🙈
no: Prøv å kjøre det aktuelle prosjektet som en app ved å trykke på kjør-knappen (▶︎). Det skal ikke være mye å se ennå. 🙈
pt: Experimente executar o projeto atual como um app. Para fazer isso, pressione o botão executar (▶︎). Por enquanto, não há muito a ser visto. 🙈
sv: Prova att köra det aktuella projektet som en app genom att trycka på körknappen (▶︎). Du lär inte se så mycket än. 🙈
th: ลองรันโปรเจ็กต์ปัจจุบันเป็นแอปโดยกดปุ่มรัน (▶︎) คุณจะยังไม่เห็นอะไรมากนัก 🙈
tr: Çalıştır düğmesine (▶︎) basarak şu anki projeyi bir uygulama olarak çalıştırmayı dene. Bu kadarını henüz görmemelisin. 🙈
vi: Thử chạy dự án hiện tại dưới dạng một ứng dụng bằng cách nhấn nút chạy (▶︎). Bạn sẽ không nhìn thấy nhiều thứ. 🙈
zh_cn: 试着按下运行按钮 (▶︎)，让当前项目作为 App 运行。里面可能还没什么内容。🙈
zh_tw: 按下執行按鈕（▶︎）來嘗試將目前的計畫案作為 App 來執行。你應該還看不到太多東西。🙈
