Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Three [state properties](glossary://state%20property) have been defined for you:
de: Drei [Statuseigenschaften](glossary://state%20property) wurden für dich definiert:
es: Hay tres [propiedades de estado](glossary://state%20property) que venían definidas:
es_419: Ya definimos tres [propiedades de estado](glossary://state%20property) por ti:
fr: Trois [propriétés d’état](glossary://state%20property) ont été définies pour toi :
it: Sono state definite tre [proprietà di stato](glossary://state%20property):
nl: Er zijn drie [statuseigenschappen](glossary://state%20property) voor je gedefinieerd:
no: Tre [statusegenskaper](glossary://state%20property) har blitt definert for deg:
pt: Três [propriedades de estado](glossary://state%20property) foram definidas para você:
sv: Tre [statusegenskaper](glossary://state%20property) har definierats för dig:
th: [คุณสมบัติสถานะ](glossary://state%20property)สามรายการได้ถูกกำหนดไว้ให้คุณแล้ว ดังนี้:
tr: Senin için üç [durum özelliği](glossary://state%20property) tanımlanmıştır:
vi: Ba [thuộc tính trạng thái](glossary://state%20property) đã được định nghĩa cho bạn:
zh_cn: 已为你定义了三个[状态属性](glossary://state%20property)：
zh_tw: 已經為你定義了三個[狀態屬性](glossary://state%20property)：

source: `color` tracks a `Color` value, and controls color modifications to your `Text` view.
de: `color` verfolgt einen `Color`-Wert und steuert Farbänderungen an der `Text`-Ansicht.
es: `color` controla un valor `Color` y controla las modificaciones de color de tu vista `Text` (texto).
es_419: `color` hace un seguimiento del valor de `Color` y controla las modificaciones de color en tu visualización `Text`.
fr: `color` suit une valeur `Color` et contrôle les modifications de la couleur apportées à ta vue `Text`.
it: `color` monitora un valore `Color` e controlla le modifiche del colore alla tua vista `Text`.
nl: `color` houdt een `Color`-waarde bij en regelt de kleurwijzigingen van je `Text`- weergave.
no: `color` sporer en `Color`-verdi og styrer fargeendringene i `Text`-visningen.
pt: `color` rastreia um valor de `Color` e controla as modificações de cor da visualização `Text`.
sv: `color` spårar ett `Color`-värde och styr färgändringarna i `Text`-vyn.
th: `color` จะติดตามค่า `Color` และควบคุมการแก้ไขสีที่ทำกับมุมมอง `Text`
tr: `color` bir `Color` değerini izler ve `Text` görüntündeki renk değişikliklerini denetler.
vi: `color` theo dõi một giá trị `Color` và điều khiển việc sửa đổi màu đối với chế độ xem `Text` của bạn.
zh_cn: `color` 跟踪 `Color` 值，并控制针对 `Text` 视图的颜色修改。
zh_tw: `color` 會使用 `Color` 值，並且會控制 `Text` 顯示區的顏色修改。

source: `shadowRadius` is a `Double` value that you use to control the radius of a `.shadow` modifier.
de: `shadowRadius` ist ein `Double`-Wert, mit dem du den Radius des Schattenmodifikators `.shadow` steuern kannst.
es: `shadowRadius` es un valor `Double` (doble) que usas para controlar el radio de un modificador `.shadow` (sombreado).
es_419: `shadowRadius` es un valor `Double` que se usa para controlar el radio de un modificador `.shadow`.
fr: `shadowRadius` est une valeur `Double` qui te sert à contrôler le rayon d’un modificateur `.shadow`.
it: `shadowRadius` è un valore `Double` che serve a controllare il raggio di un modificatore `.shadow`.
nl: `shadowRadius` is een `Double`-waarde die je gebruikt om de radius van een `.shadow`-modifier te regelen.
no: `shadowRadius` er en `Double`-verdi som du bruker til å styre radiusen i en `.shadow`-modifikator.
pt: `shadowRadius` é um valor `Double` que você usa para controlar o raio de um modificador `.shadow`.
sv: `shadowRadius` är ett `Double`-värde som du använder till att styra radien i en `.shadow`-modifierare.
th: `shadowRadius` เป็นค่า `Double` ที่คุณใช้เพื่อควบคุมรัศมีของปุ่มปรับค่า `.shadow`
tr: `shadowRadius`, `.shadow` niteleyicisinin yarıçapını denetlemek için kullandığın bir `Double` değeridir.
vi: `shadowRadius` là một giá trị `Double` mà bạn sử dụng để điều khiển bán kính của trình sửa đổi `.shadow`.
zh_cn: `shadowRadius`（阴影半径）是一个 `Double` 值，你用它来控制 `.shadow`（阴影）修饰符的半径。
zh_tw: `shadowRadius` 是一個 `Double` 值，你可以用它來控制 `.shadow` 修飾符的半徑。

source: `angle` is an `Angle` value that you use to rotate your `Text` view.
de: `angle` (Winkel) ist ein `Angle`-Wert, mit dem du die `Text`-Ansicht drehen kannst.
es: `angle` es un valor de ángulo (`Angle`) que usas para girar la vista `Text` (texto).
es_419: `angle` es un valor `Angle` que se puede usar para girar tu visualización `Text`.
fr: `angle` est une valeur `Angle` qui te sert à faire pivoter ta vue `Text`.
it: `angle` è un valore `Angle` che serve a ruotare la vista `Text`.
nl: `angle` is een `Angle`-waarde die je gebruikt om je `Text`-weergave te roteren.
no: `angle` er en `Angle`-verdi som du bruker til å rotere `Text`-visningen.
pt: `angle` é um valor de `Angle` que você usa para girar a visualização `Text`.
sv: `angle` är ett `Angle`-värde som du använder till att rotera `Text`-vyn.
th: `angle` เป็นค่า `Angle` ที่คุณใช้เพื่อหมุนมุมมอง `Text` ของคุณ
tr: `angle`, `Text` görüntünü döndürmek için kullandığın bir `Angle` değeridir.
vi: `angle` là một giá trị `Angle` mà bạn sử dụng để xoay chế độ xem `Text`.
zh_cn: `angle`（角度）是一个 `Angle` 值，你用它来旋转 `Text` 视图。
zh_tw: `angle` 是一個 `Angle` 值，你可以用它來旋轉 `Text` 顯示區。

source: Your `Text` view uses `creature.emoji` as the String value for the view, and adds several modifiers that determine the view’s appearance and behavior:
de: Die `Text`-Ansicht verwendet `creature.emoji` als String-Wert für die Ansicht und fügt mehrere Modifikatoren hinzu, mit denen das Erscheinungsbild und Verhalten der Ansicht festgelegt wird:
es: La vista `Text` usa `creature.emoji` como el valor de cadena de la vista y añade varios modificadores que determinan la apariencia y el comportamiento de la vista:
es_419: Tu visualización `Text` usa `creature.emoji` como el valor de `String` para la visualización, y agrega varios modificadores que determinan el aspecto y comportamiento de la visualización:
fr: Ta vue `Text` utilise `creature.emoji` comme la valeur String de la vue, et ajoute plusieurs modificateurs qui déterminent l’apparence et le comportement de la vue :
it: La tua vista `Text` utilizza `creature.emoji` come valore stringa della vista e aggiunge vari modificatori che ne determinano l'aspetto e il comportamento:
nl: Je `Text`-weergave gebruikt `creature.emoji` als de String-waarde voor de weergave en voegt meerdere modifiers toe waarmee het uiterlijk en de werking van de weergave worden bepaald:
no: `Text`-visningen bruker `creature.emoji` som String-verdi for visningen og legger til flere modifikatorer som avgjør visningens utseende og oppførsel:
pt: A visualização `Text` usa `creature.emoji` como valor de String para a visualização e adiciona vários modificadores que determinam a aparência e o comportamento da visualização:
sv: `Text`-vyn använder `creature.emoji` som String-värde för vyn och lägger till flera modifierare som avgör vyns utseende och beteende:
th: มุมมอง `Text` ของคุณจะใช้ `creature.emoji` เป็นค่าสตริงสำหรับมุมมอง และเพิ่มปุ่มปรับค่าหลายรายการที่กำหนดรูปแบบและลักษณะการทำงานของมุมมอง:
tr: `Text` görüntün `creature.emoji`’yi görüntünün Dizgi değeri olarak kullanır ve görüntünün görünüşünü ve davranışını belirleyen pek çok niteleyici ekler:
vi: Chế độ xem `Text` của bạn sử dụng `creature.emoji` dưới dạng giá trị Chuỗi cho chế độ xem và thêm một số trình sửa đổi xác định giao diện và hoạt động của chế độ xem:
zh_cn: 你的 `Text` 视图将 `creature.emoji`（动物表情符号）用作视图的 String 值，并添加了几个决定视图外观和行为的修饰符：
zh_tw: 你的 `Text` 顯示區使用 `creature.emoji` 作為顯示區的 String 值，並且加入了幾個決定顯示區外觀和動作的修飾符：

source: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) adds a color multiplication effect to the view.
de: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) fügt einen Farbmultiplikatoreffekt zur Ansicht hinzu.
es: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) añade un efecto de multiplicación de colores a la vista.
es_419: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) agrega un efecto de multiplicación de color a la visualización.
fr: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) ajoute un effet de multiplication de couleur à la vue.
it: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) aggiunge un effetto di moltiplicazione del colore alla vista.
nl: Met [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) voeg je een kleurvermenigvuldigingseffect aan de weergave toe.
no: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) legger til en fargemultipliseringseffekt i visningen.
pt: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) adiciona um efeito de multiplicação de cor à visualização.
sv: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) lägger till en färgmultipliceringseffekt i vyn.
th: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) จะเพิ่มเอฟเฟ็กต์การทวีคูณของสีไปยังมุมมอง
tr: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) görüntüye bir renk çoğaltma efekti ekler.
vi: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) thêm một hiệu ứng khuếch đại màu cho chế độ xem.
zh_cn: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:))（颜色相乘）给视图添加颜色乘法效果。
zh_tw: [.colorMultiply](doc://com.apple.documentation/documentation/swiftui/list/colormultiply(_:)) 會為顯示區加入顏色加乘的效果。

source: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) adds a shadow of a particular color and radius.
de: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) fügt einen Schatten mit einer bestimmten Farbe und einem bestimmten Radius hinzu.
es: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) añade un sombreado de un determinado color a un radio.
es_419: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) agrega una sombra de un color y radio específicos.
fr: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) ajoute une ombre d’une couleur et d’un rayon en particulier.
it: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) aggiunge un'ombra con un raggio e un colore determinati.
nl: Met [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) voeg je een schaduw voor een bepaalde kleur en radius toe.
no: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) legger til en skygge med en bestemt farge og radius.
pt: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) adiciona uma sobra com cor e raio especificados.
sv: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) lägger till en skugga med en viss färg och radie.
th: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) จะเพิ่มเงาที่มีสีและรัศมีที่เจาะจง
tr: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) belirli bir rengin ve yarıçapın gölgesini ekler.
vi: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) thêm một bóng đổ có màu và bán kính cụ thể.
zh_cn: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) 添加特定颜色和半径的阴影。
zh_tw: [.shadow](doc://com.apple.documentation/documentation/swiftui/list/shadow(color:radius:x:y:)) 會加入特定顏色和半徑的陰影。

source: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) can control the rotation of the view in three dimensions.
de: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) kann die Rotation der Ansicht in drei Dimensionen steuern.
es: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) puede controlar la rotación de la vista en tres dimensiones.
es_419: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) puede controlar la rotación de la visualización en tres dimensiones.
fr: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) peut contrôler la rotation de la vue en trois dimensions.
it: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) è in grado di controllare la rotazione della vista in tre dimensioni.
nl: Met [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) kun je de rotatie van de weergave in drie dimensies regelen.
no: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) kan styre rotasjonen av visningen i tre dimensjoner.
pt: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) pode controlar a rotação da visualização em três dimensões.
sv: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) kan styra rotationen av vyn i tre dimensioner.
th: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) สามารถควบคุมการหมุนของมุมมองได้สามมิติ
tr: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) görüntünün dönüşünü üç boyutta denetleyebilir.
vi: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) có thể điều khiển việc xoay chế độ xem theo ba chiều.
zh_cn: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:))（旋转三维效果）可以控制视图在三维空间中的旋转。
zh_tw: [.rotation3DEffect](doc://com.apple.documentation/documentation/swiftui/view/rotation3deffect(_:axis:anchor:anchorz:perspective:)) 可控制顯示區三個維度的旋轉。

# GuideBook..Guide0..StepAdd a `CreatureDetail` view..TaskaddColorPicker..title
source: Add a `ColorPicker` that changes the `color` value
de: Mit `ColorPicker` eine Farbauswahl zum Ändern des Werts `color` hinzufügen
es: Añadir un `ColorPicker` (selector de colores) que cambie el valor `color`
es_419: Agregar una visualización `ColorPicker` para cambiar el valor de `color`
fr: Ajouter un `ColorPicker` qui modifie la valeur `color`
it: Aggiungere un `ColorPicker` che modifica il valore `color`
nl: Een `ColorPicker` toevoegen die de waarde `color` wijzigt
no: Legg til en `ColorPicker` som endrer verdien `color`
pt: Adicione um `ColorPicker` que altere o valor `color`
sv: Lägg till en `ColorPicker` som ändrar värdet `color`
th: เพิ่ม `ColorPicker` ที่เปลี่ยนแปลงค่า `color`
tr: `color` değerini değiştiren bir `ColorPicker` ekleme
vi: Thêm một `ColorPicker` thay đổi giá trị `color`
zh_cn: 添加更改 `color` 值的 `ColorPicker`
zh_tw: 加入一個會更改 `color` 值的 `ColorPicker`

source: To start building some interaction into this view, first add a `ColorPicker` view below the `Text` view. This changes the state property `color` when a new color is chosen.
de: Um die Ansicht interaktiver zu gestalten, füge zuerst unter der Ansicht `Text` die Ansicht `ColorPicker` (Farbauswahl) hinzu. Dadurch ändert sich die Statuseigenschaft `color` (Farbe), wenn eine neue Farbe ausgewählt wird.
es: Para comenzar a incorporar algo de interacción a esta vista, primero hay que añadir una vista `ColorPicker` debajo de la vista `Text` (texto). Esto cambia la propiedad de estado `color` al seleccionar un nuevo color.
es_419: Para empezar a agregar algo de interacción a esta visualización, primero agrega una visualización `ColorPicker` debajo de la visualización `Text`. Esto cambia el estado de la propiedad `color` cuando se elija un color nuevo.
fr: Pour commencer à créer de l’interaction dans cette vue, commence par ajouter une vue `ColorPicker` sous la vue `Text`. Cela change la propriété d’état `color` lorsqu’une nouvelle couleur sera choisie.
it: Per iniziare a programmare un po' di interazione in questa vista, prima di tutto aggiungi la vista `ColorPicker` sotto la vista `Text`. In questo modo la proprietà stato `color` viene modificata quando viene scelto un nuovo colore.
nl: Om deze weergave wat interactiever te maken, ga je om te beginnen een `ColorPicker`-weergave onder de `Text`-weergave toevoegen. Hiermee verandert de statuseigenschap `color` wanneer er een nieuwe kleur wordt gekozen.
no: Du begynner å bygge interaksjoner i denne visningen ved å først legge til en `ColorPicker`-visning nedenfor `Text`-visningen. Dette endrer statusegenskapen `color` når en ny farge velges.
pt: Para começar a criar alguma interação nesta visualização, primeiro adicione uma visualização `ColorPicker` abaixo da visualização `Text`. Isso altera a propriedade de estado `color` quando uma nova cor é escolhida.
sv: Du börjar bygga interaktioner i den här vyn genom att först lägga till en `ColorPicker`-vy nedanför `Text`-vyn. Det ändrar statusegenskapen `color` när en ny färg väljs.
th: ในการเริ่มสร้างการโต้ตอบไปยังมุมมองนี้ ก่อนอื่นให้เพิ่มมุมมอง `ColorPicker` ใต้มุมมอง `Text` การทำเช่นนี้จะเปลี่ยนคุณสมบัติสถานะ `color` เมื่อมีการเลือกสีใหม่
tr: Bu görüntüyle biraz etkileşim kurmaya başlamak için öncelikle `Text` görüntüsünün altına bir `ColorPicker` görüntüsü ekle. Bu, yeni bir renk seçildiğinde `color` durum özelliğini değiştirir.
vi: Để bắt đầu xây dựng một tương tác nào đó vào chế độ xem này, trước tiên hãy thêm một chế độ xem `ColorPicker` bên dưới chế độ xem `Text`. Việc này làm thay đổi `color` của thuộc tính trạng thái khi một màu mới được chọn.
zh_cn: 若要开始给这个视图构建一些互动性，首先在 `Text` 视图下方添加 `ColorPicker` 视图。这会在选取了新颜色时更改 `color` 状态属性。
zh_tw: 若要開始在此顯示區中建立一些互動，首先在 `Text` 顯示區下方加入一個 `ColorPicker` 顯示區。這會在選取新的顏色時更改狀態屬性 `color`。

source: Try to do this yourself, using the solution if you get stuck.
de: Versuche, die Aufgabe alleine zu lösen. Wenn du nicht weiterkommst, kannst du die Lösung verwenden.
es: Intenta hacerlo tú mismo, y utiliza la solución si te atascas.
es_419: Intenta hacerlo por tu cuenta, y consulta la solución si tienes problemas.
fr: Essaie de faire cela par toi-même, en utilisant la solution si tu es bloqué.
it: Prova a lavorare in modo indipendente e ricorri alla soluzione solo se non riesci ad andare avanti.
nl: Probeer dit zelf te doen en gebruik de oplossing als je vast komt te zitten.
no: Prøv å gjøre dette selv, og bruk løsningen hvis du sitter fast.
pt: Tente fazer isso e use a solução caso não consiga sair do lugar.
sv: Försök att göra det här själv med hjälp av lösningen ifall du fastnar.
th: ลองทำสิ่งนี้ด้วยตัวคุณเอง และใช้วิธีแก้ปัญหาหากคุณไปต่อไม่ได้
tr: Sıkışırsan çözümü kullanarak bunu kendin yapmayı dene.
vi: Hãy cố gắng tự mình thực hiện việc này, sử dụng giải pháp nếu bạn bị vướng mắc.
zh_cn: 试着自己完成，遇到困难时可使用解决方案。
zh_tw: 嘗試自己執行此操作，如果遇到困難，請使用解決方案。

source: ColorPicker("Choose a Color", selection: $color)
de: ColorPicker("Wähle eine Farbe", selection: $color)
es: ColorPicker("Selecciona un color", selection: $color)
es_419: ColorPicker("Elige un color", selection: $color)
fr: ColorPicker("Choisissez une couleur", selection: $color)
nl: ColorPicker("Kies een kleur", selection: $color)
no: ColorPicker("Velg en farge", selection: $color)
sv: ColorPicker("Välj en färg", selection: $color)
tr: ColorPicker("Bir Renk Seç", selection: $color)
vi: ColorPicker("Chọn một màu", selection: $color)
zh_cn: ColorPicker("选取一种颜色", selection: $color)

source: Add a `Slider` that controls the shadow radius
de: `Slider` zum Steuern des Schattenradius hinzufügen
es: Añadir un `Slider` (regulador) que controla el radio del sombreado
es_419: Agregar un control `Slider` para ajustar el radio del sombreado
fr: Ajouter un `Slider` qui contrôle le rayon de l’ombre
it: Aggiungere uno `Slider` che controlla il raggio dell'ombra
nl: Een `Slider` toevoegen waarmee je de radius van de schaduw regelt
no: Legg til en `Slider` som styrer skyggeradiusen
pt: Adicione um `Slider` que controle o raio da sombra
sv: Lägg till `Slider` som styr skuggradien
th: เพิ่ม `Slider` ที่ควบคุมรัศมีของเงา
tr: Gölge yarıçapını denetleyen bir `Slider` ekleme
vi: Thêm một `Slider` điều khiển bán kính bóng đổ
zh_cn: 添加控制阴影半径的 `Slider`
zh_tw: 加入一個控制陰影半徑的 `Slider`

source: Below the `ColorPicker` add a `Slider` that controls the `shadowRadius` value.
de: Füge unter `ColorPicker` den `Slider` hinzu, der den Wert `shadowRadius` (Schattenradius) steuert.
es: Debajo de `ColorPicker` (selector de colores), añade un `Slider` (regulador) que controle el valor de `shadowRadius`.
es_419: Debajo de `ColorPicker`, agrega un `Slider` que controle el valor de `shadowRadius`.
fr: Sous le `ColorPicker`, ajoute un `Slider` qui contrôle la valeur `shadowRadius`.
it: Sotto `ColorPicker` aggiungi uno `Slider` che controlla il valore di `shadowRadius`.
nl: Voeg onder de `ColorPicker` een `Slider` toe waarmee je de waarde `shadowRadius` regelt.
no: Nedenfor `ColorPicker` legger du til en `Slider` som styrer verdien `shadowRadius`.
pt: Abaixo de `ColorPicker`, adicione um `Slider` que controle o valor `shadowRadius`.
sv: Nedanför `ColorPicker` lägger du till `Slider` som styr värdet `shadowRadius`.
th: ด้านล่าง `ColorPicker` ให้เพิ่ม `Slider` ที่ควบคุมค่า `shadowRadius`
tr: `ColorPicker`’ın altına `shadowRadius` değerini denetleyen bir `Slider` ekle.
vi: Bên dưới `ColorPicker`, hãy thêm một `Slider` điều khiển giá trị `shadowRadius`.
zh_cn: 在 `ColorPicker` 下方添加一个 `Slider`，用于控制`shadowRadius` 值。
zh_tw: 在 `ColorPicker` 下方加入一個控制 `shadowRadius` 值的 `Slider`。

source: Try to do this yourself, using the solution if you get stuck.
de: Versuche, die Aufgabe alleine zu lösen. Wenn du nicht weiterkommst, kannst du die Lösung verwenden.
es: Intenta hacerlo tú mismo, y utiliza la solución si te atascas.
es_419: Intenta hacerlo por tu cuenta, y consulta la solución si tienes problemas.
fr: Essaie de faire cela par toi-même, en utilisant la solution si tu es bloqué.
it: Prova a lavorare in modo indipendente e ricorri alla soluzione solo se non riesci ad andare avanti.
nl: Probeer dit zelf te doen en gebruik de oplossing als je vast komt te zitten.
no: Prøv å gjøre dette selv, og bruk løsningen hvis du sitter fast.
pt: Tente fazer isso e use a solução caso não consiga sair do lugar.
sv: Försök att göra det här själv med hjälp av lösningen ifall du fastnar.
th: ลองทำสิ่งนี้ด้วยตัวคุณเอง และใช้วิธีแก้ปัญหาหากคุณไปต่อไม่ได้
tr: Sıkışırsan çözümü kullanarak bunu kendin yapmayı dene.
vi: Hãy cố gắng tự mình thực hiện việc này, sử dụng giải pháp nếu bạn bị vướng mắc.
zh_cn: 试着自己完成，遇到困难时可使用解决方案。
zh_tw: 嘗試自己執行此操作，如果遇到困難，請使用解決方案。
