Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: The key to communicating data changes between two views is called a [binding](glossary://binding). A binding lets you keep a single source of truth, but allows a [subview](glossary://subview) to modify that value remotely. It’s called a binding because the source of truth, such as a [state property](glossary://state%20property), binds (or connects) to a second view, and any time the second view changes the data, the source of truth is updated.
de: Die Übermittlung von Datenänderungen zwischen zwei Ansichten lässt sich mit einer [Bindung](glossary://binding) lösen. Mit ihr hast du nur eine Wahrheitsquelle und [Unteransichten](glossary://subview) können diesen Wert aus der Ferne ändern. Dies wird als Bindung bezeichnet, weil die Wahrheitsquelle, z. B. eine [Statuseigenschaft](glossary://state%20property), mit einer zweiten Ansicht verknüpft (oder verbunden) ist. Jedes Mal, wenn sich die Daten der zweiten Ansicht ändern, wird die Wahrheitsquelle aktualisiert.
es: La clave para comunicar los cambios de datos entre dos vistas se llama [vinculación](glossary://binding). Una vinculación te permite mantener una única fuente de datos, pero permite que una [vista secundaria](glossary://subview) modifique ese valor de forma remota. Se llama vinculación porque la fuente de datos, como [propiedad de estado](glossary://state%20property), se vincula (o conecta) a una segunda vista, y cada vez que la segunda vista cambia los datos, se actualiza la fuente de datos.
es_419: La clave para comunicar datos entre dos visualizaciones se llama [ligadura](glossary://binding). Una ligadura te permite mantener una fuente única de información, pero permite que una [subvisualización](glossary://subview) modifique ese valor de forma remota. Se le llama ligadura porque la fuente única de información, como una [propiedad de estado](glossary://state%20property), se liga (se conecta) a una segunda visualización, y cada vez que la segunda visualización cambia los datos, la fuente única de información se actualiza.
fr: La solution pour communiquer des modifications de données entre deux vues s’appelle une [association](glossary://binding). Une association te donne la possibilité de conserver une seule source de vérité, mais permet à une [sous-vue](glossary://subview) de modifier cette valeur à distance. Elle est appelée association, car la source de vérité, telle qu’une [propriété d’état](glossary://state%20property), s’associe (ou se connecte) à une seconde vue, et chaque fois que la seconde vue modifie les données, la source de vérité est mise à jour.
it: Il [vincolo](glossary://binding) è ciò che consente di comunicare i cambiamenti di dati tra due viste. Ti consente di mantenere un'unica sorgente univoca e consente a una [vista secondaria](glossary://subview) di modificare il valore rilevante da remoto. Si chiama “vincolo” perché la sorgente univoca, ad esempio una [proprietà di stato](glossary://state%20property), crea un'unione (o una connessione) con una seconda vista e, ogni volta che i dati di quest'ultima cambiano, la sorgente univoca viene aggiornata.
nl: Bij het uitwisselen van gewijzigde gegevens tussen twee weergaven speelt de [binding](glossary://binding) een centrale rol. Met een binding hoef je maar één bron van waarheid bij te houden en kan een [subweergave](glossary://subview) die waarde op afstand wijzigen. Een binding verbindt de bron van waarheid, zoals een [statuseigenschap](glossary://state%20property), met een tweede weergave waardoor de bron van waarheid kan worden bijgewerkt als de gegevens door de tweede weergave worden gewijzigd.
no: Nøkkelen til å formidle dataendringer mellom to visninger kalles en [binding](glossary://binding). Med en binding kan du beholde én sannhetskilde, men tillate at en [delvisning](glossary://subview) endrer den verdien eksternt. Det kalles en binding fordi sannhetskilden, for eksempel en [statusegenskap](glossary://state%20property), bindes (eller kobles) til en annen visning som oppdaterer sannhetskilden hver gang noe data endres i den andre visningen.
pt: A chave para comunicar mudanças de dados entre duas visualizações se chama [vínculo](glossary://binding). Um vínculo permite que você mantenha uma única fonte da verdade, mas permite que uma [subvisualização](glossary://subview) modifique esse valor remotamente. Isso é chamado de vínculo porque a fonte da verdade, como uma [propriedade de estado](glossary://state%20property), vincula (ou conecta) uma segunda visualização e, sempre que a segunda visualização altera os dados, a fonte da verdade é atualizada.
sv: Nyckeln till att förmedla dataändringar mellan två vyer kallas för en [koppling](glossary://binding). Med en koppling kan du behålla en enda sanningskälla men tillåta att en [delvy](glossary://subview) ändrar det värdet på distans. Det kallas för en koppling eftersom sanningskällan, t.ex. en [statusegenskap](glossary://state%20property), kopplas (ansluts) till en andra vy som uppdaterar sanningskällan varje gång några data ändras i den andra vyn.
th: กุญแจสำคัญในการสื่อสารการเปลี่ยนแปลงข้อมูลระหว่างสองมุมมองนั้นเรียกว่า[การรวม](glossary://binding) การรวมช่วยให้คุณเก็บแหล่งข้อมูลจริงเพียงแหล่งเดียว แต่อนุญาตให้[มุมมองย่อย](glossary://subview)แก้ไขค่านั้นจากระยะไกลได้ สิ่งนี้เรียกว่าการรวมเนื่องจากแหล่งข้อมูลจริง เช่น [คุณสมบัติวัตถุ](glossary://state%20property) จะรวม (หรือเชื่อมต่อ) กับมุมมองที่สอง และทุกครั้งที่มุมมองที่สองเปลี่ยนแปลงข้อมูล แหล่งข้อมูลจริงจะมีการอัปเดต
tr: İki görüntü arasında veri değişikliklerini iletmenin anahtarına [bağlama](glossary://binding) adı verilir. Bağlama, tek bir gerçeklik kaynağı tutmanı sağlar ancak bir [alt görüntünün](glossary://subview) bu değeri uzaktan değiştirmesine izin verir. [Durum özelliği](glossary://state%20property) gibi bir gerçeklik kaynağı ikinci bir görüntüye bağlandığından ve ikinci görüntü verileri her değiştirdiğinde gerçeklik kaynağı güncellendiğinden buna bağlama adı verilir.
vi: Chìa khóa để truyền đạt các thay đổi dữ liệu giữa hai chế độ xem được gọi là một [ràng buộc](glossary://binding). Ràng buộc cho phép bạn lưu giữ một nguồn chân lý đơn nhất, nhưng cho phép một [chế độ xem phụ](glossary://subview) sửa đổi giá trị đó từ xa. Nó được gọi là một ràng buộc vì nguồn chân lý, ví dụ như một [thuộc tính trạng thái](glossary://state%20property), ràng buộc (hoặc kết nối) với một chế độ xem thứ hai và bất kỳ lúc nào chế độ xem thứ hai đó thay đổi dữ liệu thì nguồn chân lý được cập nhật.
zh_cn: [绑定](glossary://binding)是在两个视图间沟通数据更改的关键，在可让你保持使用单个可信源的同时，又允许[子视图](glossary://subview)远程修改这个值。它叫做绑定是因为可信源（如[状态属性](glossary://state%20property)）绑定（或连接）到了第二个视图，只要第二个视图更改数据，可信源就会更新。
zh_tw: 在兩個顯示區之間傳遞資料更動的關鍵稱為[綁定](glossary://binding)。綁定能讓你保留單一的真實來源，但允許[子顯示區](glossary://subview)遠端修改該數值。之所以稱為綁定，是因為如[狀態屬性](glossary://state%20property)之類的真實來源會綁定（或連接）到第二個顯示區，並且每當第二個顯示區更改資料時，也會更新真實來源。

source: Try tapping on the `Toggle` in the preview.
de: Tippe in der Vorschau auf den Ein-/Ausschalter `Toggle`.
es: Prueba a tocar la vista `Toggle` en la vista previa.
es_419: Intenta tocar el botón `Toggle` en la vista previa.
fr: Essaie de toucher le `Toggle` dans l’aperçu.
it: Prova a toccare `Toggle` nell'anteprima.
nl: Tik op de `Toggle` in de voorvertoning.
no: Prøv å trykke på `Toggle` i forhåndsvisningen.
pt: Tente tocar em `Toggle` na pré-visualização.
sv: Prova att trycka på `Toggle` i förhandsvisningen.
th: ลองแตะบน `Toggle` ในการแสดงตัวอย่าง
tr: Önizlemede `Toggle`’a dokunmayı dene.
vi: Thử chạm vào `Toggle` trong bản xem trước.
zh_cn: 试着轻点预览中的 `Toggle`。
zh_tw: 嘗試在預覽中點一下 `Toggle`。

source: Notice that both the `Image` and `Toggle` views change their appearance when you tap the toggle. The `Toggle` can change the [source of truth](glossary://source%20of%20truth) remotely, allowing itself and the `Image` view to share the same value even though they’re two separate views.
de: Hast du bemerkt, dass die `Image`- und `Toggle`-Ansicht ihre Erscheinungsbilder ändern, wenn du auf den Ein-/Ausschalter tippst? `Toggle` kann die [Wahrheitsquelle](glossary://source%20of%20truth) aus der Ferne ändern und dafür sorgen, dass der Ein/Ausschalter (Toggle) und die `Image`-Ansicht denselben Wert teilen, auch wenn es sich dabei um zwei separate Ansichten handelt.
es: Fíjate que tanto la vista `Image` como la vista `Toggle` cambian su aspecto cuando tocas el comando de activación o desactivación. `Toggle` puede cambiar la [fuente de datos](glossary://source%20of%20truth) de forma remota, permitiendo que ella misma y la vista `Image` compartan el mismo valor aunque sean dos vistas distintas.
es_419: Fíjate que las visualizaciones `Image` y `Toggle` cambian su aspecto cuando se toca esta última. La visualización `Toggle` puede cambiar la [fuente única de información](glossary://source%20of%20truth) de forma remota, para permitirse a sí misma y a la visualización `Image` compartir el mismo valor aunque sean visualizaciones independientes.
fr: Tu remarqueras que la vue `Image` et la vue `Toggle` changent toutes deux leur apparence lorsque tu touches le commutateur. Le `Toggle` peut modifier la [source de vérité](glossary://source%20of%20truth) à distance, ce qui lui permet de partager la même valeur avec la vue `Image`, même si elles constituent deux vues distinctes.
it: Quando tocchi l'interruttore, cambia sia l'aspetto della vista `Image` che della vista `Toggle`. La vista `Toggle` è in grado di cambiare la [sorgente univoca](glossary://source%20of%20truth) da remoto e può condividere con la vista `Image` lo stesso valore anche se sono due viste separate.
nl: Zoals je ziet, wordt zowel het uiterlijk van de `Image`-weergave als dat van de `Toggle`-weergave gewijzigd als je op de schakelaar tikt. De `Toggle` kan de [bron van waarheid](glossary://source%20of%20truth) op afstand wijzigen, waardoor deze weergave en de `Image`-weergave dezelfde waarde kunnen delen ondanks het feit dat het twee afzonderlijke weergaven zijn.
no: Legg merke til at både `Image`- og `Toggle`-visningene endrer utseende når du trykker på veksleknappen. `Toggle` kan endre [sannhetskilden](glossary://source%20of%20truth) eksternt, slik at den selv og `Image`-visningen deler samme verdi selv om de er to separate visninger.
pt: Note que as visualizações `Image` e `Toggle` mudam de aparência quando você toca no alternador. `Toggle` pode mudar a [fonte da verdade](glossary://source%20of%20truth) remotamente, permitindo a si e à visualização `Image` compartilhar o mesmo valor, embora sejam duas visualizações separadas.
sv: Lägg märke till att både `Image`- och `Toggle`-vyerna ändrar utseende när du trycker på växlaren. `Toggle` kan ändra [sanningskällan](glossary://source%20of%20truth) på distans så att den själv och `Image`-vyn delar samma värde trots att de är två separata vyer.
th: สังเกตว่าทั้งมุมมอง `Image` และ `Toggle` จะเปลี่ยนรูปแบบเมื่อคุณแตะตัวสลับ โดย `Toggle` สามารถเปลี่ยนแปลง[แหล่งข้อมูลจริง](glossary://source%20of%20truth)จากระยะไกลได้ ซึ่งทำให้ตัวมุมมองเองและมุมมอง `Image` สามารถแชร์ค่าเดียวกันได้แม้ว่าจะเป็นสองมุมมองที่แยกจากกัน
tr: Açma/kapatmaya dokunduğunda hem `Image` hem de `Toggle` görüntüsünün görünüşünü değiştirdiğine dikkat et. `Toggle`, [gerçeklik kaynağını](glossary://source%20of%20truth) uzaktan değiştirebilir ve böylece kendisi ve `Image` görüntüsü iki ayrı görüntü olmalarına rağmen aynı değeri paylaşabilir.
vi: Hãy lưu ý rằng cả hai chế độ xem `Image` và `Toggle` đều thay đổi giao diện khi bạn chạm vào nút chuyển đổi. `Toggle` có thể thay đổi [nguồn chân lý](glossary://source%20of%20truth) từ xa, cho phép chính nó và chế độ xem `Image` chia sẻ cùng một giá trị mặc dù chúng là hai chế độ xem riêng biệt.
zh_cn: 请注意，`Image`（图像）视图和 `Toggle`（开关）视图在你轻点开关时会更改外观。`Toggle` 可以远程更改[可信源](glossary://source%20of%20truth)，使它自身和 `Image` 视图可共享相同的值，即使它们是两个独立的视图。
zh_tw: 請注意，當你點按切換時，`Image` 和 `Toggle` 顯示區都會改變它們的外觀。`Toggle` 可以遠端更改[真實來源](glossary://source%20of%20truth)，允許它本身和 `Image` 顯示區共享相同的值，即使它們是兩個獨立的顯示區。

source: This is your source of truth – a [state property](glossary://state%20property) that you store [locally](glossary://local%20scope) in the `Bindings` view. A binding’s source of truth must be one whose value is managed by SwiftUI, such as by adding the `@State` [property wrapper](glossary://property%20wrapper) to it.
de: Dies ist deine Wahrheitsquelle – eine [Statuseigenschaft](glossary://state%20property) die du [lokal](glossary://local%20scope) in der `Bindings`-Ansicht speicherst. Die Wahrheitsquelle einer Bindung muss einen Wert haben, der von SwiftUI verwaltet wird, z. B. durch das Hinzufügen des [Eigenschaftswrappers](glossary://property%20wrapper) `@State`.
es: Esta es tu fuente de datos: una [propiedad de estado](glossary://state%20property) que almacenas [localmente](glossary://local%20scope) en la vista `Bindings`. La fuente de datos de una vinculación debe ser una cuyo valor sea gestionado por SwiftUI, como al añadirle el [contenedor de propiedades](glossary://property%20wrapper) `@State`.
es_419: Esta es tu fuente única de información; es decir, una [propiedad de estado](glossary://state%20property) que almacenas [localmente](glossary://local%20scope) en la visualización `Bindings`. La fuente única de información de una ligadura debe ser una cuyo valor esté administrado por SwiftUI; y para hacer esto puedes agregarle el [contenedor de propiedades](glossary://property%20wrapper) `@State`.
fr: Il s’agit de ta source de vérité, une [propriété d’état](glossary://state%20property) que tu stockes [localement](glossary://local%20scope) dans la vue `Bindings`. La source de vérité d’une association doit être celle dont la valeur est gérée par SwiftUI, comme en lui ajoutant le [wrapper de propriété](glossary://property%20wrapper) `@State`.
it: Questa è la tua sorgente univoca, una [proprietà di stato](glossary://state%20property) che salvi in [locale](glossary://local%20scope) nella vista `Bindings`. Il valore della sorgente univoca di un vincolo deve essere gestito da SwiftUI, ad esempio aggiungendo il [wrapper di proprietà](glossary://property%20wrapper) `@State`.
nl: Dit is je bron van waarheid, een [statuseigenschap](glossary://state%20property) die je [lokaal](glossary://local%20scope) opslaat in de weergave `Bindings`. De waarde van de bron van waarheid van een binding moet door SwiftUI worden beheerd, bijvoorbeeld door er de [eigenschapwrapper](glossary://property%20wrapper) `@State` aan toe te voegen.
no: Dette er din sannhetskilde: en [statusegenskap](glossary://state%20property) som du lagrer [lokalt](glossary://local%20scope) i `Bindings`-visningen. En bindings sannhetskilde må være en der verdien håndteres av SwiftUI, for eksempel ved å legge til [egenskapsinnpakningen](glossary://property%20wrapper) `@State` i den.
pt: Esta é a sua fonte da verdade, uma [propriedade de estado](glossary://state%20property) que você armazena [localmente](glossary://local%20scope) na visualização `Bindings`. A fonte da verdade de um vínculo precisa ter seus valores gerenciados pela SwiftUI, como ao adicionar um [empacotador de propriedades](glossary://property%20wrapper) `@State` a ela.
sv: Det här är din sanningskälla: en [statusegenskap](glossary://state%20property) som du lagrar [lokalt](glossary://local%20scope) i `Bindings`-vyn. En kopplings sanningskälla måste vara en vars värde hanteras av SwiftUI, exempelvis genom att lägga till [egenskapspaketeraren](glossary://property%20wrapper) `@State` i den.
th: นี่คือแหล่งข้อมูลจริงของคุณ ซึ่งเป็น[คุณสมบัติสถานะ](glossary://state%20property)ที่คุณจัดเก็บ[ภายใน](glossary://local%20scope)มุมมอง `Bindings` แหล่งข้อมูลจริงของการรวมจะต้องเป็นแหล่งที่มีค่าที่ SwiftUI จัดการ เช่น การเพิ่ม[ตัวหุ้มคุณสมบัติ](glossary://property%20wrapper) `@State` ไปยังแหล่งข้อมูลจริงนั้น
tr: Bu, `Bindings` görüntüsünde [yerel olarak](glossary://local%20scope) sakladığın bir [durum özelliği](glossary://state%20property) olan gerçeklik kaynağındır. Bir bağlamanın gerçeklik kaynağı, `@State` [özellik sarmalayıcısını](glossary://property%20wrapper) ona ekleyerek değeri SwiftUI tarafından yönetilen olmalıdır.
vi: Đây là nguồn chân lý của bạn – một [thuộc tính trạng thái](glossary://state%20property) mà bạn lưu trữ [cục bộ](glossary://local%20scope) trong chế độ xem `Bindings`. Nguồn chân lý của một ràng buộc phải là nguồn chân lý có giá trị được quản lý bởi SwiftUI, ví dụ như bằng cách thêm [trình đóng gói thuộc tính](glossary://property%20wrapper) `@State` vào đó.
zh_cn: 这是你的可信源，即你[本地](glossary://local%20scope)储存在 `Bindings`（绑定）视图中的[状态属性](glossary://state%20property)。绑定的可信源的值必须由 SwiftUI 管理，例如，通过给它添加 `@State` [属性包装器](glossary://property%20wrapper)来进行。
zh_tw: 這是你的真實來源，一個[狀態屬性](glossary://state%20property)，儲存在[本機](glossary://local%20scope)的 `Bindings` 顯示區中。綁定的真實來源其值必須由 SwiftUI 管理，例如藉由對其加入 `@State` [屬性包覆](glossary://property%20wrapper)。

source: This is the built-in `Toggle` view. A `Toggle` accepts a [binding](glossary://binding) Boolean value for its `isOn` parameter. This means that the toggle view knows how to change `Boolean` value based on some [user interaction](glossary://user%20interaction), like when a person taps the toggle on or off, and communicates any state changes back to your local [source of truth](glossary://source%20of%20truth), `isOn`.
de: Dies ist die integrierte `Toggle`-Ansicht. `Toggle` akzeptiert einen [gebundenen](glossary://binding) booleschen Wert für seinen `isOn`-Parameter. Das bedeutet, dass die Ansicht für den Ein-/Ausschalter weiß, wie sie den `Boolean`-Wert auf Grundlage der [Benutzerinteraktion](glossary://user%20interaction) (wenn Benutzer:innen auf die Taste zum Ein-/Ausschalten tippen) ändert. Sie übermittelt außerdem alle Statusänderungen an deine lokale [Wahrheitsquelle](glossary://source%20of%20truth) `isOn`.
es: Esta es la vista integrada `Toggle`. Una vista `Toggle` acepta un valor booleano de [vinculación](glossary://binding) para su parámetro `isOn`. Esto significa que la vista de alternancia sabe cómo cambiar el valor `Boolean` en función de alguna [interacción del usuario](glossary://user%20interaction), como cuando una persona toca el comando de activación o desactivación, y comunica cualquier cambio de estado a tu [fuente de datos](glossary://source%20of%20truth) local, `isOn`.
es_419: Esta es la visualización integrada `Toggle`, la cual acepta un valor booleano de [ligadura](glossary://binding) para su parámetro `isOn`. Esto significa que esta visualización sabe cómo cambiar el valor `Boolean` con base en la [interacción del usuario](glossary://user%20interaction), como cuando una persona toca el botón para activar o desactivar, y comunica cualquier cambio de estado a tu [fuente única de información](glossary://source%20of%20truth) local, `isOn`.
fr: Il s’agit de la vue `Toggle` intégrée. Un `Toggle` accepte une valeur booléenne d’[association](glossary://binding) pour son paramètre `isOn`. Cela signifie que la vue sait comment changer de valeur `Boolean` en fonction d’une [interaction utilisateur](glossary://user%20interaction), comme lorsqu’une personne touche le commutateur pour l’activer ou le désactiver, et communique en retour toute modification d’état à ta [source de vérité](glossary://source%20of%20truth) locale, `isOn`.
it: Questa è la vista integrata `Toggle`. `Toggle` accetta un valore booleano [vincolante](glossary://binding) per il parametro `isOn`. Questo significa che la vista `Toggle` è in grado di modificare un valore `Boolean` sulla base dell'[interazione utente](glossary://user%20interaction) (come quando una persona attiva o disattiva un interruttore) e comunica qualsiasi cambiamento di stato alla tua [sorgente univoca](glossary://source%20of%20truth) locale, `isOn`.
nl: Dit is de ingebouwde weergave `Toggle`. Een `Toggle` ontvangt via een [binding](glossary://binding) een Booleaanse waarde voor de parameter `isOn`. Dit betekent dat de `Toggle`-weergave weet hoe de waarde `Boolean` moet worden gewijzigd op basis van een [gebruikersinteractie](glossary://user%20interaction), zoals een gebruiker die op de schakelaar tikt om deze in- of uit te schakelen. De `Toggle`-weergave stuurt alle statuswijzigingen terug naar je lokale [bron van waarheid](glossary://source%20of%20truth) voor `isOn`.
no: Dette er den innebygde `Toggle`-visningen. En `Toggle` godtar en boolsk verdi for [bindingen](glossary://binding) for dens `isOn`-parameter. Dette innebærer at vekslingsvisningen vet hvordan den endrer `Boolean`-verdien basert på en [brukerinteraksjon](glossary://user%20interaction), som når en person slår veksleknappen av eller på, og formidler eventuelle statusendringer tilbake til den lokale [sannhetskilden](glossary://source%20of%20truth) `isOn`.
pt: Esta é a visualização integrada `Toggle`. Uma visualização `Toggle` aceita um valor Booleano de [vínculo](glossary://binding) em seu parâmetro `isOn`. Isso significa que a visualização do interruptor sabe como alterar o valor `Boolean` com base em alguma [interação do usuário](glossary://user%20interaction), como quando uma pessoa toca para ativar ou desativar o interruptor, e comunica qualquer alteração de estado de volta à [fonte da verdade](glossary://source%20of%20truth) local `isOn`.
sv: Det här är den inbyggda `Toggle`-vyn. En `Toggle` tar emot ett booleskt värde för [kopplingen](glossary://binding) för dess `isOn`-parameter. Det innebär att växlingsvyn vet hur den ändrar `Boolean`-värdet baserat på någon [användarinteraktion](glossary://user%20interaction), som när en person trycker på växlaren så att den stängs av eller slås på, och förmedlar eventuella statusändringar tillbaka till den lokala [sanningskällan](glossary://source%20of%20truth) `isOn`.
th: นี่คือมุมมอง `Toggle` ในตัว โดย `Toggle` จะยอมรับค่าบูลีน[การรวม](glossary://binding)สำหรับพารามิเตอร์ `isOn` ของตัวเอง ซึ่งหมายความว่ามุมมองสลับระหว่างเปิดหรือปิดจะรู้วิธีเปลี่ยนค่า `Boolean` ตาม[การโต้ตอบของผู้ใช้](glossary://user%20interaction)บางอย่าง เช่น เมื่อคนแตะที่ตัวสลับให้เปิดหรือปิด และจะสื่อสารการเปลี่ยนแปลงสถานะใดๆ กลับไปยัง[แหล่งข้อมูลจริง](glossary://source%20of%20truth)ภายในของคุณ นั่นคือ `isOn`
tr: Bu, yerleşik `Toggle` görüntüsüdür. `Toggle`, `isOn` parametresi için bir [bağlama](glossary://binding) Boole değerini kabul eder. Bu, açma/kapatma görüntüsünün bazı [kullanıcı etkileşimlerine](glossary://user%20interaction) (bir kişinin bir düğmeye dokunarak açıp kapatması gibi) bağlı olarak `Boolean` değerini değiştirmeyi bildiği ve tüm durum değişikliklerini yerel [gerçeklik kaynağın](glossary://source%20of%20truth) olan `isOn`'a ilettiği anlamına gelir.
vi: Đây là chế độ xem `Toggle` tích hợp. `Toggle` chấp nhận một giá trị Boolean [ràng buộc](glossary://binding) cho tham số `isOn` của mình. Điều này nghĩa là chế độ xem chuyển đổi biết cách thay đổi giá trị `Boolean` dựa trên [tương tác của người dùng](glossary://user%20interaction) nào đó, chẳng hạn như khi một người chạm vào nút chuyển đổi bật hoặc tắt, đồng thời truyền đạt bất kỳ thay đổi trạng thái nào trở lại [nguồn chân lý](glossary://source%20of%20truth) cục bộ của bạn, `isOn`.
zh_cn: 这是内建 `Toggle` 视图。`Toggle` 的 `isOn` 参数可接受[绑定](glossary://binding)布尔值。这意味着开关视图知道如何根据某些[用户交互](glossary://user%20interaction)（如用户轻点打开或关闭）来更改 `Boolean`（布尔）值，并将任何状态更改回复给你的本地[可信源](glossary://source%20of%20truth) `isOn`。
zh_tw: 這是內建的 `Toggle` 顯示區。`Toggle` 的 `isOn` 參數會接收一個[綁定](glossary://binding)布林值。這表示切換顯示區知道如何根據一些[使用者互動](glossary://user%20interaction)（例如使用者點按切換開啟或關閉）來更改 `Boolean` 值，並將任何狀態更動傳回給你的區域[真實來源](glossary://source%20of%20truth) `isOn`。
