Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepModifying State..LearningCenterContent..Paragraph6
source: When you connect your UI to some app data, such as a [Boolean](glossary://Boolean) or array of [String](glossary://String) values, SwiftUI can [observe](glossary://observe) that data, updating the views that use the data any time it changes. This means you never have to write any code that tells your UI specifically how or when to update.
de: Wenn du deine Benutzeroberfläche mit App-Daten verbindest, z. B. mit [booleschen](glossary://Boolean) Werten oder einem Array mit [String](glossary://String)-Werten, kann SwiftUI diese Daten [beobachten](glossary://observe) und die Ansichten aktualisieren, wenn sich die von ihnen verwendeten Daten ändern.
es: Cuando conectas tu IU a algunos datos de la app, como un [booleano](glossary://Boolean) o vector de valores de [String](glossary://String), SwiftUI puede [observar](glossary://observe) esos datos y actualizar las vistas que usan los datos cada vez que cambian. Esto significa que no tendrás que escribir ningún código que le diga a tu IU específicamente cómo o cuándo se debe actualizar.
es_419: Cuando conectas tu IU con datos de la app, como un [booleano](glossary://Boolean) o un arreglo con valores del tipo [string](glossary://String), SwiftUI puede [observar](glossary://observe) esos datos y actualizar las visualizaciones que usan los datos cada vez que haya un cambio. Esto significa que nunca tendrás que escribir código para indicarle a tu IU específicamente cómo o cuándo debe actualizarse.
fr: Lorsque tu connectes ton interface utilisateur à des données d’app, comme une valeur [booléenne](glossary://Boolean) ou un tableau de valeurs [Chaîne](glossary://String), SwiftUI peut [observer](glossary://observe) ces données, en mettant à jour les vues qui les utilisent dès qu’elles changent. Cela signifie que tu n’as jamais besoin de rédiger du code pour indiquer spécifiquement à ton interface utilisateur comment et quand se mettre à jour.
it: Quando connetti l'interfaccia utente ai dati dell'app, come a un valore [booleano](glossary://Boolean) o a un array di valori [String](glossary://String), SwiftUI è in grado di [osservare](glossary://observe) tali dati e aggiornare le viste in cui vengono utilizzati ogni volta che i dati cambiano. Questo significa che non dovrai mai scrivere codice per istruire l'interfaccia utente su come o quando aggiornarsi.
nl: Wanneer je je gebruikersinterface aan appgegevens koppelt, zoals een [Booleaanse waarde](glossary://Boolean) of een array met [string](glossary://String)waarden, kan SwiftUI die gegevens [observeren](glossary://observe) en de weergaven bijwerken zodra de gegevens veranderen. Dit betekent dat je nooit code hoeft te schrijven die aangeeft hoe en wanneer je gebruikersinterface wordt bijgewerkt.
no: Når du kobler brukergrensesnittet til noen appdata, for eksempel en [boolsk](glossary://Boolean) eller matrise med [String](glossary://String)-verdier, kan SwiftUI [observere](glossary://observe) disse dataene og oppdatere visningene som bruker dem, så snart de endres. Dette innebærer at du aldri trenger å skrive kode som forteller brukergrensesnittet nøyaktig når eller hvordan det skal oppdateres.
pt: Quando você conecta a IU a dados de app, tais como um [booleano](glossary://Boolean) ou vetor de valores de [string](glossary://String), a SwiftUI pode [observar](glossary://observe) esses dados, atualizando as visualizações que usam os dados sempre que eles mudarem. Isso quer dizer que você jamais precisará escrever um código que diga como ou quando a IU deve atualizar.
sv: När du ansluter ditt UI till en del appdata, exempelvis en [boolesk](glossary://Boolean) eller array med [String](glossary://String)-värden, kan SwiftUI [observera](glossary://observe) dessa data och uppdatera vyerna som använder dem så fort de ändras. Det innebär att du aldrig behöver skriva kod som talar om för UI:t exakt hur eller när det ska uppdateras.
th: เมื่อคุณเชื่อมต่อ UI ของคุณกับข้อมูลแอปบางอย่าง เช่น [บูลีน](glossary://Boolean)หรืออาร์เรย์ของค่า[สตริง](glossary://String) SwiftUI สามารถ[สังเกต](glossary://observe)ข้อมูลนั้นและอัปเดตมุมมองที่ใช้ข้อมูลนั้นทุกครั้งที่ข้อมูลเปลี่ยนแปลงได้ ซึ่งหมายความว่าคุณไม่จำเป็นต้องเขียนโค้ดใดๆ ที่บอกกับ UI ของคุณอย่างเจาะจงว่าควรอัปเดตอย่างไรหรือเมื่อใด
tr: Kullanıcı arayüzünü [Boole](glossary://Boolean) veya bir [Dizgi](glossary://String) değerleri dizisi gibi uygulama verilerine bağladığında, SwiftUI, her değiştiğinde veriyi kullanan görüntüleri güncelleyerek bu veriyi [gözlemleyebilir](glossary://observe). Bu, kullanıcı arayüzüne özellikle nasıl veya ne zaman güncelleyeceğini söyleyen kodu hiçbir zaman yazman gerekmeyeceği anlamına gelir.
vi: Khi bạn kết nối UI của mình với dữ liệu ứng dụng nào đó, ví dụ như một [Boolean](glossary://Boolean) hoặc một dãy các giá trị [Chuỗi](glossary://String), SwiftUI có thể [quan sát](glossary://observe) dữ liệu đó, cập nhật các chế độ xem sử dụng dữ liệu đó bất kỳ lúc nào thay đổi. Điều này nghĩa là bạn không bao giờ phải viết bất kỳ mã nào để thông báo cụ thể cho UI biết cách thức và thời điểm cập nhật.
zh_cn: 当你将 UI 连接到某些 App 数据时，如[布尔值](glossary://Boolean)或 [String](glossary://String)（字符串）值的数组，SwiftUI 可以[观测](glossary://observe)到这些数据，并随使用该数据的视图发生更改时更新视图。这意味着，你不需要编写任何代码专门告诉 UI 如何或何时更新。
zh_tw: 當你將 UI 連接到某些 App 資料時，例如[布林值](glossary://Boolean)或 [String](glossary://String) 值陣列，SwiftUI 可以[觀察](glossary://observe)該資料，隨時在其更動時更新使用該資料的顯示區。這表示你永遠不必編寫任何程式碼來具體告訴你的 UI 要如何或何時更新。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..title
source: Use a state property to update a view
de: Statuseigenschaft zum Aktualisieren einer Ansicht verwenden
es: Usar una propiedad de estado para actualizar una vista
es_419: Usar una propiedad de estado para actualizar una visualización
fr: Utiliser une propriété d’état pour mettre à jour une vue
it: Utilizzare una proprietà di stato per aggiornare una vista
nl: Een statuseigenschap gebruiken om een weergave bij te werken
no: Bruk en statusegenskap til å oppdatere en visning
pt: Use uma propriedade de estado para atualizar uma visualização
sv: Använd en statusegenskap till att uppdatera en vy
th: ใช้คุณสมบัติสถานะเพื่ออัปเดตมุมมอง
tr: Görüntüyü güncellemek için durum özelliği kullanma
vi: Sử dụng một thuộc tính trạng thái để cập nhật chế độ xem
zh_cn: 使用状态属性更新视图
zh_tw: 使用狀態屬性來更新顯示區

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page0..Paragraph7
source: In this example, SwiftUI updates a view’s appearance when a [state change](glossary://state%20change) occurs.
de: In diesem Beispiel aktualisiert SwiftUI das Erscheinungsbild einer Ansicht, wenn eine [Statusänderung](glossary://state%20change) auftritt.
es: En este ejemplo, SwiftUI actualiza la apariencia de una vista cuando se produce un [cambio de estado](glossary://state%20change).
es_419: En este ejemplo, SwiftUI actualiza el aspecto de una visualización cuando ocurre un [cambio de estado](glossary://state%20change).
fr: Dans cet exemple, SwiftUI met à jour l’apparence d’une vue lorsqu’une [modification d’état](glossary://state%20change) se produit.
it: In questo esempio, SwiftUI aggiorna l'aspetto di una vista quando avviene un [cambiamento di stato](glossary://state%20change).
nl: In dit voorbeeld werkt SwiftUI het uiterlijk van een weergave bij wanneer een [statuswijziging](glossary://state%20change) optreedt.
no: I dette eksempelet oppdaterer SwiftUI en visnings utseende når en [statusendring](glossary://state%20change) finner sted.
pt: Neste exemplo, a SwiftUI atualiza a aparência de uma visualização quando uma [mudança de estado](glossary://state%20change) ocorre.
sv: I det här exemplet uppdaterar SwiftUI en vys utseende när en [statusändring](glossary://state%20change) inträffar.
th: ในตัวอย่างนี้ SwiftUI จะอัปเดตรูปแบบของมุมมองเมื่อมี[การเปลี่ยนแปลงสถานะ](glossary://state%20change)เกิดขึ้น
tr: Bu örnekte, [durum değişikliği](glossary://state%20change) olduğunda SwiftUI görüntünün görünüşünü günceller.
vi: Trong ví dụ này, SwiftUI cập nhật giao diện của một chế độ xem khi xảy ra một [thay đổi trạng thái](glossary://state%20change).
zh_cn: 在这个示例中，SwiftUI 会在发生[状态更改](glossary://state%20change)时更新视图的外观。
zh_tw: 在此範例中，當[狀態更動](glossary://state%20change)發生時，SwiftUI 即會更新顯示區的外觀。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page0..Paragraph8
source: Tap the button in the preview. This switches the value of the `isOn` [property](glossary://property) between `true` and `false` [states](glossary://state), causing the `Circle` view to appear, disappear, and reappear again.
de: Tippe auf die Taste in der Vorschau. Dadurch wird für den Wert der [Eigenschaft](glossary://property) `isOn` zwischen dem [Status](glossary://state) `true` und dem Status `false` umgeschaltet. Das führt dazu, dass die Ansicht `Circle` eingeblendet, ausgeblendet und wieder eingeblendet wird.
es: Toca el botón en la vista previa. Esto cambia el valor de la [propiedad](glossary://property) `isOn` entre los [estados](glossary://state) `true` y `false`, haciendo que la vista `Circle` (círculo) aparezca, desaparezca y vuelva a aparecer.
es_419: Toca el botón en la vista previa. Este botón alterna el valor de la [propiedad](glossary://property) `isOn` (está activado) entre los [estados](glossary://state) `true` y `false` (verdadero y falso), ocasionando que la visualización `Circle` aparezca, desaparezca o vuelva a aparecer.
fr: Touche le bouton dans l’aperçu. Cela fait basculer la valeur de la [propriété](glossary://property) `isOn` entre les [états](glossary://state) `true` et `false`, ce qui fait apparaître, disparaître, puis réapparaître la vue `Circle`.
it: Tocca il pulsante nell'anteprima. Eseguendo questa azione il valore della [proprietà](glossary://property) `isOn` alterna tra gli [stati](glossary://state) `true` e `false`; questo comporta che la vista `Circle` venga visualizzata, nascosta e visualizzata di nuovo.
nl: Tik op de knop in de voorvertoning. Hiermee verander je de [status](glossary://state) van de [eigenschap](glossary://property) `isOn` van `true` in `false` en omgekeerd, waardoor de weergave `Circle` verschijnt, verdwijnt en weer verschijnt.
no: Trykk på knappen i forhåndsvisningen. Dette veksler verdien for `isOn`-[egenskapen](glossary://property) mellom [statusene](glossary://state) `true` og `false`, noe som fører til at `Circle`-visningen vises, forsvinner og vises igjen.
pt: Toque no botão na pré-visualização. Isso alterna o valor da [propriedade](glossary://property) `isOn` entre os [estados](glossary://state) `true` e `false`, fazendo com que a visualização `Circle` apareça, desapareça e apareça novamente.
sv: Tryck på knappen i förhandsvisningen. Det här växlar värdet för `isOn`-[egenskapen](glossary://property) mellan [statusarna](glossary://state) `true` och `false`, vilket leder till att `Circle`-vyn visar, försvinner och visas igen.
th: แตะปุ่มในการแสดงตัวอย่าง การทำเช่นนี้จะสลับค่าของ[คุณสมบัติ](glossary://property) `isOn` ระหว่าง[สถานะ](glossary://state) `true` และ `false` ส่งผลให้มุมมอง `Circle` แสดงขึ้น หายไป และแสดงขึ้นอีกครั้ง
tr: Önizlemede düğmeye dokun. Bu, `isOn` [özelliğinin](glossary://property) değerini `true` ve `false` [durumları](glossary://state) arasında değiştirir ve `Circle` görüntüsünün görünmesine, kaybolmasına ve yeniden görünmesine neden olur.
vi: Chạm vào nút trong bản xem trước. Việc này chuyển đổi giá trị của [thuộc tính](glossary://property) `isOn` giữa các [trạng thái](glossary://state) `true` và `false`, làm cho chế độ xem `Circle` xuất hiện, biến mất và xuất hiện trở lại.
zh_cn: 轻点预览中的按钮。这个操作会将 `isOn`（打开）[属性](glossary://property)的值在 `true`（真）和 `false`（假）[状态](glossary://state)间切换，导致 `Circle`（圆圈）视图出现、消失、再次出现。
zh_tw: 點一下預覽中的按鈕。這會在 `true` 和 `false` [狀態](glossary://state)之間切換 `isOn` [屬性](glossary://property)的值，從而導致 `Circle` 顯示區出現、消失和再次出現。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page1..Paragraph9
source: When you want to modify the appearance of a view, you’ll first need some data to track its [state](glossary://state). You store this data as a [property](glossary://property) of the view.
de: Wenn du das Erscheinungsbild einer Ansicht ändern möchtest, benötigst du als Erstes ein paar Daten, um ihren [Status](glossary://state) zu verfolgen. Diese Daten speicherst du als [Eigenschaft](glossary://property) der Ansicht.
es: Cuando quieras modificar la apariencia de una vista, primero necesitarás que algunos datos controlen su [estado](glossary://state). Estos datos se guardan como una [propiedad](glossary://property) de la vista.
es_419: Para modificar el aspecto de una visualización, primero necesitas datos para hacer un seguimiento de su [estado](glossary://state), y debes almacenar estos datos como una [propiedad](glossary://property) de la visualización.
fr: Lorsque tu souhaites changer l’apparence d’une vue, tu as d’abord besoin de données qui suivent son [état](glossary://state). Tu stockes ces données dans une [propriété](glossary://property) de la vue.
it: Quando intendi modificare l'aspetto di una vista, innanzitutto avrai bisogno di dati per monitorarne lo [stato](glossary://state). Questi dati vengono salvati come una [proprietà](glossary://property) della vista.
nl: Als je het uiterlijk van een weergave wilt wijzigen, heb je allereerst bepaalde gegevens nodig om de [status](glossary://state) ervan bij te houden. Je bewaart deze gegevens als een [eigenschap](glossary://property) van de weergave.
no: Når du ønsker å endre utseendet på en visning, må du først ha noen data som sporer [statusen](glossary://state). Du lagrer disse dataene som en [egenskap](glossary://property) i visningen.
pt: Quando você quer modificar a aparência de uma visualização, primeiro você precisa de alguns dados para rastrear seu [estado](glossary://state) dela. Esses dados são armazenados como uma [propriedade](glossary://property) da visualização.
sv: När du vill ändra utseendet på en vy måste du första ha en del data som spårar dess [status](glossary://state). Du lagrar dessa data som en [egenskap](glossary://property) i vyn.
th: เมื่อคุณต้องการปรับเปลี่ยนรูปแบบของมุมมอง ก่อนอื่นคุณจะต้องมีข้อมูลบางอย่างเพื่อติดตาม[สถานะ](glossary://state)ของมุมมอง คุณจะจัดเก็บข้อมูลนี้เป็น[คุณสมบัติ](glossary://property)ของมุมมอง
tr: Bir görüntünün görünüşünü değiştirmek istediğinde öncelikle [durumunu](glossary://state) izlemek için bazı verilere ihtiyacın olacak. Bu verileri görüntünün bir [özelliği](glossary://property) olarak saklarsın.
vi: Khi bạn muốn sửa đổi giao diện của một chế độ xem, trước tiên bạn sẽ cần dữ liệu nào đó để theo dõi [trạng thái](glossary://state). Bạn lưu trữ dữ liệu này dưới dạng một [thuộc tính](glossary://property) của chế độ xem.
zh_cn: 当你想修改视图的外观时，首先需要一些数据来跟踪它的[状态](glossary://state)。你将这个数据储存为视图的[属性](glossary://property)。
zh_tw: 當你想要修改一個顯示區的外觀時，首先需要一些資料來追蹤它的[狀態](glossary://state)。你會將這些資料儲存為顯示區的[屬性](glossary://property)。

# GuideBook..Guide0..StepModifying State..TaskconditionalViews..Page1..Paragraph10
source: Think of the data in your view as the [source of truth](glossary://source%20of%20truth) that determines how your [UI](glossary://user%20interface) should appear. Instead of modifying the view directly, you modify the data and SwiftUI updates the view for you. Here, your data is a [Boolean](glossary://Boolean) value that determines whether the view is showing (`true`) or hiding (`false`).
de: Betrachte die Daten in der Ansicht als [Wahrheitsquelle](glossary://source%20of%20truth), die festlegt, wie deine [Benutzeroberfläche](glossary://user%20interface) angezeigt werden soll. Anstatt die Ansicht direkt zu ändern, änderst du die Daten und SwiftUI aktualisiert die Ansicht für dich. In diesem Fall sind die Daten ein einfacher [boolescher](glossary://Boolean) Wert, mit dem festgelegt wird, ob die Ansicht eingeblendet (`true`) oder ausgeblendet (`false`) wird.
es: Piensa en los datos de tu vista como la [fuente de datos](glossary://source%20of%20truth) que determina cómo debería aparecer tu [IU](glossary://user%20interface). En lugar de modificar la vista directamente, se modifican los datos y SwiftUI actualiza la vista por ti. Aquí, tus datos son un valor [booleano](glossary://Boolean) que determina si la vista se muestra (`true`) o se oculta (`false`).
es_419: Piensa en los datos de tu visualización como la [fuente única de información](glossary://source%20of%20truth) que determina el aspecto de tu [interfaz de usuario](glossary://user%20interface). En lugar de modificar la visualización directamente, debes modificar los datos, y SwiftUI actualizará la visualización por ti. Aquí, tus datos son un valor [booleano](glossary://Boolean) que determina si la visualización se muestra (`true`) o se oculta (`false`).
fr: Considère les données de ta vue comme la [source de vérité](glossary://source%20of%20truth) qui détermine de quelle manière ton [interface utilisateur](glossary://user%20interface) doit apparaître. Plutôt que de modifier la vue directement, tu modifies les données et SwiftUI met la vue à jour pour toi. Dans ce cas, tes données sont une valeur [booléenne](glossary://Boolean) qui détermine si la vue s’affiche (`true`) ou disparaît (`false`).
it: Prova a pensare ai dati della tua vista come alla [sorgente univoca](glossary://source%20of%20truth) che determina l'aspetto dell'[interfaccia utente](glossary://user%20interface). Invece di modificare direttamente la vista, modifichi i dati e SwiftUI aggiorna la vista al posto tuo. In questo caso, il tuoi dati corrispondono a un valore [booleano](glossary://Boolean) che determina se la vista viene visualizzata (`true`) o se viene nascosta (`false`).
nl: Je kunt de gegevens in je weergave zien als de [bron van waarheid](glossary://source%20of%20truth) die bepaalt hoe je [gebruikersinterface](glossary://user%20interface) eruit moet zien. In plaats van de weergave rechtstreeks te wijzigen, wijzig je de gegevens waarna SwiftUI de weergave voor je bijwerkt. In dit geval bestaan je gegevens uit een [Booleaanse](glossary://Boolean) waarde die bepaalt of de weergave zichtbaar is (`true`) of onzichtbaar (`false`).
no: Tenk på dataene i visningen som [sannhetskilden](glossary://source%20of%20truth) som bestemmer hvordan [brukergrensesnittet](glossary://user%20interface) skal vises. I stedet for å endre visningen direkte kan du endre disse dataene, slik at SwiftUI oppdaterer visningen for deg. Her er dataene en [boolsk](glossary://Boolean) verdi som bestemmer om visningen vises (`true`) eller skjules (`false`).
pt: Considere os dados na visualização como sendo a [fonte da verdade](glossary://source%20of%20truth) que determina o visual da [IU](glossary://user%20interface). Em vez de modificar diretamente a visualização, você modifica os dados e a SwiftUI atualiza a visualização para você. Aqui, os dados são um simples valor [Booleano](glossary://Boolean) que determina se a visualização está sendo mostrada (`true`) ou ocultada (`false`).
sv: Tänk på data i vyn som [sanningskällan](glossary://source%20of%20truth) som avgör hur ditt [UI](glossary://user%20interface) ska visas. Istället för att ändra vyn direkt kan du ändra dessa data så att SwiftUI uppdaterar vyn åt dig. Här är data ett [booleskt](glossary://Boolean) värde som avgör ifall vyn visas (`true`) eller göms (`false`).
th: ให้คิดว่าข้อมูลในมุมมองของคุณเป็น[แหล่งข้อมูลจริง](glossary://source%20of%20truth)ที่กำหนดว่า [UI](glossary://user%20interface) ของคุณควรแสดงอย่างไร โดยแทนที่จะแก้ไขมุมมองโดยตรง คุณจะแก้ไขข้อมูลและ SwiftUI จะอัปเดตมุมมองให้กับคุณ ในส่วนนี้ ข้อมูลของคุณเป็นเพียงค่า[บูลีน](glossary://Boolean)อย่างง่ายที่กำหนดว่ามุมมองกำลังแสดง (`true`) หรือซ่อน (`false`) อยู่
tr: Görüntündeki verileri [kullanıcı arayüzünün](glossary://user%20interface) nasıl görünmesi gerektiğini belirleyen [gerçeklik kaynağı](glossary://source%20of%20truth) olarak düşün. Görüntüyü doğrudan değiştirmek yerine veriyi değiştir, SwiftUI senin için görüntüyü günceller. Burada, verilerin görüntünün gösteriliyor (`true`) veya gizleniyor (`false`) olduğunu belirleyen bir [Boole](glossary://Boolean) değeridir.
vi: Hãy coi dữ liệu trong chế độ xem của bạn là [nguồn chân lý](glossary://source%20of%20truth) xác định cách [UI](glossary://user%20interface) của bạn xuất hiện. Thay vì sửa đổi trực tiếp chế độ xem, bạn sửa đổi dữ liệu và SwiftUI cập nhật chế độ xem cho bạn. Tại đây, dữ liệu của bạn là một giá trị [Boolean](glossary://Boolean) xác định xem chế độ xem đang hiển thị (`true`) hay đang ẩn (`false`).
zh_cn: 将视图中的数据想象成决定 [UI](glossary://user%20interface) 应当如何出现的[可信源](glossary://source%20of%20truth)。你修改数据后，SwiftUI 会为你更新视图，而不是由你直接修改视图。在这里，你的数据是一个[布尔值](glossary://Boolean)，决定视图是显示 (`true`) 还是隐藏 (`false`)。
zh_tw: 將你顯示區中的資料視為[真實來源](glossary://source%20of%20truth)，它決定了你的 [UI](glossary://user%20interface) 應該如何顯示。你無需直接修改顯示區，而是修改資料，SwiftUI 將為你更新顯示區。在這裡，你的資料是一個[布林](glossary://Boolean)值，用來決定顯示區是顯示（`true`）還是隱藏（`false`）。
