Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Ensure that the view accessing the data is part of the same [view hierarchy](glossary://view%20hierarchy) as the top-level view it’s passed into. You add a view to the view hierarchy by initializing it within the [top-level view](glossary://top-level%20view) or any of its [subviews](glossary://subview).
de: Stelle sicher, dass die Ansicht, die auf die Daten zugreift, zur selben [Ansichtenhierarchie](glossary://view%20hierarchy) wie die oberste Ansicht gehört, in die die Daten übergeben werden. Du fügst eine Ansicht zur Ansichtenhierarchie hinzu, indem du sie in der [obersten Ansicht](glossary://top-level%20view) oder in einer ihrer [Unteransichten](glossary://subview) initialisierst.
es: Asegúrate de que la vista que accede a los datos forma parte de la misma [jerarquía de vistas](glossary://view%20hierarchy) que la vista de nivel superior a la que se pasa. La vista se añade a la jerarquía de vistas inicializándola dentro de la [vista de nivel superior](glossary://top-level%20view) o de cualquiera de sus [vistas secundarias](glossary://subview).
es_419: Asegúrate de que la visualización que accede a los datos forma parte de la misma [jerarquía de visualizaciones](glossary://view%20hierarchy) que la visualización principal a la que se pasa. Para agregar una visualización a la jerarquía de visualizaciones, inicialízala dentro de la [visualización principal](glossary://top-level%20view) o de cualquiera de sus [subvisualizaciones](glossary://subview).
fr: Assure-toi que la vue qui accède aux données fait partie de la même [hiérarchie de vue](glossary://view%20hierarchy) que la vue au plus haut niveau à laquelle elle est transmise. Tu ajoutes une vue à la hiérarchie de vue en initialisant la [vue au plus haut niveau](glossary://top-level%20view) ou l’une de ses [sous-vues](glossary://subview).
it: Assicurati che la vista che accede ai dati faccia parte della stessa [gerarchia di viste](glossary://view%20hierarchy) a cui appartiene la vista di livello superiore in cui viene trasmessa. Puoi aggiungere una vista alla gerarchia di viste inizializzandola all'interno della [vista di livello superiore](glossary://top-level%20view) o di una delle sue [viste secondarie](glossary://subview).
nl: Zorg dat de weergave die toegang heeft tot de gegevens deel uitmaakt van dezelfde [weergavehiërarchie](glossary://view%20hierarchy) als de weergave op het hoogste niveau waaraan de weergave met toegang tot de gegevens wordt doorgegeven. Je voegt een weergave toe aan de weergavehiërarchie door de weergave te initialiseren in de [weergave op het hoogste niveau](glossary://top-level%20view) of een van de [subweergaven](glossary://subview) daarvan.
no: Sørg for at visningen som skal ha tilgang til dataene, finnes i samme [visningshierarki](glossary://view%20hierarchy) som toppnivåvisningen den overføres til. Du legger til en visning i visningshierarkiet ved å initiere den inni [toppnivåvisningen](glossary://top-level%20view) eller en av dens [delvisninger](glossary://subview).
pt: Certifique-se de que a visualização que acessa os dados faça parte da mesma [hierarquia de visualização](glossary://view%20hierarchy) da visualização de nível superior para a qual foi passada. Para adicionar uma visualização à hierarquia de visualização, inicialize‑a dentro da [visualização de nível superior](glossary://top-level%20view) ou de qualquer de suas [subvisualizações](glossary://subview).
sv: Se till att vyn som ska komma åt data finns i samma [vyhierarki](glossary://view%20hierarchy) som den översta nivån den överförs till. Du lägger till en vy i vyhierarkin genom att initiera den inuti [vyn på översta nivån](glossary://top-level%20view) eller någon av dess [delvyer](glossary://subview).
th: ตรวจสอบให้แน่ใจว่ามุมมองที่เข้าถึงข้อมูลเป็นส่วนหนึ่งของ[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)เดียวกันกับมุมมองระดับบนสุดที่ส่งผ่านเข้าไป คุณเพิ่มมุมมองไปยังลำดับชั้นมุมมองโดยสร้างค่าเริ่มต้นให้กับมุมมองนั้นภายใน[มุมมองระดับบนสุด](glossary://top-level%20view)หรือ[มุมมองย่อย](glossary://subview)ใดๆ ของมุมมองระดับบนสุดนั้น
tr: Verilere erişen görüntünün geçirildiği üst düzey görüntü ile aynı [görüntü hiyerarşisinin](glossary://view%20hierarchy) bir parçası olduğundan emin ol. [Üst düzey görüntünün](glossary://top-level%20view) veya [alt görüntülerinden](glossary://subview) herhangi birinin içinde ona ilk değer atayarak görüntü hiyerarşisine görüntü eklersin.
vi: Đảm bảo rằng chế độ xem đang truy cập dữ liệu là một phần của cùng một [phân cấp xem](glossary://view%20hierarchy) giống như chế độ xem cấp cao nhất mà dữ liệu được chuyển vào. Bạn thêm một chế độ xem vào phân cấp xem bằng cách khởi tạo bên trong [chế độ xem cấp cao nhất](glossary://top-level%20view) hoặc bất kỳ [chế độ xem phụ](glossary://subview) nào.
zh_cn: 确保访问数据的视图与它传入到的顶层视图属于同一个[视图层次](glossary://view%20hierarchy)。你可以在[顶层视图](glossary://top-level%20view)或它的任何[子视图](glossary://subview)内初始化视图，来将它添加到视图层次。
zh_tw: 確定取用資料顯示區與傳入的最上層顯示區屬於同一個[顯示區階層](glossary://view%20hierarchy)。你可以透過在[最上層顯示區](glossary://top-level%20view)或其任何[子顯示區](glossary://subview)中初始化顯示區來將顯示區加入顯示區階層中。

source: Access the [environment object](glossary://environment%20object).
de: Greife auf das [Umgebungsobjekt](glossary://environment%20object) zu.
es: Accede al [objeto de entorno](glossary://environment%20object).
es_419: Accede al [objeto de entorno](glossary://environment%20object).
fr: Accède à l’[objet d’environnement](glossary://environment%20object).
it: Accedi all'[oggetto ambiente](glossary://environment%20object).
nl: Verschaf toegang tot het [omgevingsobject](glossary://environment%20object).
no: Koble til [miljøobjektet](glossary://environment%20object).
pt: Acesse o [objeto de ambiente](glossary://environment%20object).
sv: Anslut till [miljöobjektet](glossary://environment%20object).
th: เข้าถึง[วัตถุสภาพแวดล้อม](glossary://environment%20object)
tr: [Ortam nesnesine](glossary://environment%20object) erişim sağla.
vi: Truy cập [đối tượng môi trường](glossary://environment%20object).
zh_cn: 访问[环境对象](glossary://environment%20object)。
zh_tw: 取用[環境物件](glossary://environment%20object)。

source: For example, if you create a new view inside `ContentView`, that new view is part of the view hierarchy since `ContentView` is a subview of your top-level view, `NavigationStack`. You can then access the environment object from that new view.
de: Wenn du zum Beispiel eine neue Ansicht in `ContentView` erstellst, dann ist diese Ansicht Teil der Ansichtenhierarchie, da `ContentView` eine Unteransicht der obersten Ansicht `NavigationStack` ist. Du kannst dann auf das Umgebungsobjekt der neuer Ansicht zugreifen.
es: Por ejemplo, si creas una nueva vista dentro de la vista de contenido (`ContentView`), esa nueva vista forma parte de la jerarquía de vistas, ya que la vista de contenido (`ContentView`) es una vista secundaria de la vista de nivel superior, `NavigationStack`. Entonces, puedes acceder al objeto de entorno desde esa nueva vista.
es_419: Por ejemplo, si creas una nueva visualización dentro de `ContentView`, esta formará parte de la jerarquía de visualizaciones, ya que `ContentView` es una subvisualización de tu visualización principal, `NavigationStack`. Así podrás acceder al objeto de entorno desde la visualización nueva.
fr: Par exemple, si tu crées une nouvelle vue à l’intérieur de `ContentView`, cette nouvelle vue fait partie de la hiérarchie de vue puisque `ContentView` est une sous-vue de ta vue au plus haut niveau, `NavigationStack`. Tu peux ensuite accéder à l’objet d’environnement à partir de cette nouvelle vue.
it: Ad esempio, se crei una nuova vista all'interno di `ContentView`, questa nuova vista farà parte della gerarchia di viste poiché `ContentView` è una vista secondaria della tua vista di livello superiore `NavigationStack`. Quindi saresti in grado di accedere all'oggetto ambiente dalla nuova vista.
nl: Stel dat je een nieuwe weergave in `ContentView` aanmaakt. Die nieuwe weergave wordt dan onderdeel van de weergavehiërarchie omdat `ContentView` een subweergave is van de weergave op het hoogste niveau `NavigationStack`. Het omgevingsobject is vervolgens toegankelijk vanuit die nieuwe weergave.
no: La oss si at du for eksempel oppretter en ny visning inni `ContentView`. Den nye visningen inngår da i visningshierarkiet siden `ContentView` er en delvisning av toppnivåvisningen `NavigationStack`. Du kan deretter få tilgang til miljøobjektet fra den nye visningen.
pt: Por exemplo, se você criar uma nova visualização dentro de `ContentView`, essa nova visualização fará parte da hierarquia de visualização, já que `ContentView` é uma subvisualização da visualização de nível superior, `NavigationStack`. Depois, você poderá acessar o objeto de ambiente a partir dessa nova visualização.
sv: Säg att du exempelvis skapar en ny vy inuti `ContentView`. Den nya vyn ingår då i vyhierarkin eftersom `ContentView` är en delvy av `NavigationStack` som är vyn på översta nivån. Du kan sedan komma åt miljöobjektet från den nya vyn.
th: ตัวอย่างเช่น ถ้าคุณสร้างมุมมองใหม่ภายใน `ContentView` มุมมองใหม่นั้นจะเป็นส่วนหนึ่งของลำดับชั้นมุมมองเนื่องจาก `ContentView` เป็นมุมมองย่อยของมุมมองระดับบนสุดของคุณ นั่นคือ `NavigationStack` จากนั้นคุณจึงสามารถเข้าถึงวัตถุสภาพแวดล้อมจากมุมมองใหม่นั้นได้
tr: Örneğin `ContentView`’un içinde yeni bir görüntü yaratıyorsan `ContentView`, üst düzey görüntün olan `NavigationStack`’in alt görüntüsü olduğundan bu yeni görüntü, görüntü hiyerarşisinin bir parçası olur. Böylece bu yeni görüntüden ortam nesnesine erişebilirsin.
vi: Ví dụ: nếu bạn tạo ra một chế độ xem mới bên trong `ContentView` thì chế độ xem mới đó là một phần của phân cấp xem, vì `ContentView` là một chế độ xem phụ của chế độ xem cấp cao nhất của bạn, `NavigationStack`. Sau đó, bạn có thể truy cập đối tượng môi trường từ chế độ xem mới đó.
zh_cn: 例如，假设你在 `ContentView` 内创建了一个新视图，这个新视图会成为视图层次的一部分，因为 `ContentView` 是顶层视图 `NavigationStack` 的子菜单。你之后可以从这个新视图访问环境对象。
zh_tw: 例如，若你在 `ContentView` 內製作了一個新的顯示區，這個新顯示區將成為顯示區階層的一部分，因為 `ContentView` 是你的最上層顯示區 `NavigationStack` 的子顯示區。之後，你可以從新的顯示區取用環境物件。

source: Declare the environment object
de: Umgebungsobjekt deklarieren
es: Declarar el objeto de entorno
es_419: Declarar el objeto de entorno
fr: Déclarer l’objet d’environnement
it: Dichiarare l'oggetto ambiente
nl: Het omgevingsobject declareren
no: Deklarer miljøobjektet
pt: Declare o objeto de ambiente
sv: Deklarera miljöobjektet
th: ประกาศวัตถุสภาพแวดล้อม
tr: Ortam nesnesini bildirme
vi: Khai báo đối tượng môi trường
zh_cn: 声明环境对象
zh_tw: 宣告環境物件

source: Your goal is to build a new view, `DancingCreatures`, that accesses the data in the app [environment](glossary://environment).
de: Dein Ziel ist es, die neue Ansicht `DancingCreatures` (tanzende Charaktere) zu erstellen, die auf die Daten in der App-[Umgebung](glossary://environment) zugreift.
es: Tu objetivo es crear una nueva vista, `DancingCreatures`, que acceda a los datos en el [entorno](glossary://environment) de la app.
es_419: Tu objetivo es crear un nueva visualización, llamada `DancingCreatures`, que acceda a los datos disponibles en el [entorno](glossary://environment) de la app.
fr: Ton objectif est de créer une nouvelle vue, `DancingCreatures`, qui accède aux données dans l’[environnement](glossary://environment) de l’app.
it: Il tuo obiettivo è costruire una nuova vista chiamata `DancingCreatures`, in grado di accedere ai dati nell'[ambiente](glossary://environment) dell'app.
nl: Je doel is om een nieuwe weergave, `DancingCreatures`, te maken die toegang heeft tot de gegevens in de app[omgeving](glossary://environment).
no: Målet ditt er å bygge den nye visningen `DancingCreatures`, som kobles til dataene i appens [miljø](glossary://environment).
pt: Seu objetivo é criar uma nova visualização, `DancingCreatures`, que acesse os dados no [ambiente](glossary://environment) do app.
sv: Ditt mål är att bygga den nya vyn `DancingCreatures` som ansluter till data i appens [miljö](glossary://environment).
th: เป้าหมายของคุณคือการสร้างมุมมองใหม่ `DancingCreatures` ที่เข้าถึงข้อมูลใน[สภาพแวดล้อม](glossary://environment)ของแอป
tr: Hedefin, uygulama [ortamındaki](glossary://environment) verilere erişen `DancingCreatures` adlı yeni bir görüntü oluşturmaktır.
vi: Mục tiêu của bạn là xây dựng một chế độ xem mới, `DancingCreatures`, truy cập dữ liệu trong [môi trường](glossary://environment) ứng dụng.
zh_cn: 你的目标是构建一个新的视图 `DancingCreatures`（跳舞的动物），它会访问 App [环境](glossary://environment)中的数据。
zh_tw: 你的目標是建構出一個新的顯示區 `DancingCreatures`，它會取用 App [環境](glossary://environment)中的資料。

source: `DancingCreatures` is already part of your [view hierarchy](glossary://view%20hierarchy); you added a link to it in `ContentView`. Your next step is to access the data in the app environment.
de: `DancingCreatures` ist bereits Bestandteil der [Ansichtenhierarchie](glossary://view%20hierarchy), da du schon einen Link dorthin in `ContentView` eingefügt hast. Im nächsten Schritt greifst du auf die Daten in der App-Umgebung zu.
es: `DancingCreatures` ya forma parte de la [jerarquía de vistas](glossary://view%20hierarchy): has añadido un enlace a ella en la vista de contenido (`ContentView`). El siguiente paso es acceder a los datos en el entorno de la app.
es_419: La visualización `DancingCreatures` ya forma parte de tu [jerarquía de visualizaciones](glossary://view%20hierarchy), dado que en `ContentView` agregaste un enlace que la conecta. Tu siguiente paso es acceder a los datos en el entorno de la app.
fr: `DancingCreatures` fait déjà partie de ta [hiérarchie de vue](glossary://view%20hierarchy) ; tu as ajouté un lien vers cette vue dans `ContentView`. Ton étape suivante consiste à accéder aux données dans l’environnement de l’app.
it: `DancingCreatures` fa già parte della tua [gerarchia di viste](glossary://view%20hierarchy), poiché hai aggiunto un link a essa in `ContentView`. Il prossimo passo è accedere ai dati nell'ambiente dell'app.
nl: `DancingCreatures` maakt al deel uit van de [weergavehiërarchie](glossary://view%20hierarchy); je hebt een link toegevoegd in `ContentView` die ernaar verwijst. In de volgende stap ga je de gegevens in de appomgeving toegankelijk maken.
no: `DancingCreatures` inngår allerede i [visningshierarkiet](glossary://view%20hierarchy) siden du la til en lenke til den i `ContentView`. Neste trinn er å få tilgang til dataene i appmiljøet.
pt: `DancingCreatures` já faz parte da [hierarquia de visualização](glossary://view%20hierarchy); você adicionou um link para ela em `ContentView`. O próximo passo é acessar os dados no ambiente do app.
sv: `DancingCreatures` ingår redan i [vyhierarkin](glossary://view%20hierarchy) eftersom du lade till en länk till den i `ContentView`. Nästa steg är att komma åt data i appmiljön.
th: `DancingCreatures` เป็นส่วนหนึ่งของ[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)ของคุณแล้วเพราะคุณได้เพิ่มลิงก์ไปยังที่นั่นใน `ContentView` ขั้นตอนถัดไปของคุณคือการเข้าถึงข้อมูลในสภาพแวดล้อมแอป
tr: `DancingCreatures` zaten [görüntü hiyerarşinin](glossary://view%20hierarchy) bir parçası; `ContentView`'da buna bir bağlantı ekledin. Sonraki adımın, uygulama ortamında bu verilere erişmek.
vi: `DancingCreatures` đã là một phần trong [phân cấp xem](glossary://view%20hierarchy) của bạn; bạn đã thêm một liên kết đến chế độ xem đó trong `ContentView`. Bước tiếp theo của bạn là truy cập dữ liệu trong môi trường ứng dụng.
zh_cn: `DancingCreatures` 已经是[视图层次](glossary://view%20hierarchy)的一部分了；你在 `ContentView` 中添加了它的链接。下一步就是访问 App 环境中的数据了。
zh_tw: `DancingCreatures` 已經是[顯示區階層](glossary://view%20hierarchy)的一部分，你在 `ContentView` 中加入了指向它的連結。你的下一步就是取用 App 環境中的資料。

source: To access the data in the app environment, declare your environment object for `CreatureZoo`, just like you did in `CreatureList`. It’s OK to look back at your other code if you need help.
de: Um auf die Daten in der App-Umgebung zuzugreifen, deklariere das Umgebungsobjekt für `CreatureZoo`, wie du das schon für `CreatureList` getan hast. Schau dir deinen Code noch mal an, wenn du Hilfe brauchst.
es: Para acceder a los datos del entorno de la app, declara el objeto de entorno para `CreatureZoo` al igual que hiciste en `CreatureList`. Si necesitas ayuda, puedes revisar tu otro código.
es_419: Para acceder a los datos del entorno de la app, declara tu objeto de entorno para `CreatureZoo` de la misma manera que en `CreatureList`. Si necesitas ayuda, revisa tu código anterior.
fr: Pour accéder aux données dans l’environnement de l’app, déclare ton objet d’environnement pour `CreatureZoo`, comme tu l’as fait dans `CreatureList`. Tu peux revoir le reste de ton code si tu as besoin d’aide.
it: Per farlo, dichiara l'oggetto ambiente per `CreatureZoo` proprio come hai fatto in `CreatureList`. Se ti serve aiuto, prova a consultare il codice che hai scritto in precedenza.
nl: Om de gegevens in de appomgeving toegankelijk te maken, moet je het omgevingsobject voor `CreatureZoo` declareren, net als je in `CreatureList` hebt gedaan. Het is prima om je eerdere code nog eens te bekijken als je hulp nodig hebt.
no: Du får tilgang til dataene i appmiljøet ved å deklarere miljøobjektet for `CreatureZoo`, akkurat som du gjorde i `CreatureList`. Ta en titt på den andre koden din hvis du trenger hjelp.
pt: Para acessar os dados no ambiente do app, declare o objeto de ambiente de `CreatureZoo` como você fez em `CreatureList`. Não há nenhum problema em consultar o outro código se você precisar de ajuda.
sv: Du kommer åt data i appmiljön genom att deklarera ditt miljöobjekt för `CreatureZoo` precis som du gjorde i `CreatureList`. Ta en titt på din andra kod ifall du behöver hjälp.
th: ในการเข้าถึงข้อมูลในสภาพแวดล้อมแอป ให้ประกาศวัตถุสภาพแวดล้อมของคุณสำหรับ `CreatureZoo` เช่นเดียวกับที่คุณทำใน `CreatureList` คุณสามารถย้อนกลับไปดูโค้ดอื่นๆ ของคุณหากคุณต้องการความช่วยเหลือ
tr: Uygulama ortamındaki verilere erişmek amacıyla tıpkı `CreatureList`’te yaptığın gibi `CreatureZoo` için ortam nesneni bildir. Yardıma ihtiyacın olursa diğer koduna dönüp bakabilirsin.
vi: Để truy cập dữ liệu trong môi trường ứng dụng, hãy khai báo đối tượng môi trường của bạn cho `CreatureZoo`, giống như cách bạn thực hiện trong `CreatureList`. Bạn có thể xem lại mã khác của mình nếu cần trợ giúp.
zh_cn: 若要访问 App 环境中的数据，为 `CreatureZoo` 声明环境对象，就像你在 `CreatureList` 中做的一样。如需帮助，可以回顾一下其他代码。
zh_tw: 若要取用 App 環境中的資料，請宣告 `CreatureZoo` 的環境物件，就像你在 `CreatureList` 中所做的一樣。如果需要協助，請回去看一下之前的其他程式碼。

source: [Declare](glossary://declaration) a variable using the `@EnvironmentObject` property wrapper and give it a type of `CreatureZoo`. You don’t need to [initialize](glossary://initialization) the value, because it’s already initialized in `MyApp`. You only need to access the data here.
de: [Deklariere](glossary://declaration) eine Variable mit dem Eigenschaftswrapper `@EnvironmentObject` und gib ihr einen Typ von `CreatureZoo`. Du musst den Wert nicht [initialisieren](glossary://initialization), da er schon in `MyApp` initialisiert wurde. Hier greifst du nur auf die Daten zu.
es: [Declara](glossary://declaration) una variable usando el contenedor de propiedades `@EnvironmentObject` y dale un tipo de `CreatureZoo`. No necesitas [inicializar](glossary://initialization) el valor porque ya se ha inicializado en `MyApp`. Aquí solamente necesitas acceder a los datos.
es_419: [Declara](glossary://declaration) una variable utilizando el contenedor de propiedades `@EnvironmentObject` y asígnale un tipo de `CreatureZoo`. No necesitas [inicializar](glossary://initialization) el valor, porque esto ya se hizo en `MyApp`. En esta ocasión, sólo necesitas acceder a los datos.
fr: [Déclare](glossary://declaration) une variable à l’aide du wrapper de propriété `@EnvironmentObject` et attribue-lui un type `CreatureZoo`. Tu n’as pas besoin d’[initialiser](glossary://initialization) la valeur, car elle est déjà initialisée dans `MyApp`. Tu as simplement besoin d’accéder aux données ici.
it: [Dichiara](glossary://declaration) una variabile utilizzando il wrapper di proprietà `@EnvironmentObject` e assegnale un tipo di `CreatureZoo`. Non hai bisogno di [inizializzare](glossary://initialization) il valore, perché è già stato inizializzato in `MyApp`. In questa fase ti serve solo accedere ai dati.
nl: [Declareer](glossary://declaration) een variabele met de eigenschapwrapper `@EnvironmentObject` en ken er een type van `CreatureZoo` aan toe. Je hoeft de waarde niet te [initialiseren](glossary://initialization) omdat deze al is geïnitialiseerd in `MyApp`. Het gaat hier alleen om toegang tot de gegevens.
no: [Deklarer](glossary://declaration) en variabel med egenskapsinnpakningen `@EnvironmentObject`, og gi den typen `CreatureZoo`. Du trenger ikke å [initialisere](glossary://initialization) verdien siden den allerede er initialisert i `MyApp`. Du trenger bare tilgang til dataene her.
pt: [Declare](glossary://declaration) uma variável com o empacotador de propriedade `@EnvironmentObject` e atribua um tipo de `CreatureZoo`. Você não precisa [inicializar](glossary://initialization) o valor porque ele já está inicializado em `MyApp`. Você precisa apenas acessar os dados contidos aqui.
sv: [Deklarera](glossary://declaration) en variabel med egenskapspaketeraren `@EnvironmentObject` och ge den typen `CreatureZoo`. Du behöver inte [initiera](glossary://initialization) värdet eftersom det redan har initierats i `MyApp`. Du behöver bara komma åt data här.
th: [ประกาศ](glossary://declaration)ตัวแปรโดยใช้ตัวหุ้มคุณสมบัติ `@EnvironmentObject` และให้ประเภทเป็น `CreatureZoo` คุณไม่จำเป็นต้อง[สร้างค่าเริ่มต้น](glossary://initialization) ให้กับค่า เนื่องจากมีการสร้างค่าเริ่มต้นให้กับค่าแล้วใน `MyApp` คุณเพียงต้องเข้าถึงข้อมูลที่นี่เท่านั้น
tr: `@EnvironmentObject` özellik sarmalayıcıyı kullanarak bir değişken [bildir](glossary://declaration) ve ona `CreatureZoo` tipini ver. `MyApp`’te daha önce ilk değer atandığı için değere [ilk değer ataman](glossary://initialization) gerekmez. Burada yalnızca veriye erişmen gerekir.
vi: [Khai báo](glossary://declaration) một biến bằng trình đóng gói thuộc tính `@EnvironmentObject` và cung cấp cho biến đó kiểu `CreatureZoo`. Bạn không cần [khởi tạo](glossary://initialization) giá trị vì giá trị đó đã được khởi tạo trong `MyApp`. Bạn chỉ cần truy cập dữ liệu tại đây.
zh_cn: 使用 `@EnvironmentObject` 属性包装器[声明](glossary://declaration)一个变量，再给它赋予 `CreatureZoo` 的类型。你不需要[初始化](glossary://initialization)这个值，因为它已经在 `MyApp` 中完成了初始化。你只需要在这里访问这些数据。
zh_tw: 使用 `@EnvironmentObject` 屬性包覆來[宣告](glossary://declaration)變數，並為其指定 `CreatureZoo` 的類型。你不需要[初始化](glossary://initialization)這個值，因為它已經在 `MyApp` 中初始化。你只需要在此處取用資料。

source: Add a `DancingCreatures` view
de: Ansicht `DancingCreatures` hinzufügen
es: Añadir una vista `DancingCreatures`
es_419: Agregar una visualización `DancingCreatures`
fr: Ajouter une vue `DancingCreatures`
it: Aggiungere una vista `DancingCreatures`
nl: Een `DancingCreatures`-weergave toevoegen
no: Legg til en `DancingCreatures`-visning
pt: Adicione uma visualização `DancingCreatures`
sv: Lägg till en `DancingCreatures`-vy
th: เพิ่มมุมมอง `DancingCreatures`
tr: `DancingCreatures` görüntüsü ekleme
vi: Thêm một chế độ xem `DancingCreatures`
zh_cn: 添加 `DancingCreatures` 视图
zh_tw: 加入一個 `DancingCreatures` 顯示區
