Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepUsing a Conditional Modifier..SuccessMessage..Paragraph64
source: Next, you’ll learn how to use SwiftUI [built-in views](glossary://built-in%20view) and [bindings](glossary://binding) to create different types of state changes in your UI.
de: Als Nächstes lernst du, wie du die [integrierten Ansichten](glossary://built-in%20view) von SwiftUI und [Bindungen](glossary://binding) verwendest, um verschiedene Typen von Statusänderungen in der Benutzeroberfläche zu erstellen.
es: A continuación, aprenderás a usar las [vistas integradas](glossary://built-in%20view) y las [vinculaciones](glossary://binding) de SwiftUI para crear diferentes tipos de cambios de estado en tu IU.
es_419: A continuación, aprenderás a usar las [visualizaciones integradas](glossary://built-in%20view) y [ligaduras](glossary://binding) de SwiftUI para crear diferentes tipos de cambios de estado en tu interfaz.
fr: Ensuite, tu vas découvrir comment utiliser les [vues intégrées](glossary://built-in%20view) et les [associations](glossary://binding) de SwiftUI pour créer différents types de modifications d’état dans ton interface utilisateur.
it: Nella prossima attività, imparerai a usare le [viste integrate](glossary://built-in%20view) di SwiftUI e i [vincoli](glossary://binding) per creare diversi tipi di cambiamenti di stato nella tua interfaccia utente.
nl: Nu ga je leren hoe je [ingebouwde weergaven](glossary://built-in%20view) van SwiftUI en [bindings](glossary://binding) gebruikt om verschillende typen van statuswijzigingen in de gebruikersinterface aan te maken.
no: Nå skal du lære hvordan du bruker SwiftUIs [innebygde visninger](glossary://built-in%20view) og [bindinger](glossary://binding) til å lage forskjellige typer statusendringer i brukergrensesnittet.
pt: A seguir, você aprenderá a usar [visualizações integradas](glossary://built-in%20view) da SwiftUI e [vínculos](glossary://binding) para criar tipos diferentes de mudanças de estado na IU.
sv: Härnäst lär du dig att använda SwiftUI:s [inbyggda vyer](glossary://built-in%20view) och [kopplingar](glossary://binding) till att skapa olika typer av statusändringar i UI:t.
th: ถัดไป คุณจะได้เรียนรู้วิธีใช้[มุมมองในตัว](glossary://built-in%20view)และ[การรวม](glossary://binding)ของ SwiftUI เพื่อสร้างการเปลี่ยนแปลงสถานะประเภทต่างๆ ใน UI ของคุณ
tr: Sonra, kullanıcı arayüzünde farklı türlerde durum değişiklikleri yaratmak için SwiftUI [yerleşik görüntülerini](glossary://built-in%20view) ve [bağlamalarını](glossary://binding) nasıl kullanacağını öğreneceksin.
vi: Tiếp theo, bạn sẽ học cách sử dụng các [chế độ xem tích hợp](glossary://built-in%20view) và [ràng buộc](glossary://binding) của SwiftUI để tạo ra các kiểu thay đổi trạng thái khác nhau trong UI của bạn.
zh_cn: 下一步，你将学习如何使用 SwiftUI [内建视图](glossary://built-in%20view)和[绑定](glossary://binding)，以在 UI 中创建不同类型的状态更改。
zh_tw: 接下來，你將學習如何使用 SwiftUI [內建顯示區](glossary://built-in%20view)和[綁定](glossary://binding)來在你的 UI 中建立不同類型的狀態更動。

# GuideBook..Guide0..StepSwiftUI Built-in Views..title
source: SwiftUI Built-in Views
de: Integrierte SwiftUI-Ansichten
es: Vistas integradas de SwiftUI
es_419: Visualizaciones integradas de SwiftUI
fr: Vues intégrées de SwiftUI
it: Viste integrate di SwiftUI
nl: Ingebouwde SwiftUI-weergaven
no: Innebygde SwiftUI-visninger
pt: Visualizações Integradas da SwiftUI
sv: Inbyggda SwiftUI-vyer
th: มุมมอง SwiftUI ในตัว
tr: SwiftUI Yerleşik Görüntüleri
vi: Các chế độ xem tích hợp của SwiftUI
zh_cn: SwiftUI 内建视图
zh_tw: SwiftUI 內建顯示區

source: SwiftUI provides many [built-in views](glossary://built-in%20view), such as sliders, toggles, and pickers, that enable someone to change the state of app data by [interacting](glossary://user%20interaction) with them.
de: SwiftUI bietet viele [integrierte Ansichten](glossary://built-in%20view), wie z. B. Schieberegler, Ein-/Ausschalter und Auswahlmöglichkeiten. Mit diesen Ansichten können Benutzer:innen den Status von App-Daten ändern, indem sie mit ihnen [interagieren](glossary://user%20interaction).
es: SwiftUI proporciona muchas [vistas integradas](glossary://built-in%20view), como reguladores, interruptores para activar/desactivar y selectores que permiten a alguien cambiar el estado de los datos de la misma [interactuando](glossary://user%20interaction) con ellos.
es_419: SwiftUI ofrece muchas [visualizaciones integradas](glossary://built-in%20view), como reguladores, botones y selectores, que permiten que alguien cambie el estado de los datos de la app al [interactuar](glossary://user%20interaction) con estos.
fr: SwiftUI fournit de nombreuses [vues intégrées](glossary://built-in%20view), telles que des curseurs, des commutateurs et des sélecteurs, qui permettent à quelqu’un de modifier l’état des données de l’app en [interagissant](glossary://user%20interaction) avec elles.
it: SwiftUI offre molte [viste integrate](glossary://built-in%20view), come cursori, interruttori e selettori, che consentono di modificare lo stato dei dati dell'app [interagendo](glossary://user%20interaction) con essi.
nl: SwiftUI bevat een groot aantal [ingebouwde weergaven](glossary://built-in%20view), zoals schuifknoppen, schakelaars en kiezers, waarmee iemand de status van appgegevens kan wijzigen door [gebruikersinteractie](glossary://user%20interaction).
no: SwiftUI inneholder mange [innebygde visninger](glossary://built-in%20view), for eksempel skyveknapper, veksleknapper og velgere, som gjør det mulig for noen å endre statusen på appdata ved å [interagere](glossary://user%20interaction) med dem.
pt: A SwiftUI fornece várias [visualizações integradas](glossary://built-in%20view), como controles deslizantes, interruptores e seletores, que permitem a uma pessoa mudar o estado dos dados do app ao [interagir](glossary://user%20interaction) com eles.
sv: SwiftUI innehåller många [inbyggda vyer](glossary://built-in%20view), som dragreglage, växlare och väljare, som gör det möjligt för någon att ändra statusen för appdata genom att [interagera](glossary://user%20interaction) med dem.
th: SwiftUI มี[มุมมองในตัว](glossary://built-in%20view)หลายมุมมอง เช่น แถบเลื่อน ตัวสลับระหว่างเปิดหรือปิด และตัวเลือก ซึ่งทำให้คนสามารถเปลี่ยนสถานะของข้อมูลแอปได้โดย[การโต้ตอบ](glossary://user%20interaction)กับมุมมองเหล่านั้น
tr: SwiftUI, bir kişinin uygulama verilerinin durumunu onlarla [etkileşim kurarak](glossary://user%20interaction) değiştirmesini sağlayan sürgüler, açma/kapatmalar ve seçiciler gibi pek çok [yerleşik görüntü](glossary://built-in%20view) sunar.
vi: SwiftUI cung cấp nhiều [chế độ xem tích hợp](glossary://built-in%20view), ví dụ như thanh trượt, nút chuyển đổi và bộ chọn cho phép một người thay đổi trạng thái của dữ liệu ứng dụng bằng cách [tương tác](glossary://user%20interaction) với chúng.
zh_cn: SwiftUI 提供许多[内建视图](glossary://built-in%20view)，如滑块、开关和选择器，可让用户通过与这些视图[交互](glossary://user%20interaction)来更改 App 数据的状态。
zh_tw: SwiftUI 提供了許多[內建顯示區](glossary://built-in%20view)，如滑桿、開關和選擇器；讓其他人可透過與其[互動](glossary://user%20interaction)來更改 App 資料的狀態。

source: These built-in views have a special way of sharing data with another view, called a [binding](glossary://binding).
de: Diese integrierten Ansichten können Daten auf spezielle Art und Weise mit anderen Ansichten teilen. Dieses Verfahren nennt sich [Bindung](glossary://binding).
es: Estas vistas integradas tienen una forma especial de compartir datos con otra vista, llamada [vinculación](glossary://binding).
es_419: Estas visualizaciones integradas tienen una manera especial de compartir datos con otras visualizaciones, este proceso genera una [ligadura](glossary://binding).
fr: Ces vues intégrées présentent une manière particulière de partager des données avec une autre vue, qui s’appelle une [association](glossary://binding).
it: Queste viste integrate hanno un modo particolare di condividere i dati con altre viste, chiamato [vincolo](glossary://binding).
nl: Deze ingebouwde weergaven gebruiken een zogenaamde [binding](glossary://binding) om gegevens met een andere weergave te delen.
no: Disse innebygde visningene deler data med andre visninger på en spesiell måte som kalles for en [binding](glossary://binding).
pt: Essas visualizações integradas têm uma maneira especial de compartilhar dados com outra visualização, chamada [vínculo](glossary://binding).
sv: De här inbyggda vyerna delar data med andra vyer på ett särskilt sätt som kallas för en [koppling](glossary://binding).
th: มุมมองในตัวเหล่านี้มีวิธีพิเศษในการแชร์ข้อมูลกับมุมมองอื่น ซึ่งเรียกว่า[การรวม](glossary://binding)
tr: Bu yerleşik görüntülerin, verileri başka bir görüntüyle paylaşmak için [bağlama](glossary://binding) adı verilen özel bir yolu vardır.
vi: Những chế độ xem tích hợp này có một cách đặc biệt để chia sẻ dữ liệu với một chế độ xem khác, được gọi là một [ràng buộc](glossary://binding).
zh_cn: 这些内建视图通过一种特殊的方式与其他视图共享数据，称为[绑定](glossary://binding)。
zh_tw: 這些內建顯示區具有與另一個顯示區共享資料的特殊方式，稱為[綁定](glossary://binding)。

source: You can use these built-in views with binding values to change your app’s data, and in turn, your app’s UI.
de: Du kannst diese integrierten Ansichten mit gebundenen Werten verwenden, um die Daten der App zu ändern – und somit auch die Benutzeroberfläche der App.
es: Puedes usar estas vistas integradas con valores de vinculación para cambiar los datos de tu app y, a su vez, la IU de tu app.
es_419: Puedes usar estas visualizaciones integradas con valores de ligadura para cambiar los datos de tu app y, consecuentemente, la interfaz de tu app.
fr: Tu peux utiliser ces vues intégrées avec des valeurs d’association pour modifier les données de ton app et, à son tour, l’interface utilisateur de ton app.
it: Puoi utilizzare queste viste integrate con valori vincolanti per modificare i dati e, di conseguenza, l'interfaccia utente della tua app.
nl: Je kunt in deze ingebouwde weergaven bindingswaarden gebruiken om de gegevens van je app te wijzigen en zo de gebruikersinterface van de app aan te passen.
no: Du kan bruke disse innebygde visningene med bindingsverdier til å endre appdataene og dermed også appens brukergrensesnitt.
pt: Você pode usar essas visualizações integradas com valores vinculados para alterar os dados do app e, por sua vez, a IU do app.
sv: Du kan använda de inbyggda vyerna med kopplingsvärden till att ändra appdata och i förlängningen även appens UI.
th: คุณสามารถใช้มุมมองในตัวเหล่านี้ที่มีค่าการรวมเพื่อเปลี่ยนแปลงข้อมูลของแอป และในขณะเดียวกันก็เปลี่ยนแปลง UI ของแอปด้วย
tr: Uygulamanın verilerini ve dolayısıyla uygulamanın kullanıcı arayüzünü değiştirmek için bağlama değerleri ile bu yerleşik görüntüleri kullanabilirsin.
vi: Bạn có thể sử dụng những chế độ xem tích hợp này với các giá trị ràng buộc để thay đổi dữ liệu của ứng dụng và sau đó UI của ứng dụng sẽ thay đổi.
zh_cn: 你可以使用这些内建视图及绑定值来更改 App 数据，进而更改 App 的 UI。
zh_tw: 你可以使用這些帶有綁定值的內建顯示區來更改 App 的資料，進而更改你的 App UI。

# GuideBook..Guide0..StepSwiftUI Built-in Views..TasktoggleExperiment..title
source: Use a binding
de: Bindung verwenden
es: Usar una vinculación
es_419: Usar una ligadura
fr: Utiliser une association
it: Utilizzare un vincolo
nl: Een binding gebruiken
no: Bruk en binding
pt: Use um vínculo
sv: Använd en koppling
th: ใช้การรวม
tr: Bağlama kullanma
vi: Sử dụng một ràng buộc
zh_cn: 使用绑定
zh_tw: 使用綁定

source: So far, you’ve used a state property to change your UI [locally](glossary://local%20scope), or within the same view. An example of this is defining a [state property](glossary://state%20property) in `ConditionalCircle`, and using it to change the appearance of a view in the [body](glossary://body) of `ConditionalCircle`.
de: Bisher hast du eine Statuseigenschaft verwendet, um die Benutzeroberfläche [lokal](glossary://local%20scope) oder innerhalb derselben Ansicht zu ändern. Ein Beispiel hierfür wäre, eine [Statuseigenschaft](glossary://state%20property) in `ConditionalCircle` zu definieren und sie zu verwenden, um das Erscheinungsbild einer Ansicht im [Hauptteil](glossary://body) von `ConditionalCircle` zu ändern.
es: Hasta ahora, has usado una propiedad de estado para cambiar tu IU [localmente](glossary://local%20scope) o dentro de la misma vista. Un ejemplo de esto es definir una [propiedad de estado](glossary://state%20property) en `ConditionalCircle` y usarla para cambiar la apariencia de una vista en el [cuerpo](glossary://body) de `ConditionalCircle`.
es_419: Hasta ahora, has usado una propiedad de estado para cambiar tu IU [localmente](glossary://local%20scope), o dentro de la misma visualización. Un ejemplo de ello es definir una [propiedad de estado](glossary://state%20property) en `ConditionalCircle`, y usarla para cambiar el aspecto de una visualización en el [cuerpo](glossary://body) de `ConditionalCircle`.
fr: Jusque là, tu as utilisé une propriété d’état pour modifier ton interface utilisateur [localement](glossary://local%20scope) ou au sein de la même vue. Par exemple, tu as défini une [propriété d’état](glossary://state%20property) dans `ConditionalCircle` et tu l’as utilisée pour modifier l’apparence d’une vue dans le [corps](glossary://body) de `ConditionalCircle`.
it: Fino ad ora, hai utilizzato una proprietà di stato per modificare la tua interfaccia utente [in locale](glossary://local%20scope) o all'interno della stessa vista. Ad esempio, hai definito una [proprietà di stato](glossary://state%20property) in `ConditionalCircle` e l'hai utilizzata per modificare l'aspetto di una vista nel [corpo](glossary://body) di `ConditionalCircle`.
nl: Tot nu toe heb je een statuseigenschap gebruikt om de gebruikersinterface [lokaal](glossary://local%20scope) te wijzigen (binnen dezelfde weergave). Een voorbeeld hiervan is het definiëren van een [statuseigenschap](glossary://state%20property) in `ConditionalCircle` en deze gebruiken om het uiterlijk van een weergave te wijzigen in de [body](glossary://body) van `ConditionalCircle`.
no: Så langt har du brukt en statusegenskap til å endre brukergrensesnittet [lokalt](glossary://local%20scope) eller innen samme visning. Et eksempel på dette er å definere en [statusegenskap](glossary://state%20property) i `ConditionalCircle` og bruke den til å endre utseendet på en visning i [visningsinnholdet](glossary://body) i `ConditionalCircle`.
pt: Até agora, você usou uma propriedade de estado para mudar a IU [localmente](glossary://local%20scope) ou dentro da mesma visualização. Um exemplo disso é definir uma [propriedade de estado](glossary://state%20property) em `ConditionalCircle` e usá-la para mudar a aparência de uma visualização no [corpo](glossary://body) de `ConditionalCircle`.
sv: Hittills har du använt en statusegenskap till att ändra UI:t [lokalt](glossary://local%20scope) eller inom samma vy. Ett exempel på det här är att definiera en [statusegenskap](glossary://state%20property) i `ConditionalCircle` och använda den till att ändra utseendet på en vy i [bodyn](glossary://body) i `ConditionalCircle`.
th: ที่ผ่านมา คุณได้ใช้คุณสมบัติสถานะเพื่อเปลี่ยนแปลง UI [ภายใน](glossary://local%20scope) หรือภายในมุมมองเดียวกัน หนึ่งตัวอย่างในเรื่องนี้คือการกำหนด[คุณสมบัติสถานะ](glossary://state%20property)ใน `ConditionalCircle` และใช้คุณสมบัตินั้นเพื่อเปลี่ยนรูปแบบของมุมมองใน[เนื้อหา](glossary://body)ของ `ConditionalCircle`
tr: Şimdiye kadar, kullanıcı arayüzünü [yerel olarak](glossary://local%20scope) ya da aynı görüntü içinde değiştirmek için bir durum özelliği kullandın. Bunun bir örneği, `ConditionalCircle`'da bir [durum özelliği](glossary://state%20property) tanımlamak ve bunu `ConditionalCircle` [gövdesinde](glossary://body) bir görüntünün görünüşünü değiştirmek için kullanmaktır.
vi: Đến nay, bạn đã sử dụng một thuộc tính trạng thái để thay đổi UI [cục bộ](glossary://local%20scope) hoặc bên trong cùng một chế độ xem. Một ví dụ của việc này là định nghĩa một [thuộc tính trạng thái](glossary://state%20property) trong `ConditionalCircle` và sử dụng thuộc tính đó để thay đổi giao diện của một chế độ xem trong [phần thân](glossary://body) của `ConditionalCircle`.
zh_cn: 到目前为止，你已使用状态属性在[本地](glossary://local%20scope)或同一个视图内更改了 UI。例如，在 `ConditionalCircle`（条件圆圈）中定义一个[状态属性](glossary://state%20property)，然后用它来更改 `ConditionalCircle` [主体](glossary://body)中视图的外观。
zh_tw: 到目前為止，你已經使用狀態屬性在[區域](glossary://local%20scope)或在同一顯示區中更改了 UI。這方面的範例是在 `ConditionalCircle` 中定義一個[狀態屬性](glossary://state%20property)，並用它來更改 `ConditionalCircle` 的[主體](glossary://body)中的顯示區外觀。

source: But what if you want to allow a [subview](glossary://subview) to change that data? For instance, if your [local](glossary://local%20scope) view stores your contact information, the subview could provide a custom [interaction](glossary://user%20interaction) for you to change the phone number of the contact. But how can you allow the subview to change the data without creating more than one [source of truth](glossary://source%20of%20truth)?
de: Aber was ist, wenn du einer [Unteransicht](glossary://subview) erlauben möchtest, diese Daten zu ändern? Wenn beispielsweise die [lokale](glossary://local%20scope) Ansicht deine Kontaktinformationen speichert, könnte die Unteransicht eine eigene [Interaktion](glossary://user%20interaction) für dich bereitstellen, um die Telefonnummer des Kontakts zu ändern. Doch wie kannst du der Unteransicht das Ändern von Daten ermöglichen, ohne mehrere [Wahrheitsquellen](glossary://source%20of%20truth) zu erstellen?
es: ¿Pero qué pasa si quieres permitir que una [vista secundaria](glossary://subview) cambie esos datos? Por ejemplo, si tu vista [local](glossary://local%20scope) guarda tu información de contacto, la vista secundaria podría proporcionar una [interacción](glossary://user%20interaction) personalizada para que cambies el número de teléfono del contacto. Pero ¿cómo puedes permitir que la vista secundaria cambie los datos sin crear más de una [fuente de datos](glossary://source%20of%20truth)?
es_419: ¿Y si quieres permitir que una [subvisualización](glossary://subview) modifique esos datos? Por ejemplo, si tu visualización [local](glossary://local%20scope) almacena tu información de contacto, la subvisualización podría proporcionar una [interacción](glossary://user%20interaction) personalizada para que cambies el número telefónico del contacto. Pero, ¿cómo puedes permitir que la subvisualización modifique los datos sin crear más de una [fuente de la verdad](glossary://source%20of%20truth)?
fr: Et si tu voulais autoriser une [sous-vue](glossary://subview) à modifier ces données ? Par exemple, si ta vue [locale](glossary://local%20scope) stocke tes coordonnées, la sous-vue pourrait fournir une [interaction](glossary://user%20interaction) personnalisée pour que tu puisses modifier le numéro de téléphone du contact. Mais comment peux-tu autoriser la sous-vue à modifier les données sans créer plusieurs [sources de vérité](glossary://source%20of%20truth) ?
it: E se volessi consentire a una [vista secondaria](glossary://subview) di cambiare i dati? Ad esempio, se le tue informazioni di contatto fossero salvate nella vista [locale](glossary://local%20scope), la vista secondaria potrebbe offrire un'[interazione](glossary://user%20interaction) personalizzata per consentirti di modificare il numero del contatto. Come puoi consentire alla vista secondaria di modificare i dati senza creare più di una [sorgente univoca](glossary://source%20of%20truth)?
nl: Maar wat als je wilt dat een [subweergave](glossary://subview) die gegevens kan veranderen? Als bijvoorbeeld je contactgegevens in je [lokale](glossary://local%20scope) weergave zijn opgeslagen en je wilt dat de subweergave een aangepaste [interactie](glossary://user%20interaction) kan aanmaken waarmee je het telefoonnummer van een contactpersoon kunt wijzigen. Maar hoe zorg je dat de subweergave de gegevens kan wijzigen zonder meer dan één [bron van waarheid](glossary://source%20of%20truth) aan te maken?
no: Men hva gjør du hvis du vil la en [delvisning](glossary://subview) endre disse dataene? Hvis den [lokale](glossary://local%20scope) visningen for eksempel lagrer kontaktinformasjonen din, kan delvisningen lage en tilpasset [interaksjon](glossary://user%20interaction) der du kan endre telefonnummeret til en kontakt. Men hvordan kan du la delvisningen endre dataene uten å lage mer enn én [sannhetskilde](glossary://source%20of%20truth)?
pt: Mas, e se você quiser permitir que uma [subvisualização](glossary://subview) mude os dados? Por exemplo, se a sua visualização [local](glossary://local%20scope) armazena suas informações de contato, a subvisualização pode fornecer uma [interação](glossary://user%20interaction) personalizada para mudar o número de telefone do contato. Mas como você poderia permitir que a subvisualização mude os dados sem criar mais de uma [fonte da verdade](glossary://source%20of%20truth)?
sv: Men vad gör du ifall du vill låta en [delvy](glossary://subview) ändra dessa data? Om den [lokala](glossary://local%20scope) vyn exempelvis lagrar dina kontaktuppgifter skulle delvyn kunna skapa en anpassad [interaktion](glossary://user%20interaction) där du kan ändra telefonnumret till en kontakt. Men hur kan du låta delvyn ändra data utan att skapa fler än en [sanningskälla](glossary://source%20of%20truth)?
th: แต่ถ้าคุณต้องการอนุญาตให้[มุมมองย่อย](glossary://subview)เปลี่ยนแปลงข้อมูลนั้นล่ะ ตัวอย่างเช่น ถ้ามุมมอง[ภายใน](glossary://local%20scope)จัดเก็บข้อมูลติดต่อของคุณ มุมมองย่อยอาจให้[การโต้ตอบ](glossary://user%20interaction)แบบกำหนดเองกับคุณเพื่อเปลี่ยนแปลงเบอร์โทรศัพท์ของผู้ติดต่อ แต่คุณจะอนุญาตให้มุมมองย่อยเปลี่ยนแปลงข้อมูลโดยไม่สร้าง[แหล่งข้อมูลจริง](glossary://source%20of%20truth)มากกว่าหนึ่งแหล่งได้อย่างไร
tr: Peki ya bir [alt görüntünün](glossary://subview) bu veriyi değiştirmesine izin vermek istiyorsan ne olacak? Örneğin, [yerel](glossary://local%20scope) görüntün kişi bilgilerini saklıyorsa, alt görüntü kişinin telefon numarasını değiştirmen için özel bir [etkileşim](glossary://user%20interaction) sağlayabilir. Birden fazla [gerçeklik kaynağı](glossary://source%20of%20truth) yaratmadan alt görüntünün veriyi değiştirmesine nasıl izin verebilirsin?
vi: Nhưng nếu bạn muốn cho phép một [chế độ xem phụ](glossary://subview) thay đổi dữ liệu đó thì sao? Ví dụ: nếu chế độ xem [cục bộ](glossary://local%20scope) lưu trữ thông tin liên hệ của bạn thì chế độ xem phụ có thể cung cấp một [tương tác](glossary://user%20interaction) tùy chỉnh để bạn thay đổi số điện thoại của liên hệ. Nhưng làm cách nào để bạn cho phép chế độ xem phụ thay đổi dữ liệu mà không tạo ra nhiều [nguồn chân lý](glossary://source%20of%20truth)?
zh_cn: 但如果你想要允许[子视图](glossary://subview)更改这个数据呢？例如，如果你的[本地](glossary://local%20scope)视图储存了联系信息，子视图可能会提供更改联系人电话号码的自定[交互](glossary://user%20interaction)。你要怎么做，才能让子视图更改数据，而不创建一个以上的[可信源](glossary://source%20of%20truth)呢？
zh_tw: 但是，如果你想允許[子顯示區](glossary://subview)更改該資料要怎麼做？例如，如果你的[區域](glossary://local%20scope)顯示區儲存了你的聯絡資訊，則子顯示區可以為你提供自定的[互動](glossary://user%20interaction)來更改聯絡人的電話號碼。但是，要如何允許子顯示區更改資料而不製作多個[真實來源](glossary://source%20of%20truth)呢？
