Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: [Padding](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) and [spacers](doc://com.apple.documentation/documentation/swiftui/spacer) allow you to create adaptive view layouts that make your view look good across a variety of screen sizes. Check out [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) to learn more.
de: Mit [Randabständen](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) und [Abstandshaltern](doc://com.apple.documentation/documentation/swiftui/spacer) kannst du anpassungsfähige Layouts für Ansichten erstellen, mit denen sie auf verschiedenen Displaygrößen gut aussehen. Weitere Infos findest du im Abschnitt zum Erstellen von einfachen Ansichten unter [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
es: El [relleno](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) y los [separadores](doc://com.apple.documentation/documentation/swiftui/spacer) te permiten crear disposiciones de vista adaptables para que tu vista se vea bien en distintos tamaños de pantalla. Consulta [Disponer una visualización sencilla](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) para obtener más información.
es_419: Los modificadores [relleno](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) y [espaciadores](doc://com.apple.documentation/documentation/swiftui/spacer) te permiten crear disposiciones de visualización adaptables que se ven bien en una variedad de tamaños de pantalla. Consulta [Organizar una visualización simple](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) para obtener más información.
fr: Le [remplissage](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) et les [espaceurs](doc://com.apple.documentation/documentation/swiftui/spacer) te permettent de créer des dispositions de vue adaptatives qui permettent à ta vue de s’afficher correctement sur une variété de tailles d’écran. Consulte [Disposition d’une vue simple](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) pour en savoir plus.
it: La [spaziatura interna](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) e gli [spaziatori](doc://com.apple.documentation/documentation/swiftui/spacer) ti consentono di creare layout delle viste adattivi, in modo che la tua vista sia in grado di adattarsi a varie misure dello schermo e di essere visualizzata sempre correttamente. Per saperne di più, dai un'occhiata all'articolo [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view), che ti illustra come creare il layout di una vista semplice.
nl: Met [padding](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) en [spacers](doc://com.apple.documentation/documentation/swiftui/spacer) kun je adaptieve weergavelay-outs aanmaken waarmee je weergave er op verschillende schermformaten goed uitziet. Raadpleeg [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) voor meer informatie.
no: Med [Padding](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) og [spacers](doc://com.apple.documentation/documentation/swiftui/spacer) kan du lage tilpasningsdyktige visningslayouter som sørger for at visningene ser bra ut på skjermer i flere forskjellige størrelser. Ta en titt på [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) hvis du vil vite mer.
pt: [Preenchimento](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) e [espaçadores](doc://com.apple.documentation/documentation/swiftui/spacer) permitem criar layout de visualização adaptáveis que fazem sua visualização aparecer corretamente em diversos tamanhos de tela. Confira [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) para saber mais.
sv: Med [Padding](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) och [spacers](doc://com.apple.documentation/documentation/swiftui/spacer) kan du skapa adaptiva layouter som ser till att vyerna ser bra ut på skärmar i många olika storlekar. Ta en titt på [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) om du vill läsa mer.
th: [การขยายขอบ](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:))และ[ที่ว่าง](doc://com.apple.documentation/documentation/swiftui/spacer)ช่วยให้คุณสร้างเค้าโครงมุมมองแบบปรับได้ที่ทำให้มุมมองของคุณดูดีบนหน้าจอขนาดต่างๆ ลองดู[การวางเค้าโครงมุมมองอย่างง่าย](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view)เพื่อเรียนรู้เพิ่มเติม
tr: [Boşluk](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) ve [aralayıcılar](doc://com.apple.documentation/documentation/swiftui/spacer) görüntünün çeşitli ekran boyutları genelinde iyi görünmesini sağlayan uyarlanabilir görüntü yerleşimleri yaratmana izin verir. Daha fazla bilgi edinmek için [Basit Görüntü Yerleştirme](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) bölümüne bak.
vi: [Phần đệm](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:)) và [ký tự khoảng trống](doc://com.apple.documentation/documentation/swiftui/spacer) cho phép bạn tạo ra các bố cục chế độ xem thích ứng làm cho chế độ xem của bạn phù hợp với nhiều kích cỡ màn hình. Hãy xem [Tạo bố cục một chế độ xem đơn giản](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) để tìm hiểu thêm.
zh_cn: [Padding](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:))（填补）和 [spacers](doc://com.apple.documentation/documentation/swiftui/spacer)（留白器）可让你创建自适应视图布局，让视图在不同的屏幕尺寸上看起来都很美观。参阅 [Laying Out a Simple View](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view)（布局一个简单的视图）来进一步了解。
zh_tw: [填充](doc://com.apple.documentation/documentation/swiftui/view/padding(_:_:))和[墊片](doc://com.apple.documentation/documentation/swiftui/spacer)能讓你製作適應性的顯示區佈局，讓你的顯示區在各種螢幕尺寸上看起來都不錯。請查看[佈局簡單顯示區](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view)以瞭解更多資訊。

# GuideBook..Guide0..StepSwiftUI Built-in Views..SuccessMessage..Paragraph93
source: Bravo!
it: Ottimo lavoro!
th: ไชโย!
vi: Hoan hô!
zh_cn: 好极了！
zh_tw: 太棒了！

# GuideBook..Guide0..StepSwiftUI Built-in Views..SuccessMessage..Paragraph94
source: You now know how to use a built-in SwiftUI view, such as a `ColorPicker`, along with a [binding](glossary://binding) to create custom [interactions](glossary://user%20interaction) for changing your app state.
de: Du hast gelernt, wie du eine integrierte SwiftUI-Ansicht wie `ColorPicker` zusammen mit einer [Bindung](glossary://binding) verwendest, um eigene [Interaktionen](glossary://user%20interaction) zum Ändern des App-Status zu erstellen.
es: Ahora ya sabes cómo usar una vista integrada en SwiftUI, como una vista `ColorPicker`, junto con una [vinculación](glossary://binding) para crear [interacciones](glossary://user%20interaction) personalizadas para cambiar el estado de tu app.
es_419: Ahora sabes cómo usar una visualización integrada de SwiftUI, como `ColorPicker`, junto con una [ligadura](glossary://binding) para crear [interacciones](glossary://user%20interaction) personalizadas que permiten cambiar el estado de tu app.
fr: Tu sais désormais comment utiliser une vue SwiftUI intégrée, telle qu’un `ColorPicker`, avec une [association](glossary://binding) pour créer des [interactions](glossary://user%20interaction) personnalisées afin de modifier l’état de ton app.
it: Hai imparato a usare una vista integrata in SwiftUI, come `ColorPicker`, insieme a un [vincolo](glossary://binding) per creare [interazioni personalizzate](glossary://user%20interaction) e modificare lo stato della tua app.
nl: Je weet nu hoe je een ingebouwde SwiftUI-weergave, zoals een `ColorPicker`, samen met een [binding](glossary://binding) gebruikt om aangepaste [interacties](glossary://user%20interaction) aan te maken voor het wijzigen van je appgegevens.
no: Nå kan du bruke en innebygd SwiftUI-visning, for eksempel en `ColorPicker`, sammen med en [binding](glossary://binding) for å opprette tilpassede [interaksjoner](glossary://user%20interaction) som endrer appstatusen.
pt: Agora você sabe usar uma visualização integrada da SwiftUI, como um `ColorPicker` (seletor de cores) junto com um [vínculo](glossary://binding) para criar [interações](glossary://user%20interaction) personalizadas para mudar o estado do seu app.
sv: Nu kan du använda en inbyggd SwiftUI-vy, som en `ColorPicker`, tillsammans med en [koppling](glossary://binding) för att skapa anpassade [interaktioner](glossary://user%20interaction) som ändrar appstatusen.
th: ตอนนี้คุณก็รู้วิธีใช้มุมมอง SwiftUI ในตัว เช่น `ColorPicker` และ[การรวม](glossary://binding)เพื่อสร้าง[การโต้ตอบ](glossary://user%20interaction)แบบกำหนดเองเพื่อเปลี่ยนสถานะของแอปของคุณแล้ว
tr: Artık, uygulama durumunu değiştirmek üzere özel [etkileşimler](glossary://user%20interaction) yaratmak için bir [bağlamanın](glossary://binding) yanı sıra `ColorPicker` gibi yerleşik bir SwiftUI görüntüsünü nasıl kullanacağını biliyorsun.
vi: Bây giờ bạn đã biết cách sử dụng chế độ xem SwiftUI tích hợp, ví dụ như một `ColorPicker`, cùng với một [ràng buộc](glossary://binding) để tạo ra các [tương tác](glossary://user%20interaction) tùy chỉnh để thay đổi trạng thái ứng dụng của bạn.
zh_cn: 现在你知道了如何使用 SwiftUI 内建视图（如 `ColorPicker`）和[绑定](glossary://binding)来创建更改 App 状态的自定[交互](glossary://user%20interaction)。
zh_tw: 你現在知道如何使用內建的 SwiftUI 顯示區（如 `ColorPicker`）和[綁定](glossary://binding)來建立自訂的[互動](glossary://user%20interaction)，以更改你的 App 狀態。

# GuideBook..Guide0..StepSwiftUI Built-in Views..SuccessMessage..Paragraph95
source: Together with your knowledge on [state properties](glossary://state%20property), this allows you to create rich user interactions that change the appearance of your app’s UI.
de: Zusammen mit deinen Kenntnissen über [Statuseigenschaften](glossary://state%20property) kannst du umfangreiche Benutzerinteraktionen erstellen, die das Erscheinungsbild der App-Benutzeroberfläche verändern.
es: Junto con tus conocimientos sobre las [propiedades del estado](glossary://state%20property), esto te permite crear sofisticadas interacciones con el usuario que cambian la apariencia de la IU de tu app.
es_419: Junto con lo que sabes sobre las [propiedades de estado](glossary://state%20property), esto te permite crear interacciones de usuario más completas para cambiar el aspecto de la interfaz de tu app.
fr: Avec tes connaissances sur les [propriétés d’état](glossary://state%20property), cela te permet de créer des interactions utilisateur riches qui changent l’apparence de l’interface utilisateur de ton app.
it: Questi concetti, combinati alla tua conoscenza delle [proprietà di stato](glossary://state%20property), ti consentiranno di creare ricche interazioni utente che modificheranno l'aspetto dell'interfaccia utente della tua app.
nl: Samen met je kennis over [statuseigenschappen](glossary://state%20property) kun je hiermee uitgebreide gebruikersinteracties aanmaken waarmee je het uiterlijk van de gebruikersinterface van je app kunt aanpassen.
no: Sammen med kunnskapene dine om [statusegenskaper](glossary://state%20property) kan du opprette avanserte brukerinteraksjoner som endrer utseendet på appens brukergrensesnitt.
pt: Junto com o seu conhecimento de [propriedades de estado](glossary://state%20property), isso permite que você crie interações de usuário mais interessantes que alteram a aparência da IU do app.
sv: I kombination med dina kunskaper om [statusegenskaper](glossary://state%20property) kan du skapa avancerade användarinteraktioner som ändrar utseende på appens UI.
th: เมื่อรวมกับความรู้ของคุณในเรื่อง[คุณสมบัติสถานะ](glossary://state%20property) คุณก็สามารถสร้างการโต้ตอบของผู้ใช้ที่หลากหลายที่เปลี่ยนแปลงรูปแบบของ UI ของแอปได้
tr: [Durum özellikleri](glossary://state%20property) bilginle birlikte, bu, uygulamanın kullanıcı arayüzü görünüşünü değiştiren zengin kullanıcı etkileşimleri yaratmana izin verir.
vi: Cùng với kiến thức của bạn về các [thuộc tính trạng thái](glossary://state%20property), phần này cho phép bạn tạo ra các tương tác của người dùng phong phú thay đổi hình thức UI trong ứng dụng của bạn.
zh_cn: 结合学到的[状态属性](glossary://state%20property)相关知识，你可以创建丰富的用户交互来更改 App UI 的外观。
zh_tw: 結合你對[狀態屬性](glossary://state%20property)的知識，可讓你建立豐富的使用者互動，進而更改 App UI 的外觀。

# GuideBook..Guide0..StepPractice with SwiftUI Built-in Views..title
source: Practice with SwiftUI Built-in Views
de: Mit integrierten SwiftUI-Ansichten üben
es: Practicar con las vistas integradas de SwiftUI
es_419: Practicar con las visualizaciones integradas de SwiftUI
fr: S’entraîner avec les vues intégrées de SwiftUI
it: Esercitati con le viste integrate di SwiftUI
nl: Oefenen met de ingebouwde SwiftUI-weergaven
no: Øv med SwiftUIs innebygde visninger
pt: Pratique com Visualizações Integradas da SwiftUI
sv: Öva med SwiftUI:s inbyggda vyer
th: ฝึกฝนกับมุมมองในตัว SwiftUI
tr: SwiftUI Yerleşik Görüntülerini İle Deneme Yapma
vi: Thực hành với các chế độ xem tích hợp của SwiftUI
zh_cn: 练习 SwiftUI 内建视图
zh_tw: 使用 SwiftUI 內建顯示區來練習

source: Now that you know the basics of state properties, bindings, and built-in SwiftUI views, its time to build some examples by yourself.
de: Da du jetzt die Grundlagen von Statuseigenschaften, Bindungen und integrierten SwiftUI-Ansichten kennst, ist es an der Zeit, einige Beispiele selbst zu bauen.
es: Ahora que ya conoces los aspectos básicos de las propiedades de estado, las vinculaciones y las vistas integradas de SwiftUI, es hora de crear tus propios ejemplos.
es_419: Ahora que conoces los principios básicos de las propiedades de estado, las ligaduras y las visualizaciones integradas de SwiftUI, te toca construir algunos ejemplos por tu cuenta.
fr: Maintenant que tu connais les principes fondamentaux des propriétés d’état, des associations et des vues SwiftUI intégrées, il est temps de construire quelques exemples par toi-même.
it: Ora che hai imparato le basi delle proprietà di stato, dei vincoli e delle viste integrate in SwiftUI, è arrivato il momento cimentarti nella programmazione di alcuni esempi autonomamente.
nl: Nu je de basisbeginselen van statuseigenschappen, bindingen en ingebouwde SwiftUI-weergaven kent, is het tijd om zelf een aantal voorbeelden te gaan bouwen.
no: Nå når du kan det grunnleggende om statusegenskaper, bindinger og innebygde SwiftUI-visninger, er det på tide å bygge noen eksempler på egen hånd.
pt: Agora que você sabe o básico sobre propriedades de estado, vínculos e visualizações integradas de SwiftUI, é hora de criar alguns exemplos por sua conta.
sv: Nu när du kan grunderna om statusegenskaper, kopplingar och inbyggda SwiftUI-vyer är det dags att bygga några exempel på egen hand.
th: ตอนนี้เมื่อคุณรู้ข้อมูลพื้นฐานของคุณสมบัติสถานะ การรวม และมุมมอง SwiftUI ในตัวแล้ว ก็ถึงเวลาที่จะสร้างตัวอย่างด้วยตัวคุณเอง
tr: Artık durum özelliklerinin, bağlamaların ve yerleşik SwiftUI görüntülerinin temel bilgilerini öğrendiğine göre kendi kendine bazı örnekler oluşturmanın zamanı geldi.
vi: Bây giờ bạn đã biết các khái niệm cơ bản về các thuộc tính trạng thái, ràng buộc và chế độ xem SwiftUI tích hợp, đã đến lúc tự mình xây dựng một số ví dụ.
zh_cn: 既然你了解了状态属性、绑定和 SwiftUI 内建视图的基础知识，是时候自己构建一些示例了。
zh_tw: 現在你已經瞭解了狀態屬性、綁定和內建 SwiftUI 顯示區的基礎知識，是時候自己建構一些範例了。

source: First, you’ll use a built-in `Slider` view to change a [state property](glossary://state%20property) that controls the width of a `Rectangle`.
de: Verwende als Erstes die integrierte `Slider`-Ansicht, um die [Statuseigenschaft](glossary://state%20property) zu ändern, die die Breite des mit `Rectangle` erstellten Rechtecks ändert.
es: Primero, usarás una vista `Slider` integrada para cambiar una [propiedad de estado](glossary://state%20property) que controla la anchura de un rectángulo —`Rectangle`—.
es_419: Primero, usarás una visualización integrada `"Slider"` para cambiar una [propiedad de estado](glossary://state%20property) que controla el ancho de una figura `"Rectangle"`.
fr: Tout d’abord, tu vas utiliser une vue `Slider` intégrée pour modifier une [propriété d’état](glossary://state%20property) qui contrôle la largeur d’un `Rectangle`.
it: Per prima cosa utilizzerai la vista `Slider` per modificare la [proprietà di stato](glossary://state%20property) che controlla la larghezza di un `Rectangle`.
nl: Eerst ga je een ingebouwde `Slider`-weergave gebruiken om een [statuseigenschap](glossary://state%20property) te wijzigen die de breedte van een `Rectangle` bepaalt.
no: Først bruker du en innebygd `Slider`-visning til å endre en [statusegenskap](glossary://state%20property) som styrer bredden på en `Rectangle`.
pt: Primeiro, você vai usar uma visualização integrada `Slider` para mudar uma [propriedade de estado](glossary://state%20property) que controla a largura de um `Rectangle`.
sv: Först använder du en inbyggd `Slider`-vy till att ändra en [statusegenskap](glossary://state%20property) som styr bredden på en `Rectangle`.
th: ก่อนอื่น คุณจะได้ใช้มุมมอง `Slider` ในตัวเพื่อเปลี่ยนแปลง[คุณสมบัติสถานะ](glossary://state%20property)ที่ควบคุมความกว้างของ `Rectangle`
tr: Öncelikle, `Rectangle`’ın genişliğini denetleyen [durum özelliğini](glossary://state%20property) değiştirmek için bir `Slider` görüntüsü kullanacaksın.
vi: Trước tiên, bạn sẽ sử dụng một chế độ xem `Slider` tích hợp để thay đổi một [thuộc tính trạng thái](glossary://state%20property) điều khiển chiều rộng của một `Rectangle`.
zh_cn: 首先，你将使用内建 `Slider` 视图来更改控制 `Rectangle` 宽度的[状态属性](glossary://state%20property)。
zh_tw: 首先，你將使用一個內建的 `Slider` 顯示區來更改用來控制 `Rectangle` 寬度的[狀態屬性](glossary://state%20property)。

source: Then you’ll try creating a story editor using built-in `TextField` views to change the value of some `String` state property, resulting in an interesting narrative.
de: Erstelle dann einen Storyeditor mit den integrierten `TextField`-Ansichten, um den Wert von einigen `String`-Statuseigenschaften zu ändern, damit eine interessante Geschichte entsteht.
es: A continuación, probarás a crear un editor de historias utilizando las vistas incorporadas `TextField` para cambiar el valor de alguna propiedad de estado de `String`, dando lugar a una historia interesante.
es_419: A continuación, intenta crear un editor de historias con las visualizaciones integradas `TextField` para cambiar el valor de algunas propiedades de estado del tipo `String`, lo que dará lugar a una interesante narración.
fr: Ensuite, tu vas essayer de créer un éditeur d’histoire en utilisant des vues `TextField` intégrées pour modifier la valeur de la propriété d’état de `String`, ce qui donnera lieu à une narration intéressante.
it: Poi proverai a creare un editor di storie utilizzando le viste `TextField` integrate per modificare il valore di alcune proprietà di stato `String`, per dare vita a una narrativa interessante.
nl: Vervolgens ga je een verhaaleditor aanmaken met behulp van ingebouwde `TextField`-weergaven, om de waarde van een aantal `String`-statuseigenschappen te wijzigen waardoor een interessant verhaal ontstaat.
no: Deretter skal du prøve å lage en historieredigerer med innebygde `TextField`-visninger der du kan endre verdien for noen `String`-statusegenskaper og lage en interessant fortelling.
pt: Depois, você tentará criar um editor de história com as visualizações integradas `TextField` para mudar o valor de alguma propriedade de estado de `String`, o que resultará em uma narrativa interessante.
sv: Sedan ska du försöka skapa en berättelseredigerare med inbyggda `TextField`-vyer där du kan ändra värdet för en del `String`-statusegenskaper och skapa en intressant berättelse.
th: จากนั้นคุณจะได้ลองสร้างตัวแก้ไขเรื่องราวโดยใช้มุมมอง `TextField` ในตัวเพื่อเปลี่ยนค่าของคุณสมบัติสถานะ `String` บางอย่าง ส่งผลให้ได้เรื่องเล่าที่น่าสนใจ
tr: Sonra, ilginç bir anlatıyla sonuçlanan bazı `String` durum özelliklerinin değerini değiştirmek üzere yerleşik `TextField` görüntülerini kullanarak bir hikâye düzenleyici yaratmayı deneyeceksin.
vi: Sau đó, bạn sẽ thử tạo ra một trình sửa đổi câu chuyện bằng các chế độ xem `TextField` tích hợp để thay đổi giá trị của một thuộc tính trạng thái `String` nào đó, mang lại một câu chuyện kể thú vị.
zh_cn: 然后你将使用内建 `TextField`（文本栏）视图创建故事编辑器，以更改一些 `String` 状态属性的值，生成有趣的叙述。
zh_tw: 接下來，你將嘗試使用內建的 `TextField` 顯示區建立故事編輯器，以更改部分 `String` 狀態屬性的值，從而產生有趣的敘述。

source: Create a slider
de: Schieberegler erstellen
es: Crear un regulador
es_419: Crear un regulador
fr: Créer un curseur
it: Creare un cursore
nl: Een schuifknop aanmaken
no: Opprett en skyveknapp
pt: Crie um controle deslizante
sv: Skapa ett reglage
th: สร้างแถบเลื่อน
tr: Sürgü yaratma
vi: Tạo ra một thanh trượt
zh_cn: 创建滑块
zh_tw: 製作滑桿
