Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Your app `body` now looks like this:
de: Der `body`-Bereich deiner App sieht nun so aus:
es: Ahora, el cuerpo (`body`) de tu app es algo así:
es_419: El cuerpo `body` de tu app debería verse así:
fr: Le `body` de ton app ressemble désormais à ceci :
it: Il `body` dell'app adesso è così:
nl: De `body` van je app ziet er nu zo uit:
no: Appens `body` ser nå slik ut:
pt: O `body` do app ficou assim:
sv: Appens `body` ser nu ut så här:
th: ตอนนี้ `body` ของแอปของคุณมีลักษณะดังนี้:
tr: Artık uygulama gövden (`body`) şöyle görünür:
vi: Bây giờ, `body` ứng dụng của bạn trông giống như sau:
zh_cn: 你的 App `body` 现在看起来是这样：
zh_tw: 你的 App `body` 現在看起來像這樣：

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskaddNavTitle..title
source: Add a navigation title
de: Navigationstitel hinzufügen
es: Añadir un título de navegación
es_419: Agregar un título de navegación
fr: Ajouter un titre de navigation
it: Aggiungere un titolo di navigazione
nl: Een navigatietitel toevoegen
no: Legg til en navigeringstittel
pt: Adicione um título de navegação
sv: Lägg till en navigeringstitel
th: เพิ่มชื่อการนำทาง
tr: Dolaşma başlığı ekleme
vi: Thêm một tiêu đề điều hướng
zh_cn: 添加导航标题
zh_tw: 加入導覽標題

source: Run your app. It doesn’t look too different, does it? This is because the `NavigationStack` acts like a container to show its content by default.
de: Führe deine App aus. Es hat sich nicht viel geändert, oder? Das liegt daran, dass sich `NavigationStack` standardmäßig wie ein Container verhält, um die Inhalte anzuzeigen.
es: Ejecuta tu app. No se ve muy diferente, ¿verdad? Es porque la pila de navegación (`NavigationStack`), actúa como un contenedor que muestra su contenido por omisión.
es_419: Ejecuta tu app. No se ve muy diferente, ¿verdad? Esto se debe a que, de forma predeterminada, `NavigationStack` actúa como un contenedor para mostrar su contenido.
fr: Exécute ton app. Elle n’a pas l’air très différente, n’est-ce pas ? C’est parce que la `NavigationStack` agit comme un conteneur pour afficher son contenu par défaut.
it: Esegui l'app. Il suo aspetto non è molto cambiato, vero? Questo avviene perché la vista `NavigationStack` di default svolge la stessa funzione di un contenitore, che mostra ciò che contiene.
nl: Voer nu je app uit. Alles ziet er min of meer hetzelfde uit, vind je niet? Dit komt doordat de `NavigationStack` standaard alleen als een container functioneert voor het weergeven van de inhoud.
no: Kjør appen nå. Den ser ikke så annerledes ut, gjør den vel? Det er fordi `NavigationStack` fungerer som en beholder for å vise innholdet som standard.
pt: Execute o app. Ele não parece muito diferente, não é mesmo? Isso acontece porque o `NavigationStack` funciona como um contêiner para mostrar o conteúdo por padrão.
sv: Kör appen nu. Den ser inte så annorlunda ut, eller hur? Det beror på att `NavigationStack` fungerar som en behållare för att visa dess innehåll som förval.
th: ให้รันแอปของคุณ ซึ่งดูจะไม่แตกต่างมากนักใช่ไหม นี่เป็นเพราะ `NavigationStack` จะทำหน้าที่เหมือนกับคอนเทนเนอร์เพื่อแสดงเนื้อหาของตัวเองตามค่าเริ่มต้น
tr: Uygulamanı çalıştır. Pek farklı görünmüyor, değil mi? Bunun nedeni, `NavigationStack`’in saptanmış olarak içeriğini göstermek üzere bir kapsayıcı gibi davranmasıdır.
vi: Chạy ứng dụng của bạn. Trông ứng dụng không khác biệt nhiều phải không? Đó là vì `NavigationStack` đóng vai trò như một bộ chứa để hiển thị nội dung theo mặc định.
zh_cn: 运行你的 App。它看起来没有什么不同，对吧？这是因为 `NavigationStack` 默认只会像容器一样显示它的内容。
zh_tw: 執行你的 App。它看起來並沒有太大的不同，不是嗎？這是因為 `NavigationStack` 預設作為一個容器來顯示其內容。

source: However, a `NavigationStack` provides you with a dedicated space, known as a [navigation bar](glossary://navigation%20bar), that can show the title of the current view as well as display various toolbar items.
de: Allerdings stellt `NavigationStack` einen speziellen Bereich bereit, der als [Navigationsleiste](glossary://navigation%20bar) bezeichnet wird. Dort können der Titel der aktuellen Ansicht und verschiedene Elemente der Symbolleiste angezeigt werden.
es: Sin embargo, una pila de navegación (`NavigationStack`) te proporciona un espacio dedicado, conocido como [barra de navegación](glossary://navigation%20bar), que puede mostrar el título de la vista actual, además de mostrar varios elementos de la barra de herramientas.
es_419: Sin embargo, una pila `NavigationStack` te proporciona un espacio dedicado, conocido como [barra de navegación](glossary://navigation%20bar), que puede mostrar el título de la visualización actual, así como varios elementos de la barra de herramientas.
fr: Cependant, une `NavigationStack` te fournit un espace dédié, appelé une [barre de navigation](glossary://navigation%20bar), qui peut afficher le titre de la vue en cours, ainsi que différents éléments de la barre d’outils.
it: La vista `NavigationStack` ti offre uno spazio dedicato, chiamato [barra di navigazione](glossary://navigation%20bar), dove vengono mostrati il nome della vista attuale e i vari elementi della barra degli strumenti.
nl: Een `NavigationStack` bevat echter een speciaal gebied, de zogenaamde [navigatiebalk](glossary://navigation%20bar), waarin je de titel van de huidige weergave en verschillende knoppenbalkonderdelen kunt weergeven.
no: En `NavigationStack` gir deg derimot et dedikert rom, en såkalt [navigeringslinje](glossary://navigation%20bar), som kan vise tittelen på den aktuelle visningen i tillegg til diverse verktøylinjeobjekter.
pt: No entanto, um `NavigationStack` fornece um espaço dedicado, conhecido como [barra de navegação](glossary://navigation%20bar), que pode mostrar o título da visualização atual, assim como mostrar vários itens da barra de ferramentas.
sv: En `NavigationStack` ger dig däremot ett dedikerat utrymme, ett så kallat [navigeringsfält](glossary://navigation%20bar), som kan visa titeln för den aktuella vyn liksom olika verktygsfältsobjekt.
th: อย่างไรก็ตาม `NavigationStack` จะให้พื้นที่เฉพาะกับคุณที่เรียกว่า[แถบการนำทาง](glossary://navigation%20bar) ซึ่งสามารถแสดงชื่อของมุมมองปัจจุบันและแสดงรายการแถบเครื่องมือต่างๆ ได้
tr: Ancak `NavigationStack` sana [dolaşma çubuğu](glossary://navigation%20bar) olarak bilinen, şu anki görüntünün başlığını gösterebilen ve çeşitli araç çubuğu öğelerini görüntüleyebilen ayrılmış bir alan sağlar.
vi: Tuy nhiên, `NavigationStack` cung cấp cho bạn một không gian chuyên biệt, được gọi là [thanh điều hướng](glossary://navigation%20bar), có thể hiển thị tiêu đề của chế độ xem hiện tại cũng như hiển thị nhiều mục thanh công cụ.
zh_cn: 但是，`NavigationStack` 给你提供了一个专属空间，叫做[导航栏](glossary://navigation%20bar)，可显示当前视图的标题以及各种工具栏项目。
zh_tw: 但是，`NavigationStack` 為你提供了一個稱為[導覽列](glossary://navigation%20bar)的專用空間，可以顯示目前顯示區的標題和各種工具列項目。

source: Try adding `.navigationTitle("My Creatures")` as a modifier on `ContentView`.
de: Füge `.navigationTitle("Meine Charaktere")` als Modifikator von `ContentView` hinzu.
es: Prueba a añadir `.navigationTitle("Mis criaturas")` como modificador en la vista de contenido (`ContentView`).
es_419: Intenta agregar `".navigationTitle("Mis criaturas")"` como un modificador en `"ContentView"`.
fr: Essaie d’ajouter `.navigationTitle("Mes créatures")` en tant que modificateur sur `ContentView`.
it: Prova ad aggiungere `.navigationTitle("Le mie creature")` come modificatore in `ContentView`.
nl: Voeg `.navigationTitle("My Creatures")` toe als een modifier voor `ContentView`.
no: Prøv å legge til `.navigationTitle("Mine skapninger")` som en modifikator i `ContentView`.
pt: Experimente adicionar `.navigationTitle("My Creatures")` como um modificador em `ContentView`.
sv: Prova att lägga till `.navigationTitle("Mina varelser")` som en modifierare i `ContentView`.
th: ลองเพิ่ม `.navigationTitle("สิ่งมีชีวิตของฉัน")` เป็นปุ่มปรับค่าบน `ContentView`
tr: `.navigationTitle("My Creatures”)`’ı `ContentView`’da bir niteleyici olarak eklemeyi dene.
vi: Thử thêm `.navigationTitle("Các sinh vật của tôi")` làm trình sửa đổi trên `ContentView`.
zh_cn: 尝试将 `.navigationTitle("我的动物")` 添加为 `ContentView` 上的修饰符。
zh_tw: 嘗試在 `ContentView` 上加入 `.navigationTitle("My Creatures")` 作為修飾符。

source: This gives the view a title in the navigation bar area. You add the navigation title to each view inside your navigation view, as opposed to in the navigation view itself.
de: Dadurch ergänzt du die Ansicht mit einem Titel im Navigationsleistenbereich. Du fügst den Navigationstitel aber zu jeder Ansicht in der Navigationsansicht und nicht nur zur Navigationsansicht selbst hinzu.
es: Esto da a la vista un título en el área de la barra de navegación. El título de navegación se añade a cada vista dentro de la vista de navegación, en lugar de en la propia vista de navegación.
es_419: Esto le asigna un título a la visualización en la zona de la barra de navegación. Debes agregar el título de navegación a cada visualización dentro de `NavigationView`, y no en la visualización de navegación en sí.
fr: Cela donne un titre à la vue dans la zone de la barre de navigation. Tu ajoutes le titre de navigation à chaque vue à l’intérieur de la vue de navigation, plutôt que dans la vue de navigation elle-même.
it: Questo comando assegna un nome alla vista nell'area della barra di navigazione. Il titolo della navigazione viene aggiunto a ciascuna vista contenuta all'interno della tua vista di navigazione e non alla vista di navigazione stessa.
nl: Hiermee voeg je een titel toe aan het navigatiebalkgebied van de weergave. Je voegt de navigatietitel toe aan elke weergave in je navigatieweergave, en niet aan de navigatieweergave zelf.
no: Dette gir visningen en ny tittel i navigeringslinjeområdet. Du legger til navigeringstittelen i hver visning inni navigeringsvisningen og ikke i selve navigeringsvisningen.
pt: Isso dá à visualização um título na área da barra de navegação. Você adiciona o título de navegação a cada visualização dentro da visualização de navegação, em vez de adicioná‑lo na própria visualização de navegação.
sv: Det här ger vyn en titel i navigeringsfältsområdet. Du lägger till navigeringstiteln i varje vy inuti navigeringsvyn och inte i själva navigeringsvyn.
th: การทำเช่นนี้จะทำให้มุมมองมีชื่อในพื้นที่แถบการนำทาง ให้คุณเพิ่มชื่อการนำทางไปยังแต่ละมุมมองภายในมุมมองการนำทางของคุณ ไม่ใช่ในตัวมุมมองการนำทางเอง
tr: Bu, görüntüye dolaşma çubuğu alanında bir başlık verir. Dolaşma görüntüsünün kendisinin aksine dolaşma görüntüsünün içindeki her bir görüntüye dolaşma başlığı eklersin.
vi: Việc này cung cấp cho chế độ xem một tiêu đề trong khu vực thanh điều hướng. Bạn thêm tiêu đề điều hướng cho từng chế độ xem bên trong chế độ xem điều hướng, chứ không phải là chính chế độ xem điều hướng.
zh_cn: 这会在导航栏区域中给视图提供标题。与导航视图本身不同，你是给导航视图内的每个视图添加导航标题。
zh_tw: 這會在導覽列區域中為顯示區提供一個標題。你是將導覽標題加入到導覽顯示區中的每個顯示區，而不是導覽顯示區本身。

source: .navigationTitle("My Creatures")
de: .navigationTitle("Meine Charaktere")
es: .navigationTitle("Mis criaturas")
es_419: .navigationTitle("Mis criaturas")
fr: .navigationTitle("Mes créatures")
it: .navigationTitle("Le mie creature")
no: .navigationTitle("Mine skapninger")
sv: .navigationTitle("Mina varelser")
th: .navigationTitle("สิ่งมีชีวิตของฉัน")
tr: .navigationTitle("Yaratıklarım")
vi: .navigationTitle("Các sinh vật của tôi")
zh_cn: .navigationTitle("我的动物")

source: Notice how the navigation title displays in the navigation bar at the top of your `ContentView`? These titles help a person using your app understand the content they’re looking at.
de: Wie du siehst, wird der Navigationstitel in der Navigationsleiste oben in `ContentView` angezeigt. Diese Titel helfen Benutzer:innen der App, den betrachteten Inhalt besser zu verstehen.
es: ¿Te has fijado en cómo se muestra el título de navegación en la barra de navegación de la parte superior de tu vista de contenido (`ContentView`)? Estos títulos ayudan a una persona que use tu app a entender el contenido que están viendo mientras navegan por ella.
es_419: Observa cómo el título de navegación se muestra en la barra de navegación de la parte superior de tu visualización `ContentView`. Estos títulos ayudan a que los usuarios de tu app entiendan el contenido que están visualizando.
fr: As-tu remarqué comment le titre de navigation s’affiche dans la barre de navigation en haut de ta `ContentView` ? Ces titres aident les utilisateurs de ton app à comprendre le contenu qu’ils ont sous les yeux.
it: Hai notato come il titolo di navigazione viene visualizzato nella barra di navigazione nella parte superiore della vista `ContentView`? I titoli aiutano le persone di capire i contenuti che hanno di fronte.
nl: Zie je hoe de navigatietitel wordt weergegeven in de navigatiebalk boven in je `ContentView`? Aan de hand van deze titels kunnen de [gebruikers](glossary://user) van je app zien welke inhoud wordt weergegeven.
no: Ser du hvordan navigeringstittelen vises i navigeringslinjen øverst i `ContentView`? Disse titlene hjelper personer som bruker appen, med å forstå innholdet de ser på.
pt: Reparou como o título de navegação aparece na barra de navegação na parte superior da `ContentView`? Esses títulos ajudam uma pessoa usando o app a entender o conteúdo sendo exibido.
sv: Ser du hur navigeringstiteln visas i navigeringsfältet överst i `ContentView`? De här titlarna hjälper personer som använder appen att förstå innehållet de tittar på.
th: สังเกตว่าชื่อการนำทางจะแสดงในแถบการนำทางที่ด้านบนสุดของ `ContentView` ของคุณอย่างไร ชื่อเหล่านี้จะช่วยให้คนที่ใช้แอปของคุณเข้าใจเนื้อหาที่พวกเขากำลังดู
tr: Dolaşma başlığının `ContentView`’unun en üstündeki dolaşma çubuğunda nasıl görüntülendiğine dikkat ettin mi? Bu başlıklar, uygulamanı kullanan bir kişinin gördüğü içeriği anlamasına yardımcı olur.
vi: Bạn có lưu ý đến cách tiêu đề điều hướng hiển thị trong thanh điều hướng ở trên cùng của `ContentView` không? Những tiêu đề này giúp một người sử dụng ứng dụng của bạn hiểu nội dung mà họ đang xem.
zh_cn: 注意到导航标题在 `ContentView` 顶部的导航栏中如何显示了吗？这些标题可让使用你 App 的用户了解自己正在查看什么内容。
zh_tw: 請注意導覽標題是如何顯示在 `ContentView` 上方的導覽列中。這些標題可幫助你的 App 使用者瞭解他們正在檢視的內容。

source: Next, you’ll add a [NavigationLink](glossary://navigation%20link) to `ContentView` to navigate to the `CreatureDance` view.
de: Als Nächstes fügst du einen [Navigations-Link](glossary://navigation%20link) zu `ContentView` hinzu, um zur Ansicht `CreatureDance` zu navigieren.
es: A continuación, vas a añadir un enlace de navegación [NavigationLink](glossary://navigation%20link) a la vista de contenido (`ContentView`) para navegar hasta la vista `CreatureDance`.
es_419: A continuación, agregarás un [enlace de navegación](glossary://navigation%20link) en la visualización `"ContentView"` para navegar a la visualización `"CreatureDance"`.
fr: Ensuite, tu ajouteras un [lien de navigation](glossary://navigation%20link) vers `ContentView` pour naviguer jusqu’à la vue `CreatureDance`.
it: Nella prossima attività, aggiungerai un [NavigationLink](glossary://navigation%20link) a `ContentView` per andare alla vista `CreatureDance`.
nl: Nu ga je een [NavigationLink](glossary://navigation%20link) toevoegen aan `ContentView` om naar de weergave `CreatureDance` te navigeren.
no: Deretter legger du til en [NavigationLink](glossary://navigation%20link) i `ContentView` for å navigere til visningen `CreatureDance`.
pt: Em seguida, você adicionará um [NavigationLink](glossary://navigation%20link) à `ContentView` para navegar até a visualização `CreatureDance`.
sv: Härnäst lägger du till en [NavigationLink](glossary://navigation%20link) i `ContentView` för att navigera till vyn `CreatureDance`.
th: ถัดไป คุณจะเพิ่ม [NavigationLink](glossary://navigation%20link) ไปยัง `ContentView` เพื่อนำทางไปยังมุมมอง `CreatureDance`
tr: Sonra, `CreatureDance` görüntüsüne gitmek için `ContentView`’a bir [NavigationLink](glossary://navigation%20link) ekleyeceksin.
vi: Tiếp theo, bạn sẽ thêm một [NavigationLink](glossary://navigation%20link) vào `ContentView` để điều hướng đến chế độ xem `CreatureDance`.
zh_cn: 下一步，你会将 [NavigationLink](glossary://navigation%20link) 添加到 `ContentView`，以导航到 `CreatureDance`（动物跳舞）视图。
zh_tw: 接下來，你將加入一個 [NavigationLink](glossary://navigation%20link) 到 `ContentView` 來導覽至 `CreatureDance` 顯示區。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskaddNavLinkCreatureDance..title
source: Add a `NavigationLink` to `CreatureList`
de: `NavigationLink` zu `CreatureEditor` hinzufügen
es: Añadir un enlace de navegación (`NavigationLink`) a `CreatureList`
es_419: Agregar un `NavigationLink` a `CreatureList`
fr: Ajouter un `NavigationLink` à `CreatureList`
it: Aggiungere un `NavigationLink` a `CreatureList`
nl: Een `NavigationLink` aan `CreatureList` toevoegen
no: Legg til en `NavigationLink` i `CreatureList`
pt: Adicione um `NavigationLink` a `CreatureList`
sv: Lägg till en `NavigationLink` i `CreatureList`
th: เพิ่ม `NavigationLink` ไปยัง `CreatureList`
tr: `CreatureList`’e `NavigationLink` ekleme
vi: Thêm một `NavigationLink` vào `CreatureList`
zh_cn: 将 `NavigationLink` 添加到 `CreatureList`
zh_tw: 將一個 `NavigationLink` 加入 `CreatureList`

source: Add a link with a destination of `CreatureDance` inside the `Section("Dance")` view. Use the label and navigation title to describe what the view does (in this case, it makes some creatures dance around!).
de: Füge einen Link mit dem Ziel `CreatureDance` in der Ansicht `Section("Tanzen")` ein. Verwende das Etikett und den Navigationstitel, um die Funktion der Ansicht zu beschreiben (in diesem Fall bringt sie einige Charaktere zum Tanzen!).
es: Añade un enlace con destino a `CreatureDance` dentro de la vista `Section("Dance")`. Usa la etiqueta y el título de navegación para describir lo que hace la vista (en este caso, hace bailar a algunas criaturas).
es_419: Dentro de la visualización `Section("Dance")`, agrega un enlace con `CreatureDance` como destino. Usa la etiqueta y el título para describir lo que hace la visualización (en este caso, hará que algunas criaturas bailen).
fr: Ajoute un lien dont la destination est `CreatureDance` à l’intérieur de la vue `Section("Dance")`. Utilise l’étiquette et le titre de navigation pour décrire ce que fait la vue (dans ce cas, elle fait danser des créatures !).
it: Aggiungi un link con destinazione `CreatureDance` all'interno della vista `Section("Dance")`. Utilizza l'etichetta e il titolo di navigazione per descrivere la funzione della vista. In questo caso fa ballare alcune creature.
nl: Voeg een link toe met als doel `CreatureDance` in de weergave `Section("Dance")`. Gebruik het label en de navigatietitel om te beschrijven wat de weergave doet (in dit geval zorgt de weergave ervoor dat bepaalde wezens gaan ronddansen!).
no: Legg til en lenke med målet `CreatureDance` inni visningen `Section("Dance")`. Bruk etiketten og navigeringstittelen til å beskrive hva visningen gjør (i dette tilfellet får den noen skapninger til å danse!).
pt: Adicione um link com o destino de `CreatureDance` dentro da visualização `Section("Dance")` Use a etiqueta e o título de navegação para descrever o que a visualização faz (neste caso, ela faz com que algumas criaturas dancem!).
sv: Lägg till en länk med målet `CreatureDance` inuti vyn `Section("Dance")`. Använd etiketten och navigeringstiteln till att beskriva vad vyn gör (i det här fallet gör den så att några varelser dansar!).
th: เพิ่มลิงก์ที่มีปลายทางของ `CreatureDance` ภายในมุมมอง `Section("Dance")` ใช้ป้ายและชื่อการนำทางเพื่ออธิบายว่ามุมมองใช้ทำอะไร (ในกรณีนี้ มุมมองจะทำให้สิ่งมีชีวิตบางตัวเต้นไปมา!)
tr: `Section("Dans")` görüntüsünün içine `CreatureDance` hedefli bir bağlantı ekle. Görüntünün ne yaptığını açıklamak için etiket ve dolaşma başlığını kullan (bu durumda, bazı yaratıkları dans ettirir!).
vi: Thêm một liên kết có đích là `CreatureDance` bên trong chế độ xem `Section("Dance")`. Hãy sử dụng nhãn và tiêu đề điều hướng để mô tả nhiệm vụ của chế độ xem (trong trường hợp này là làm cho một số sinh vật nhảy múa xung quanh!).
zh_cn: 在 `Section("Dance")`（跳舞部分）视图内添加一个目的位置为 `CreatureDance` 的链接。使用标签和导航标题来描述视图的作用（在这个例子中，它会让一些动物跳舞！）。
zh_tw: 在 `Section("Dance")` 顯示區中加入目標為 `CreatureDance` 的連結。使用標籤和導覽標題來描述顯示區的作用（在這個例子中，它會讓一些生物在周圍跳舞！）。

source: NavigationLink("Make the Creatures Dance") { DancingCreatures() .navigationTitle("Dancing Creatures") }
de: NavigationLink("Die Charaktere tanzen lassen") { DancingCreatures() .navigationTitle("Tanzende Charaktere") }
es: NavigationLink("Haz bailar a las criaturas") { DancingCreatures() .navigationTitle("Criaturas bailarinas") }
es_419: NavigationLink("Haz que las criaturas bailen") { DancingCreatures() .navigationTitle("Criaturas bailarinas") }
fr: NavigationLink("Faire danser les créatures") { DancingCreatures() .navigationTitle("Créatures qui dansent") }
it: NavigationLink("Fai danzare le creature") { DancingCreatures() .navigationTitle("Creature danzanti") }
nl: NavigationLink("Laat de wezens dansen") { DancingCreatures() .navigationTitle("Dansende wezens") }
sv: NavigationLink("Gör så att varelserna dansar") { DancingCreatures() .navigationTitle("Dancing Creatures") }
th: NavigationLink("ทำให้สิ่งมีชีวิตเต้น") { DancingCreatures() .navigationTitle("สิ่งมีชีวิตเต้นได้") }
tr: NavigationLink("Yaratıkları Dans Ettir") { DancingCreatures() .navigationTitle("Dans Eden Yaratıklar") }
vi: NavigationLink("Làm cho các sinh vật nhảy múa") { DancingCreatures() .navigationTitle("Các sinh vật nhảy múa") }
zh_cn: NavigationLink("让动物跳舞") { DancingCreatures() .navigationTitle("跳舞的动物") }

# GuideBook..Guide0..StepNavigating in SwiftUI..SuccessMessage..Paragraph164
source: Congratulations, adding navigation is an essential part of creating an app.
de: Glückwunsch! Eine Navigationsmöglichkeit hinzuzufügen, ist ein wesentlicher Bestandteil beim Erstellen von Apps.
es: ¡Enhorabuena! Añadir la navegación es una parte esencial de la creación de una app.
es_419: ¡Felicidades! Agregar la función de navegación es una parte esencial de la creación de una app.
fr: Félicitations, l’ajout de la navigation est un élément essentiel de la création d’une app.
it: Ottimo lavoro, aggiungere funzionalità di navigazione è una parte fondamentale della creazione di un'app.
nl: Gefeliciteerd, het toevoegen van navigatie is een essentieel onderdeel van het maken van een app.
no: Gratulerer! Å legge til navigering er en absolutt forutsetning når du lager en app.
pt: Parabéns! Adicionar navegação é uma parte essencial da criação de um app.
sv: Grattis! Att lägga till navigering är en absolut förutsättning när du skapar en app.
th: ยินดีด้วย การเพิ่มการนำทางเป็นส่วนสำคัญของการสร้างแอป
tr: Tebrikler, dolaşmayı eklemek uygulama yaratmanın önemli bir parçasıdır.
vi: Chúc mừng, thêm điều hướng là một phần thiết yếu của quá trình tạo ra một ứng dụng.
zh_cn: 恭喜，添加导航是创建 App 中必不可少的一部分。
zh_tw: 恭喜！加入導覽是製作 App 的重要部分。
