Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: To build the `CreatureEditor` view, you can use a built-in `Form` view, which is great when handling data entry.
de: Zum Ausbauen der Ansicht `CreatureEditor` kannst du die integrierte `Form`-Ansicht verwenden, die sich ideal zum Verarbeiten von Dateneinträgen eignet.
es: Para crear la vista `CreatureEditor`, puedes usar una vista integrada `Form` (forma), que resulta genial a la hora de gestionar la entrada de datos.
es_419: Para crear la visualización `CreatureEditor`, puedes usar una visualización integrada `Form` (formulario), la cual es ideal para administrar la entrada de datos.
fr: Pour créer la vue `CreatureEditor`, tu peux utiliser une vue `Form` intégrée, qui est idéale pour gérer une saisie de données.
it: Per costruire la vista `CreatureEditor`, puoi utilizzare una vista integrata `Form`, perfetta per la gestione dell'inserimento di dati.
nl: Om de weergave `CreatureEditor` te bouwen, kun je de ingebouwde weergave `Form` gebruiken die erg handig is voor het werken met gegevensinvoer.
no: Når du bygger `CreatureEditor`-visningen, kan du bruke en innebygd `Form`-visning som er praktisk for håndtering av dataregistrering.
pt: Para criar a visualização `CreatureEditor`, você pode usar uma visualização integrada `Form`, ótima para lidar com a entrada de dados.
sv: När du bygger `CreatureEditor`-vyn kan du använda en inbyggd `Form`-vy som är praktisk för hantering av datainmatning.
th: ในการสร้างมุมมอง`CreatureEditor` คุณสามารถใช้มุมมอง `Form` ในตัว ซึ่งเหมาะกับการจัดการการป้อนข้อมูล
tr: `CreatureEditor` görüntüsünü oluşturmak için veri girdisini işlemede harika olan yerleşik bir `Form` görüntüsünü kullanabilirsin.
vi: Để xây dựng chế độ xem `CreatureEditor`, bạn có thể sử dụng một chế độ xem `Form` tích hợp, rất phù hợp khi xử lý việc nhập dữ liệu.
zh_cn: 若要构建 `CreatureEditor` 视图，你可以使用内建 `Form`（表格）视图，它非常适合用来处理数据输入。
zh_tw: 若要建構 `CreatureEditor` 顯示區，你可以使用內建的 `Form` 顯示區，它十分適合用來處理資料項目。

source: Inside of the `Form`, you’ll add three `Section` views: One each for editing the creature’s name, emoji, and a preview.
de: In `Form` fügst du drei `Section`-Ansichten hinzu: je eine zum Bearbeiten des Namens, Emojis und der Vorschau des Charakters.
es: Dentro de `Form`, añadirás tres vistas `Section`: una para editar el nombre de la criatura, otra para el emoji y otra para la previsualización.
es_419: Agrega tres visualizaciones `Section` dentro de `Form`; cada una para editar un aspecto de la criatura: su nombre, emoji y vista previa.
fr: À l’intérieur du `Form`, tu ajouteras trois vues `Section` : elles servent chacune à modifier le nom, l’Emoji et l’aperçu de la créature.
it: All'interno della vista `Form`, dovrai aggiungere tre viste `Section` per le seguenti operazioni: modificare il nome della creatura, modificare l'emoji e visualizzare un'anteprima.
nl: In de weergave `Form` voeg je drie `Section`-weergaven toe: één voor het bewerken van de naam van het wezen, één voor het bewerken van de emoji van het wezen, en een voorvertoning.
no: Inni `Form` legger du til tre `Section`-visninger: en der du redigerer skapningens navn, en der du redigerer skapningens emoji, og en forhåndsvisning.
pt: Dentro de `Form`, você adicionará três visualizações `Section`: cada qual para editar o nome, emoji e pré‑visualização da criatura.
sv: Inuti `Form` lägger du till tre `Section`-vyer: en där du redigerar varelsens namn, en där du redigerar varelsens emoji samt en förhandsvisning.
th: ภายใน `Form` คุณจะต้องเพิ่มมุมมอง `Section` สามมุมมอง โดยแต่ละมุมมองใช้สำหรับแก้ไขชื่อ อิโมจิ และการแสดงตัวอย่างของสิ่งมีชีวิต
tr: `Form`’un içinde üç `Section` görüntüsü ekleyeceksin: Yaratık adını, emojisini ve önizlemesini düzenlemek için birer tane.
vi: Bên trong `Form`, bạn sẽ thêm ba chế độ xem `Section`: Mỗi chế độ xem để sửa tên, biểu tượng và bản xem trước của sinh vật.
zh_cn: 在 `Form` 内，你将添加三个 `Section` 视图：分别用于编辑动物的名称、表情符号和预览。
zh_tw: 你會在 `Form` 的內部加入三個 `Section` 顯示區：分別用來編輯生物的名稱、表情符號和預覽。

source: Form { Section("Name") { //#-learning-code-snippet(addACreatureEditorTextField) } Section("Emoji") { } Section("Creature Preview") { CreatureRow(creature: newCreature) } }
es: Form { Section("Nombre") { //#-learning-code-snippet(addACreatureEditorTextField) } Section("Emoji") { } Section("Vista previa de la criatura") { CreatureRow(creature: newCreature) } }
es_419: Form { Section("Nombre") { //#-learning-code-snippet(addACreatureEditorTextField) } Section("Emoji") { } Section("Vista previa de criatura") { CreatureRow(creature: newCreature) } }
tr: Form { Section("Ad") { //#-learning-code-snippet(addACreatureEditorTextField) } Section("Emoji") { } Section("Yaratık Önizleme") { CreatureRow(creature: newCreature) } }
vi: Form { Section("Tên") { //#-learning-code-snippet(addACreatureEditorTextField) } Section("Biểu tượng") { } Section("Xem trước sinh vật") { CreatureRow(creature: newCreature) } }
zh_cn: Form { Section("名称") { //#-learning-code-snippet(addACreatureEditorTextField) } Section("表情符号") { } Section("动物预览") { CreatureRow(creature: newCreature) } }

source: Add `TextField` views for user input
de: `TextField`-Ansichten für Benutzereingaben hinzufügen
es: Añadir vistas `TextField` para la entrada del usuario
es_419: Agregar visualizaciones TextField para la entrada del usuario
fr: Ajouter des vues `TextField` pour la saisie utilisateur
it: Aggiungere viste `TextField` per l'input utente
nl: `TextField`-weergaven toevoegen voor gebruikersinvoer
no: Legg til `TextField`-visninger for brukerinndata
pt: Adicione visualizações TextField para entrada do usuário
sv: Lägg till `TextField`-vyer för användarinmatning
th: เพิ่มมุมมอง `TextField` สำหรับ Input ของผู้ใช้
tr: Kullanıcı girdisi için `TextField` görüntüleri ekleme
vi: Thêm các chế độ xem `TextField` cho đầu vào của người dùng
zh_cn: 为用户输入添加 `TextField` 视图
zh_tw: 加入 `TextField` 顯示區供使用者輸入

source: Next, you need to add a way for [people](glossary://user) to edit the `name` and `emoji` values for the `Creature` [state property](glossary://state%20property).
de: Als Nächstes brauchst du für [Benutzer:innen](glossary://user) eine Möglichkeit, die Werte `name` und `emoji` für die [Statuseigenschaft](glossary://state%20property) von `Creature` zu bearbeiten.
es: A continuación, necesitas añadir una forma con la que las [personas](glossary://user) puedan editar los valores `name` y `emoji` de la [propiedad de estado](glossary://state%20property) de la criatura (`Creature`).
es_419: A continuación, necesitas agregar una manera que permita a las [personas](glossary://user) editar los valores de `name` y `emoji` de la [propiedad de estado](glossary://state%20property) `Creature`.
fr: Tu dois ensuite trouver un moyen pour que des [personnes](glossary://user) puissent modifier les valeurs `name` et `emoji` de la [propriété d’état](glossary://state%20property) `Creature`.
it: Successivamente dovrai aggiungere un modo per consentire alle [persone](glossary://user) di modificare i valori `name` ed `emoji` corrispondenti alla [proprietà di stato](glossary://state%20property) `Creature`.
nl: Nu heb je een manier nodig waarop de [gebruiker](glossary://user) de waarden `name` en `emoji` van de [statuseigenschap](glossary://state%20property) `Creature` kan bewerken.
no: Deretter må [personer](glossary://user) kunne redigere verdiene `name` og `emoji` for [statusegenskapen](glossary://state%20property) `Creature`.
pt: Depois, você precisa adicionar uma maneira para que as [pessoas](glossary://user) editem os valores de `name` e `emoji` da [propriedade de estado](glossary://state%20property) `Creature`.
sv: Härnäst måste [personer](glossary://user) kunna redigera värdena `name` och `emoji` för [statusegenskapen](glossary://state%20property) `Creature`.
th: ถัดไป คุณต้องเพิ่มวิธีที่ให้[ผู้คน](glossary://user)แก้ไขค่า `name` และ `emoji` สำหรับ[คุณสมบัติสถานะ](glossary://state%20property)ของ `Creature`
tr: Sonra, [kişilerin](glossary://user) `Creature` [durum özelliğinin](glossary://state%20property) `name` ve `emoji` değerlerini düzenleyebileceği bir yöntem eklemen gerekir.
vi: Tiếp theo, bạn cần thêm một cách thức để [mọi người](glossary://user) sửa các giá trị `name` và `emoji` cho [thuộc tính trạng thái](glossary://state%20property) `Creature`.
zh_cn: 下一步，你需要添加一种方法，让[用户](glossary://user)编辑 `Creature` [状态属性](glossary://state%20property)的 `name` 和 `emoji` 值。
zh_tw: 接下來，你需要加入一個方法讓[使用者](glossary://user)編輯 `Creature` [狀態屬性](glossary://state%20property) 的 `name` 和 `emoji` 值。

source: You do this by adding a [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) view, which allows people to enter some text.
de: Füge dazu eine [TextField](doc://com.apple.documentation/documentation/swiftui/textfield)-Ansicht hinzu, mit der Text eingegeben werden kann.
es: Esto se puede hacer añadiendo una vista [TextField](doc://com.apple.documentation/documentation/swiftui/textfield), que permite a las personas introducir texto.
es_419: Esto lo puedes hacer al agregar una visualización [TextField](doc://com.apple.documentation/documentation/swiftui/textfield), la cual permite a las personas ingresar texto.
fr: Tu peux réaliser cela en ajoutant une vue [TextField](doc://com.apple.documentation/documentation/swiftui/textfield), qui permet de saisir du texte.
it: Per farlo, aggiungi una vista [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) che consente alle persone di inserire del testo.
nl: Je doet dit door een [TextField](doc://com.apple.documentation/documentation/swiftui/textfield)-weergave toe te voegen, waarin de gebruiker tekst kan typen.
no: Du kan gjøre dette ved å legge til en [TextField](doc://com.apple.documentation/documentation/swiftui/textfield)-visning der personer kan legge inn tekst.
pt: Para fazer isso, adicione uma visualização [TextField](doc://com.apple.documentation/documentation/swiftui/textfield), que permite que as pessoas digitem um texto.
sv: Du kan göra detta genom att lägga till en [TextField](doc://com.apple.documentation/documentation/swiftui/textfield)-vy där personer kan mata in text.
th: ให้คุณทำสิ่งนี้โดยเพิ่มมุมมอง [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) ซึ่งจะช่วยให้ผู้คนสามารถป้อนข้อความได้
tr: Bunu, kişilerin metin girmesine izin veren bir [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) görüntüsü ekleyerek yaparsın.
vi: Bạn thực hiện việc này bằng cách thêm một chế độ xem [TextField](doc://com.apple.documentation/documentation/swiftui/textfield), cho phép mọi người nhập văn bản.
zh_cn: 你可以通过添加 [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) 视图来完成这个操作。这个视图可让用户输入一些文本。
zh_tw: 你可以透過加入 [TextField](doc://com.apple.documentation/documentation/swiftui/textfield) 顯示區來完成此操作，此顯示區能讓使用者輸入一些文字。

source: Add two `TextField` views to edit the creature `name` and `emoji` values. Use the `TextField(_:text:)` initializer, which takes arguments for a [label](glossary://label) and a [binding](glossary://binding) `String` value.
de: Füge zwei `TextField`-Ansichten hinzu, um die Werte `name` und `emoji` des Characters zu bearbeiten. Verwende die Initialisierung `TextField(_:text:)`, die Argumente von einem [Etikett](glossary://label) und einem [gebundenen](glossary://binding) `String`-Wert übernimmt.
es: Añade dos vistas `TextField` para editar los valores `name` y `emoji` de la criatura. Usa el inicializador `TextField(_:text:)`, que toma argumentos del valor `String` para una [etiqueta](glossary://label) y una [vinculación](glossary://binding).
es_419: Agrega dos visualizaciones `TextField` para editar los valores de `name` y `emoji` de la criatura. Usa el inicializador `TextField(_:text:)`, el cual toma argumentos para una [etiqueta](glossary://label) y un valor del tipo `String` de una [ligadura](glossary://binding).
fr: Ajoute deux vues `TextField` pour changer les valeurs `name` et `emoji` de la créature. Utilise l’initialiseur `TextField(_:text:)`, qui prend les arguments pour une [étiquette](glossary://label) et une valeur `String` d’[association](glossary://binding).
it: Aggiungi due viste `TextField` per modificare i valori `name` e `emoji` della creatura. Utilizza l'inizializzatore `TextField(_:text:)` che prende gli argomenti per un'[etichetta](glossary://label) e un valore `String` [vincolo](glossary://binding).
nl: Voeg twee `TextField`-weergaven toe om de waarden `name` en `emoji` van het wezen te bewerken. Gebruik de `TextField(_:text:)`-initializer, die argumenten ontvangt voor een [label](glossary://label) en een [binding](glossary://binding)-`String`-waarde.
no: Legg til to `TextField`-visninger der du kan redigere skapningens verdier for `name` og `emoji`. Bruk initialisereren `TextField(_:text:)` som tar argumenter for en [etikett](glossary://label) og en [binding](glossary://binding) `String`-verdi.
pt: Adicione duas visualizações `TextField` para editar os valores de `name` e `emoji` da criatura. Use o inicializador `TextField(_:text:)` que aceita argumentos para uma [etiqueta](glossary://label) e um valor de `String` de [vínculo](glossary://binding).
sv: Lägg till två `TextField`-vyer där du kan redigera varelsens värden för `name` och `emoji`. Använd initieraren `TextField(_:text:)` som tar argument för en [etikett](glossary://label) och ett [kopplande](glossary://binding) `String`-värde.
th: เพิ่มมุมมอง `TextField` สองมุมมองเพื่อแก้ไขสิ่งมีชีวิต `name` และค่า `emoji` ใช้ตัวเริ่มต้น `TextField(_:text:)` ที่จะใช้อาร์กิวเมนต์สำหรับ[ป้าย](glossary://label)และค่า `String` [การรวม](glossary://binding)
tr: Yaratığın `name` ve `emoji` değerlerini düzenlemek için iki `TextField` görüntüsü ekle. Bir [etiket](glossary://label) ve bir [bağlama](glossary://binding) `String` değerinin argümanlarını alan `TextField(_:text:)` ilk değer atayıcısını kullan.
vi: Thêm hai chế độ xem `TextField` để sửa các giá trị `name` và `emoji` của sinh vật. Hãy sử dụng trình khởi tạo `TextField(_:text:)`, lấy các đối số cho [nhãn](glossary://label) và một giá trị `String` [ràng buộc](glossary://binding).
zh_cn: 添加两个 `TextField` 视图来编辑动物的 `name` 和 `emoji` 值。使用 `TextField(_:text:)` 构造器，它接受[标签](glossary://label)和 `String` [绑定](glossary://binding)值的实参。
zh_tw: 加入兩個 `TextField` 顯示區來編輯生物的 `name` 和 `emoji` 值。使用 `TextField(_:text:)` 初始化程式，它接受[標籤](glossary://label)和[綁定](glossary://binding) `String` 值的引數。

source: Remember, a binding requires that the source of truth is managed by SwiftUI, such by a [state property](glossary://state%20property).
de: Vergiss aber nicht, dass bei einer Bindung die Wahrheitsquelle von SwiftUI verwaltet werden muss, z. B. über eine [Statuseigenschaft](glossary://state%20property).
es: Recuerda que una vinculación requiere que la fuente de datos esté gestionada por SwiftUI, por ejemplo, por una [propiedad del estado](glossary://state%20property).
es_419: Recuerda, una ligadura requiere que la fuente de la verdad sea administrada por SwiftUI, por ejemplo, mediante una [propiedad de estado](glossary://state%20property).
fr: N’oublie pas qu’une association nécessite que la source de vérité soit gérée par SwiftUI, comme par une [propriété d’état](glossary://state%20property).
it: Ricordati che un vincolo richiede che la sorgente univoca sia gestita da SwiftUI, ad esempio dalla [proprietà di stato](glossary://state%20property).
nl: Vergeet niet dat het voor een binding noodzakelijk is dat de bron van waarheid door SwiftUI wordt beheerd, bijvoorbeeld met een [statuseigenschap](glossary://state%20property).
no: Husk at en binding krever at sannhetskilden håndteres av SwiftUI, for eksempel gjennom en [statusegenskap](glossary://state%20property).
pt: Lembre-se de que um vínculo requer que a fonte da verdade seja gerenciada pela SwiftUI, como em uma [propriedade de estado](glossary://state%20property).
sv: Kom ihåg att en koppling kräver att sanningskällan hanteras av SwiftUI, exempelvis genom en [statusegenskap](glossary://state%20property).
th: อย่าลืมว่า การรวมกำหนดให้ SwiftUI จัดการแหล่งข้อมูลจริง เช่น โดย[คุณสมบัติสถานะ](glossary://state%20property)
tr: Bağlama için gerçeklik kaynağının SwiftUI tarafından (örneğin [durum özelliği](glossary://state%20property)) yönetiliyor olmasını gerektiğini unutma.
vi: Hãy nhớ rằng một ràng buộc yêu cầu rằng nguồn chân lý được quản lý bởi SwiftUI, chẳng hạn như bởi một [thuộc tính trạng thái](glossary://state%20property).
zh_cn: 请记住，绑定需要由 SwiftUI 管理的可信源，例如通过[状态属性](glossary://state%20property)来进行。
zh_tw: 記住，綁定需要由 SwiftUI 管理的真實來源，例如[狀態屬性](glossary://state%20property)。

source: Pass in a binding to your `Creature` state property, and specify the `name` and `emoji` values like this:
de: Übergib eine Bindung an die Statuseigenschaft `Creature` und lege die Werte `name` und `emoji` wie folgt fest:
es: Pasa una vinculación a la propiedad del estado de tu criatura (`Creature`) y especifica los valores `name` y `emoji` de este modo:
es_419: Pasa una ligadura a tu propiedad de estado `Creature`, y especifica los valores de `name` y `emoji` de la siguiente manera:
fr: Transmets une association à la propriété d’état de ta `Creature` et précise les valeurs `name` et `emoji` comme suit :
it: Trasmetti un vincolo alla tua proprietà di stato `Creature` e specifica i valori `name` ed `emoji` come mostrato di seguito:
nl: Geef een binding door aan de statuseigenschap `Creature` en geef de waarden `name` en `emoji` als volgt op:
no: Overfør en binding til statusegenskapen `Creature`, og angi verdiene `name` og `emoji` som dette:
pt: Passe um vínculo para a propriedade de estado `Creature` e especifique os valores de `name` e `emoji` assim:
sv: Överför en koppling till statusegenskapen `Creature` och ange värdena `name` och `emoji` så här:
th: ส่งผ่านการรวมไปยังคุณสมบัติสถานะ `Creature` ของคุณและระบุค่า `name` และ `emoji` ดังนี้:
tr: `Creature` durum özelliğine bir bağlama geçirip `name` ve `emoji` değerlerini şu şekilde belirt:
vi: Chuyển một ràng buộc vào thuộc tính trạng thái `Creature` của bạn và chỉ định các giá trị `name` và `emoji` như sau:
zh_cn: 将绑定传入 `Creature` 状态属性，并像这样指定 `name` 和 `emoji` 值：
zh_tw: 將綁定傳入你的 `Creature` 狀態屬性，並且指定 `name` 和 `emoji` 值，像這樣：

source: Here’s an example of how to add a `TextField`. Add one `TextField` for editing `newCreature.name` and another for editing `newCreature.emoji`.
de: Hier ist ein Beispiel, wie du das Textfeld `TextField` hinzufügst. Füge ein Textfeld `TextField` hinzu, um `newCreature.name` zu bearbeiten, und ein weiteres, um `newCreature.emoji` zu ändern.
es: Este es un ejemplo de cómo añadir un `TextField`. Añade un `TextField` para editar `newCreature.name` y otro para editar `newCreature.emoji`.
es_419: Aquí tienes un ejemplo de cómo agregar una visualización `TextField`. Agrega una para editar `newCreature.name`, y luego agrega otra para editar `newCreature.emoji`.
fr: Voici un exemple de la façon d’ajouter un `TextField`. Ajoute un `TextField` pour modifier `newCreature.name` et un autre pour modifier `newCreature.emoji`.
it: Ecco un esempio di come aggiungere un `TextField`. Aggiungi un `TextField` per modificare `newCreature.name` e un altro per modificare `newCreature.emoji`.
nl: Dit is een voorbeeld van hoe je een `TextField` kunt toevoegen. Voeg één `TextField` toe voor het bewerken van `newCreature.name` te bewerken en een ander voor het bewerken van `newCreature.emoji`.
no: Her er et eksempel på hvordan du legger til et `TextField`. Legg til ett `TextField` for å redigere `newCreature.name` og et annet for å redigere `newCreature.emoji`.
pt: Aqui está um exemplo de como adicionar um `TextField`. Adicione um `TextField` para editar `newCreature.name` e outro para editar `newCreature.emoji`.
sv: Här är ett exempel på hur du lägger till ett `TextField`. Lägg till ett `TextField` för att redigera `newCreature.name` och ett annat för att redigera `newCreature.emoji`.
th: ต่อไปนี้เป็นตัวอย่างวิธีการเพิ่ม `TextField` โดยให้เพิ่ม`TextField` หนึ่งรายการสำหรับแก้ไข `newCreature.name` และอีกหนึ่งรายการสำหรับแก้ไข `newCreature.emoji`
tr: İşte bir `TextField` ekleme örneği. `newCreature.name`’i düzenlemek için bir `TextField`, `newCreature.emoji`’yi düzenlemek için ise başka bir tane ekle.
vi: Đây là một ví dụ về cách thêm một `TextField`. Hãy thêm một `TextField` để sửa `newCreature.name` và một chế độ xem khác để sửa `newCreature.emoji`.
zh_cn: 以下是如何添加 `TextField` 的示例。添加一个 `TextField` 来编辑 `newCreature.name`（新动物名称），再添加另一个来编辑 `newCreature.emoji`（新动物表情符号）。
zh_tw: 這個範例說明如何加入 `TextField`。加入一個 `TextField` 來編輯 `newCreature.name` 並且加入另一個來編輯 `newCreature.emoji`。

source: TextField("Name", text: $newCreature.name)
es: TextField("Nombre", text: $newCreature.name)
es_419: TextField("Nombre", text: $newCreature.name)
fr: TextField("Nom", text: $newCreature.name)
nl: TextField("Naam", text: $newCreature.name)
sv: TextField("Namn", text: $newCreature.name)
tr: TextField("Ad", text: $newCreature.name)
vi: TextField("Tên", text: $newCreature.name)
zh_cn: TextField("名称", text: $newCreature.name)

source: Form { Section("Name") { TextField("Name", text: $newCreature.name) } Section("Emoji") { TextField("Emoji", text: $newCreature.emoji) } Section("Creature Preview") { CreatureRow(creature: newCreature) } }
de: Form { Section("Name") { TextField("Name", text: $newCreature.name) } Section("Emoji") { TextField("Emoji", text: $newCreature.emoji) } Section("Charaktervorschau") { CreatureRow(creature: newCreature) } }
es: Form { Section("Nombre") { TextField("Nombre", text: $newCreature.name) } Section("Emoji") { TextField("Emoji", text: $newCreature.emoji) } Section("Vista previa de la criatura") { CreatureRow(creature: newCreature) } }
es_419: Form { Section("Nombre") { TextField("Nombre", text: $newCreature.name) } Section("Emoji") { TextField("Emoji", text: $newCreature.emoji) } Section("Vista previa de criatura") { CreatureRow(creature: newCreature) } }
fr: Form { Section("Name") { TextField("Nom", text: $newCreature.name) } Section("Emoji") { TextField("Emoji", text: $newCreature.emoji) } Section("Creature Preview") { CreatureRow(creature: newCreature) } }
tr: Form { Section("Ad") { TextField("Ad", text: $newCreature.name) } Section("Emoji") { TextField("Emoji", text: $newCreature.emoji) } Section("Yaratık Önizleme") { CreatureRow(creature: newCreature) } }
vi: Form { Section("Tên") { TextField("Tên", text: $newCreature.name) } Section("Biểu tượng") { TextField("Biểu tượng", text: $newCreature.emoji) } Section("Xem trước sinh vật") { CreatureRow(creature: newCreature) } }
zh_cn: Form { Section("名称") { TextField("名称", text: $newCreature.name) } Section("表情符号") { TextField("表情符号", text: $newCreature.emoji) } Section("动物预览") { CreatureRow(creature: newCreature) } }

# GuideBook..Guide0..StepAdd and delete creatures..TaskaddButtonToToolbar..title
source: Place an add button in the toolbar
de: Taste zum Hinzufügen in der Symbolleiste platzieren
es: Colocar un botón Añadir en la barra de herramientas
es_419: Colocar un botón de adición en la barra de herramientas
fr: Placer un bouton Ajouter dans la barre d’outils
it: Posizionare un pulsante Aggiungi nella barra degli strumenti
nl: Een toevoegknop in de knoppenbalk plaatsen
no: Plasser en Legg til-knapp i verktøylinjen
pt: Coloque um botão adicionar na barra de ferramentas
sv: Placera en lägg till-knapp i verktygsfältet
th: วางปุ่มเพิ่มลงในแถบเครื่องมือ
tr: Araç çubuğuna ekle düğmesi yerleştirme
vi: Đặt một nút thêm trong thanh công cụ
zh_cn: 将添加按钮放置在工具栏中
zh_tw: 在工具列中放置一個加入按鈕
