Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..Page77..Paragraph148
source: The `body` property of your app defines its content. For now, all you need to know is that you’ll need at least one view inside of a `WindowGroup`, which acts as a container for your app’s [view hierarchy](glossary://view%20hierarchy), a collection of views that your app presents when it launches.
de: Die `body`-Eigenschaft der App definiert ihren Inhalt. Aktuell musst du nur eines wissen: Du brauchst mindestens eine Ansicht in `WindowGroup`, die als Container für die [Ansichtenhierarchie](glossary://view%20hierarchy) deiner App dient. Dabei handelt es sich um eine Sammlung von Ansichten, die deine App beim Starten bereitstellt.
es: La propiedad `body` de tu app define su contenido. Por ahora, todo lo que debes saber es que necesitarás al menos una vista dentro de `WindowGroup`, que actúa como un contenedor para la [jerarquía de vistas](glossary://view%20hierarchy) de tu app, una colección de vistas que presenta tu app al abrirse.
es_419: La propiedad `body` (cuerpo) de tu app define su contenido. Por ahora, todo lo que necesitas saber es que requerirás al menos una visualización dentro de `WindowGroup`, que actúa como el contenedor de la [jerarquía de visualizaciones](glossary://view%20hierarchy) de tu app (una colección de las visualizaciones que tu app muestra cuando se abre).
fr: La propriété `body` de ton app définit son contenu. Pour le moment, tout ce que tu dois savoir est qu’il te faut au moins une vue à l’intérieur d’un `WindowGroup`, qui agit en tant que conteneur pour la [hiérarchie de vue](glossary://view%20hierarchy) de ton app, une collection de vues que ton app présente à son lancement.
it: La proprietà `body` della tua app ne definisce i contenuti. Per il momento ti basta sapere che ti servirà almeno una vista all'interno di un `WindowGroup`, che funge da contenitore per la [gerarchia di viste](glossary://view%20hierarchy) dell'app, una raccolta di viste che viene mostrata all'apertura dell'app.
nl: De inhoud van je app wordt bepaald door de eigenschap `body`. Voorlopig hoef je alleen te weten dat een `WindowGroup` minimaal één weergave moet bevatten. `WindowGroup` fungeert als een container voor de [weergavehiërarchie](glossary://view%20hierarchy), een verzameling weergaven die je app kan tonen wanneer deze wordt gestart.
no: Egenskapen `body` i appen definerer innholdet. For nå trenger du bare å vite at du må ha minst én visning inni en `WindowGroup`. Den fungerer som en beholder for appens [visningshierarki](glossary://view%20hierarchy), som består av en samling visninger som appen viser når den åpnes.
pt: A propriedade `body` do app define o seu conteúdo. Por enquanto, tudo o que você precisa saber é que é necessário ter ao menos uma visualização dentro de um `WindowGroup`, que funciona como um contêiner para a [hierarquia de visualização](glossary://view%20hierarchy) do app, uma coleção de visualizações que o app apresenta ao ser aberto.
sv: Egenskapen `body` i appen definierar dess innehåll. Just nu behöver du bara veta att du måste ha minst en vy inuti en `WindowGroup`. Den fungerar som en behållare för appens [vyhierarki](glossary://view%20hierarchy) som består av en samling vyer som appen visar när den öppnas.
th: คุณสมบัติ `body` ของแอปของคุณจะกำหนดเนื้อหาของแอป สำหรับตอนนี้ ทั้งหมดที่คุณต้องรู้คือคุณจำเป็นต้องมีอย่างน้อยหนึ่งมุมมองภายใน `WindowGroup` ซึ่งทำหน้าที่เป็นคอนเทนเนอร์สำหรับ[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)ของแอปของคุณ ซึ่งเป็นคอลเลกชั่นของมุมมองที่แอปของคุณแสดงเมื่อมีการเปิดใช้แอป
tr: Uygulamanın `body` özelliği onun içeriğini tanımlar. Şimdilik bilmen gereken tek şey, uygulamanın başlatıldığında sunduğu görüntü koleksiyonu olan [görüntü hiyerarşisi](glossary://view%20hierarchy) için kapsayıcı görevini gören bir `WindowGroup`’un içinde en az bir görüntüye ihtiyacın olacağıdır.
vi: Thuộc tính `body` trong ứng dụng của bạn định nghĩa nội dung của ứng dụng. Hiện tại, tất cả những gì bạn cần biết là bạn sẽ cần ít nhất một chế độ xem bên trong `WindowGroup`, đóng vai trò là một bộ chứa cho [phân cấp xem](glossary://view%20hierarchy) của ứng dụng, một tập hợp các chế độ xem mà ứng dụng của bạn hiển thị khi khởi chạy.
zh_cn: App 的 `body` 属性定义了它的内容。目前，你只需要知道在 `WindowGroup`（窗口组）内至少得有一个视图，用作 App [视图层次](glossary://view%20hierarchy)的容器，即 App 启动时显示的视图集合。
zh_tw: 你的 App 的 `body` 屬性定義了它的內容。現在，你需要知道的是，在 `WindowGroup` 中至少要有一個顯示區，它作為 App [顯示區階層](glossary://view%20hierarchy)的容器，這是在 App 啟動時會顯示的一組顯示區。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..Page78..Paragraph149
source: `ContentView` is your [top-level view](glossary://top-level%20view), the first view your app displays when it launches. It sits on top of your [view hierarchy](glossary://view%20hierarchy), which is a structured collection of [subviews](glossary://subview) that branch off from your top-level view.
de: `ContentView` ist die [oberste Ansicht](glossary://top-level%20view) und die erste Ansicht, die deine App beim Starten anzeigt. Sie befindet sich ganz oben in der [Ansichtenhierarchie](glossary://view%20hierarchy). Sie besteht aus einer strukturierten Sammlung aus [Unteransichten](glossary://subview), die sich ausgehend von der obersten Ansicht verzweigen.
es: La vista de contenido (`ContentView`) es tu [vista de nivel superior](glossary://top-level%20view), la primera vista que muestra tu app al abrirse. Está en lo más alto de la [jerarquía de vistas](glossary://view%20hierarchy), que es una colección estructurada de [vistas secundarias](glossary://subview) derivadas de tu vista de nivel superior.
es_419: `ContentView` es tu [visualización principal](glossary://top-level%20view), es decir, la primera visualización que tu app muestra cuando se inicia. Además, se encuentra en la parte superior de tu [jerarquía de visualizaciones](glossary://view%20hierarchy), que es una colección estructurada de [subvisualizaciones](glossary://subview) que se ramifican a partir de tu visualización principal.
fr: `ContentView` est ta [vue au plus haut niveau](glossary://top-level%20view), la première vue que ton app affiche à son lancement. Elle se situe en haut de ta [hiérarchie de vue](glossary://view%20hierarchy), qui est une collection structurée de [sous-vues](glossary://subview) qui se ramifient à partir de ta vue au plus haut niveau.
it: `ContentView` è la [vista di livello superiore](glossary://top-level%20view), la prima vista a essere mostrata all'apertura dell'app. Si trova alla sommità della [gerarchia di viste](glossary://view%20hierarchy), ovvero una raccolta strutturata di [viste secondarie](glossary://subview) che si diramano da quella di livello superiore.
nl: `ContentView` is de [weergave op het hoogste niveau](glossary://top-level%20view) die als eerste wordt getoond nadat je app is gestart. `ContentView` bevindt zich boven in je [weergavehiërarchie](glossary://view%20hierarchy). Dit is een gestructureerde verzameling [subweergaven](glossary://subview) die zich vertakt vanuit de hoogste weergave.
no: `ContentView` er [toppnivåvisningen](glossary://top-level%20view) og en den første visningen som appen viser når den åpnes. Den er øverst i [visningshierarkiet](glossary://view%20hierarchy), som er en strukturert samling av [delvisninger](glossary://subview) som forgrener seg fra toppnivåvisningen.
pt: `ContentView` é a sua [visualização de nível superior](glossary://top-level%20view), a primeira visualização que o app mostra ao ser aberto. Ela fica no topo da [hierarquia de visualização](glossary://view%20hierarchy), que é uma coleção estruturada de [subvisualizações](glossary://subview) derivadas da visualização de nível superior.
sv: `ContentView` är [vyn på översta nivån](glossary://top-level%20view) och är den första vyn som appen visar när den öppnas. Den är överst i [vyhierarkin](glossary://view%20hierarchy) som är en strukturerad samling [delvyer](glossary://subview) som förgrenar sig från vyn på översta nivån.
th: `ContentView` เป็น[มุมมองระดับบนสุด](glossary://top-level%20view) ซึ่งเป็นมุมมองแรกที่แอปของคุณแสดงเมื่อมีการเปิดใช้แอป มุมมองนี้จะอยู่บนสุดของ[ลำดับชั้นมุมมอง](glossary://view%20hierarchy) ซึ่งเป็นคอลเลกชั่นแบบมีโครงสร้างของ[มุมมองย่อย](glossary://subview)ที่แตกแขนงออกไปจากมุมมองระดับบนสุดของคุณ
tr: `ContentView`, uygulamanın başlatıldığında görüntülediği ilk görüntü olan [üst düzey görüntündür](glossary://top-level%20view). Üst düzey görüntünden dallara ayrılan [alt görüntülerin](glossary://subview) yapısal bir koleksiyonu olan [görüntü hiyerarşinin](glossary://view%20hierarchy) en üstünde yer alır.
vi: `ContentView` là [chế độ xem cấp cao nhất](glossary://top-level%20view) của bạn, là chế độ xem đầu tiên mà ứng dụng của bạn hiển thị khi khởi chạy. Chế độ xem này nằm ở trên cùng của [phân cấp xem](glossary://view%20hierarchy), là một tập hợp có cấu trúc gồm các [chế độ xem phụ](glossary://subview) phân nhánh từ chế độ xem cấp cao nhất của bạn.
zh_cn: `ContentView`（内容视图）是[顶层视图](glossary://top-level%20view)，即 App 启动时显示的第一个视图。它位于[视图层次](glossary://view%20hierarchy)的顶部。视图层次是从顶层视图分支出来的[子视图](glossary://subview)的结构化集合。
zh_tw: `ContentView` 是你的[最上層顯示區](glossary://top-level%20view)，也就是你的 App 啟動時所顯示的第一個顯示區。它位於[顯示區階層](glossary://view%20hierarchy)的最上方，是從最上層顯示區分支出來的[子顯示區](glossary://subview)的結構化集合。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..Page79..Paragraph150
source: Try temporarily changing `ContentView` to some other view, such as a `Text` or `Image` view, then run your app. Notice that your app’s top-level view has changed – this is how you change what content your app shows.
de: Versuche, die `ContentView` vorübergehend in eine andere Ansicht zu ändern, z. B. in eine `Text`- oder `Image`-Ansicht. Führe anschließend die App aus. Hast du bemerkt, wie sich die oberste Ansicht deiner App geändert hat? So änderst du den Inhalt, den deine App anzeigt.
es: Prueba a cambiar temporalmente la vista de contenido (`ContentView`) a alguna otra vista, como una vista `Text` o `Image`, y ejecuta tu app. Observa que la vista de nivel superior de tu app ha cambiado: así es como se cambia el contenido que muestra tu app.
es_419: Para que veas lo que sucede, cambia temporalmente `ContentView` a otra visualización, como una `Text` o `Image`, y luego ejecuta tu app. Observa que la visualización principal de tu app ha cambiado; así es como se cambia el contenido que tu app muestra.
fr: Essaie de remplacer temporairement `ContentView` par une autre vue, telle qu’une vue `Text` ou `Image`, puis exécute ton app. Tu remarqueras que la vue au plus haut niveau de ton app a changé. C’est ainsi que tu modifies le contenu que montre ton app.
it: Prova a modificare temporaneamente `ContentView` in un'altra vista, come `Text` o `Image`, quindi esegui l'app. Vedrai che la vista di livello superiore della tua app è cambiata: hai appena imparato a modificare i contenuti che mostra l'app.
nl: Verander `ContentView` tijdelijk in een andere weergave, zoals een `Text`- of `Image`-weergave, en voer je app vervolgens uit. Zoals je ziet is de weergave op het hoogste niveau van je app gewijzigd. Dit is de manier waarop je de inhoud wijzigt die je app weergeeft.
no: Prøv å endre `ContentView` midlertidig til en annen visning, for eksempel en `Text`- eller `Image`-visning, og kjør deretter appen. Legg merke til at appens toppnivåvisning er endret – det er sånn du endrer hvilket innhold appen skal vise.
pt: Tente mudar temporariamente a `ContentView` para alguma outra visualização, como `Text` ou `Image`, e execute o app. Note que a visualização de nível superior do app mudou. É assim que se altera o conteúdo que o app mostra.
sv: Prova att tillfälligt ändra `ContentView` till någon annan vy, som en `Text`- eller `Image`-vy, och sedan köra appen. Lägg märke till att appens vy på översta nivån har förändrats – det är så här du ändrar vilket innehåll som appen ska visa.
th: ลองเปลี่ยน `ContentView` เป็นมุมมองอื่นแบบชั่วคราว เช่น มุมมอง `Text` หรือ `Image` จากนั้นรันแอปของคุณ สังเกตว่ามุมมองระดับบนสุดของแอปได้เปลี่ยนไปแล้ว ซึ่งนี่เป็นวิธีที่คุณเปลี่ยนเนื้อหาที่แอปแสดง
tr: `ContentView`’u geçici olarak `Text` veya `Image` görüntüsü gibi başka bir görüntüye değiştirmeyi dene, ardından uygulamanı çalıştır. Uygulamanın üst düzey görüntüsünün nasıl değiştiğine dikkat et; uygulamanın hangi içeriği göstereceğini de böyle değiştirirsin.
vi: Thử thay đổi tạm thời `ContentView` thành một chế độ xem nào đó khác, ví dụ như chế độ xem `Text` hoặc `Image`, sau đó chạy ứng dụng của bạn. Hãy lưu ý rằng chế độ xem cấp cao nhất của ứng dụng đã thay đổi – đây là cách bạn thay đổi nội dung mà ứng dụng hiển thị.
zh_cn: 尝试暂时将 `ContentView` 更改为一些其他视图，如 `Text` 或 `Image` 视图，然后运行你的 App。请注意，你 App 的顶层视图已经发生了变化，这是你更改 App 显示的内容的方式。
zh_tw: 嘗試暫時將 `ContentView` 更改為其他顯示區，例如 `Text` 或 `Image` 顯示區，然後執行你的 App。請注意，你的 App 的最上層顯示區已更改，這就是你更改 App 顯示內容的方式。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskmyApp..Page79..Paragraph151
source: When you’re ready, change your top-level view back to `ContentView`.
de: Wenn du fertig bist, ändere die oberste Ansicht wieder zurück in `ContentView`.
es: Cuando estés listo, vuelve a cambiar la vista de nivel superior a la vista de contenido (`ContentView`).
es_419: Cuando quieras continuar, regresa `"ContentView"` a la visualización principal.
fr: Lorsque tu es prêt, change ta vue au plus haut niveau pour revenir à `ContentView`.
it: Quando vuoi, imposta di nuovo la vista di livello superiore su `ContentView`.
nl: Verander de weergave op het hoogste niveau weer in `ContentView` als je klaar bent.
no: Endre toppnivåvisningen tilbake til `ContentView` når du er klar.
pt: Quando estiver pronto, mude a visualização de nível superior novamente para `ContentView`.
sv: Ändra vyn på översta nivån till `ContentView` igen när du är klar.
th: เมื่อคุณพร้อม ให้เปลี่ยนมุมมองระดับบนสุดของคุณกลับไปเป็น `ContentView`
tr: Hazır olduğunda üst düzey görüntünü yeniden `ContentView` olarak değiştir.
vi: Khi bạn đã sẵn sàng, hãy thay đổi chế độ xem cấp cao nhất trở lại thành `ContentView`.
zh_cn: 准备好后，将顶层视图更改回 `ContentView`。
zh_tw: 當你準備好時，將你的最上層顯示區改回 `ContentView`。

# GuideBook..Guide0..StepNavigating in SwiftUI..TaskaddNavView..title
source: Add a `NavigationStack` to your app
de: `NavigationStack` zur App hinzufügen
es: Añadir una pila de navegación (`NavigationStack`) a tu app
es_419: Agregar una pila `NavigationStack` a tu app
fr: Ajouter une `NavigationStack` à ton app
it: Aggiungere una `NavigationStack` alla tua app
nl: Een `NavigationStack` toevoegen aan je app
no: Legg til en `NavigationStack` i appen
pt: Adicione um `NavigationStack` ao app
sv: Lägg till en `NavigationStack` i appen
th: เพิ่ม `NavigationStack` ไปที่แอปของคุณ
tr: Uygulamana `NavigationStack` ekleme
vi: Thêm một `NavigationStack` vào ứng dụng của bạn
zh_cn: 将 `NavigationStack` 添加到 App
zh_tw: 在你的 App 中加入 `NavigationStack`

source: To display multiple views in your app, you’ll turn your [top-level view](glossary://top-level%20view) into a [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
de: Um in der App mehrere Ansichten anzuzeigen, muss die [oberste Ansicht](glossary://top-level%20view) in eine Instanz von [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) umgewandelt werden.
es: Para mostrar varias vistas en tu app, deberás convertir la [vista de nivel superior](glossary://top-level%20view) en una pila de navegación [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
es_419: Para mostrar varias visualizaciones en tu app, debes convertir tu [visualización principal](glossary://top-level%20view) en una pila de navegación ([NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack)).
fr: Pour afficher plusieurs vues dans ton app, tu vas transformer ta [vue au plus haut niveau](glossary://top-level%20view) en une [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
it: Per visualizzare più viste nell'app, dovrai trasformare la tua [vista di livello superiore](glossary://top-level%20view) in una vista [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
nl: Om meerdere weergaven in je app weer te geven, ga je je [weergave op het hoogste niveau](glossary://top-level%20view) veranderen in een [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
no: Du kan vise flere visninger i appen ved å gjøre [toppnivåvisningen](glossary://top-level%20view) om til en [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
pt: Para mostrar várias visualizações no app, você transformará a [visualização de nível superior](glossary://top-level%20view) em um [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
sv: Du kan visa flera vyer i appen genom att omvandla [vyn på översta nivån](glossary://top-level%20view) till en [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
th: ในการแสดงหลายมุมมองในแอปของคุณ คุณจะต้องเปลี่ยน[มุมมองระดับบนสุด](glossary://top-level%20view)ของคุณให้เป็น [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack)
tr: Uygulamanda birden fazla görüntü göstermek için [üst düzey görüntünü](glossary://top-level%20view) bir [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) öğesine dönüştüreceksin.
vi: Để hiển thị nhiều chế độ xem trong ứng dụng của mình, bạn sẽ chuyển đổi [chế độ xem cấp cao nhất](glossary://top-level%20view) thành một [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack).
zh_cn: 若要在 App 中显示多个视图，你要将[顶层视图](glossary://top-level%20view)转为 [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack)。
zh_tw: 若要在你的 App 中顯示多個顯示區，你需要將[最上層顯示區](glossary://top-level%20view)轉換成 [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack)。

source: Add a `NavigationStack` inside the `SPCAssessableWindowGroup` of the app `body`:
de: Füge `NavigationStack` innerhalb von `SPCAssessableWindowGroup` (zugängliche SPC-Fenstergruppe) im `body`-Bereich deiner App ein:
es: Añade una pila de navegación (`NavigationStack`) dentro de `SPCAssessableWindowGroup` del cuerpo (`body`) de la app:
es_419: Agrega una visualización `NavigationView` dentro de `SPCAssessableWindowGroup` en el `body` (cuerpo) de la app:
fr: Ajoute une `NavigationStack` à l’intérieur du `SPCAssessableWindowGroup` du `body` de l’app :
it: Aggiungi una vista `NavigationStack` all'interno di `SPCAssessableWindowGroup` nel `body` dell'app:
nl: Voeg een `NavigationStack` toe in de `SPCAssessableWindowGroup` van de `body` van de app:
no: Legg til en `NavigationStack` inni `SPCAssessableWindowGroup` i appens `body`:
pt: Adicione um `NavigationStack` dentro de `SPCAssessableWindowGroup` do `body` do app:
sv: Lägg till en `NavigationStack` inuti `SPCAssessableWindowGroup` i appens `body`:
th: เพิ่ม `NavigationStack` ภายใน `SPCAssessableWindowGroup` ของ `body` ของแอป:
tr: Uygulama gövdesindeki (`body`) `SPCAssessableWindowGroup` içine bir `NavigationStack` ekle:
vi: Thêm một `NavigationStack` bên trong `SPCAssessableWindowGroup` của `body` ứng dụng:
zh_cn: 在 App `body` 的 `SPCAssessableWindowGroup` 内添加一个 `NavigationStack`：
zh_tw: 將 `NavigationStack` 放入 App `body` 的 `SPCAssessableWindowGroup` 內：

source: Place your `ContentView` inside of the `NavigationStack`.
de: Platziere `ContentView` in `NavigationStack`.
es: Coloca tu vista de contenido (`ContentView`) dentro de la pila de navegación (`NavigationStack`).
es_419: Coloca tu visualización `ContentView` dentro de `NavigationStack`.
fr: Place ta `ContentView` à l’intérieur de la `NavigationStack`.
it: Inserisci `ContentView` all'interno di `NavigationStack`.
nl: Plaats je `ContentView` in de `NavigationStack`.
no: Plasser `ContentView` inni `NavigationStack`.
pt: Coloque a `ContentView` dentro do `NavigationStack`.
sv: Placera `ContentView` inuti `NavigationStack`.
th: วาง `ContentView` ภายใน `NavigationStack`
tr: `ContentView`’unu `NavigationStack`’in içine yerleştir.
vi: Đặt `ContentView` của bạn bên trong `NavigationStack`.
zh_cn: 将 `ContentView` 放置在 `NavigationStack` 内。
zh_tw: 將你的 `ContentView` 放入 `NavigationStack` 內。

source: The first view placed inside the `NavigationStack` displays the initial content. This content can change whenever you use a [navigation link](glossary://navigation%20link) to display a new view.
de: Die erste Ansicht, die in `NavigationStack` platziert wurde, zeigt den Ausgangsinhalt an. Dieser Inhalt kann sich jederzeit ändern, wenn du einen [Navigations-Link](glossary://navigation%20link) zum Anzeigen einer neuen Ansicht verwendest.
es: La primera vista incluida dentro de la pila de navegación (`NavigationStack`) muestra el contenido inicial. Este contenido puede cambiar cada vez que se utilice un [enlace de navegación](glossary://navigation%20link) para mostrar una nueva vista.
es_419: La primera visualización que coloques dentro de `NavigationStack` muestra el contenido inicial, el cual puede cambiar cada vez que se use un [enlace de navegación](glossary://navigation%20link) para mostrar una visualización distinta.
fr: La première vue placée à l’intérieur de la `NavigationStack` s’affiche comme contenu initial. Ce contenu peut changer lorsque tu utilises un [lien de navigation](glossary://navigation%20link) pour afficher une nouvelle vue.
it: La prima vista posizionata all'interno di `NavigationStack` mostrerà il contenuto iniziale. Questo potrà cambiare ogni volta che usi un [link di navigazione](glossary://navigation%20link) per visualizzare una nuova vista.
nl: De eerste weergave die je in de `NavigationStack` toevoegt, fungeert als de begininhoud. Deze inhoud kan elke keer veranderen wanneer je een [navigatielink](glossary://navigation%20link) gebruikt om een nieuwe weergave te tonen.
no: Den første visningen som plasseres inni `NavigationStack`, viser det innledende innholdet. Dette innholdet kan endres hver gang du bruker en [navigeringslenke](glossary://navigation%20link) til å vise en ny visning.
pt: A primeira visualização colocada dentro do `NavigationStack` mostra o conteúdo inicial. Esse conteúdo pode mudar sempre que você usar um [link de navegação](glossary://navigation%20link) para mostrar uma nova visualização.
sv: Den första vyn som placeras inuti `NavigationStack` visar det inledande innehållet. Det här innehållet kan ändras varje gång du använder en [navigeringslänk](glossary://navigation%20link) till att visa en ny vy.
th: มุมมองแรกที่วางภายใน `NavigationStack` จะแสดงเป็นเนื้อหาเริ่มต้น เนื้อหานี้สามารถเปลี่ยนแปลงได้ทุกครั้งที่คุณใช้[ลิงก์การนำทาง](glossary://navigation%20link)เพื่อแสดงมุมมอง
tr: `NavigationStack`’in içine yerleştirilen ilk görüntü ilk içeriği görüntüler. Bu içerik, yeni bir görüntüyü görüntülemek için bir [dolaşma bağlantısı](glossary://navigation%20link) kullandığın her an değişebilir.
vi: Chế độ xem đầu tiên được đặt bên trong `NavigationStack` hiển thị nội dung ban đầu. Nội dung này có thể thay đổi bất kỳ lúc nào bạn sử dụng một [liên kết điều hướng](glossary://navigation%20link) để hiển thị một chế độ xem mới.
zh_cn: 放置在 `NavigationStack` 内的第一个视图会显示初始内容。这个内容可以在你使用[导航链接](glossary://navigation%20link)显示新视图时随时更改。
zh_tw: 放在 `NavigationStack` 內的第一個顯示區會顯示初始內容。此內容可以在你使用[導覽連結](glossary://navigation%20link)顯示新的顯示區時隨時更改。
