Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..Guide0..StepAdd a `CreatureDetail` view..SuccessMessage..Paragraph335
source: You’ve successfully completed this tutorial, but you’ve only just begun your journey in building apps. The more you apply the concepts you’ve learned, the better you’ll remember them — and the more apps you’ll be able to create. In the next experiments, try using everything you’ve learned in this tutorial to write some of your own examples. Good luck!
de: Du hast die Anleitung erfolgreich abgeschlossen. Du stehst allerdings erst am Anfang deiner Reise, das Erstellen von Apps zu lernen. Je öfter du die gelernten Konzepte anwendest, desto leichter fällt es dir, sie dir zu merken – und desto mehr Apps kannst du erstellen. Versuche in den nächsten Experimenten, die in dieser Anleitung gelernten Fähigkeiten zu nutzen, um ein paar eigene Beispiele zu schreiben. Viel Glück!
es: Has completado este tutorial correctamente, pero no has hecho más que empezar tu viaje de creación de apps. Cuanto más intentes aplicar los conceptos que has aprendido, mejor los recordarás (y más apps podrás crear). En los próximos experimentos, prueba a utilizar todo lo que has aprendido en este tutorial para escribir algunos ejemplos propios. ¡Buena suerte!
es_419: Completaste con éxito este tutorial, pero esto es solo el comienzo de tu viaje en la construcción de apps. Entre más apliques los conceptos que aprendiste, mejor los recordarás y podrás crear más apps. En los próximos experimentos, intenta usar todo lo que aprendiste en este tutorial para escribir algunos de tus propios ejemplos. ¡Buena suerte!
fr: Tu as terminé ce tutoriel avec succès, mais tu n’as fait que commencer ton périple de la création d’apps. Plus tu appliqueras les concepts que tu as appris, mieux tu t’en souviendras et plus tu seras capable de créer des apps. Dans les expériences suivantes, essaie d’utiliser tout ce que tu as appris dans ce tutoriel pour rédiger tes propres exemples. Bonne chance !
it: Hai appena completato questo tutorial, ma il tuo viaggio nella creazione delle app è appena iniziato. Quanto più metterai in pratica i concetti che hai imparato, tanto più te li ricorderai e sarai in grado di creare tantissime app. Nei prossimi esercizi, prova a mettere in pratica tutto quello che hai imparato in questo tutorial e a scrivere alcuni esempi originali di tuo pugno. In bocca al lupo!
nl: Je hebt deze zelfstudie voltooid, maar over het bouwen van apps kun je nog veel meer leren. Als je de concepten die je hebt geleerd zo vaak mogelijk toepast, onthoud je ze beter en kun je nog meer apps maken. In de volgende experimenten breng je alles wat je in deze zelfstudie hebt geleerd in de praktijk door zelf je eigen voorbeelden te schrijven. Succes!
no: Du har fullført denne opplæringen, men du har såvidt begynt på appbyggingsreisen din. Jo mer du bruker konseptene du har lært, desto bedre husker du dem, og desto flere apper kan du lage. I de neste eksperimentene skal du forsøke å bruke alt du har lært i denne opplæringen til å skrive noen egne eksempler. Lykke til!
pt: Você concluiu este tutorial com sucesso, mas esse foi apenas o começo da sua jornada na criação de apps. Quanto mais você aplicar os conceitos aprendidos, melhor você se lembrará deles e mais apps poderá criar. Nos próximos experimentos, tente usar tudo o que você aprendeu neste tutorial para escrever alguns exemplos seus. Boa sorte!
sv: Du har slutfört det här övningsexemplet, men du har bara påbörjat din appbyggarresa. Ju mer du använder koncepten du har lärt dig, desto bättre kommer du ihåg dem och desto fler appar kan du skapa. I de kommande experimenten ska du försöka använda allt du har lärt dig i det här övningsexemplet till att skriva några egna exempel. Lycka till!
th: คุณได้ทำตามคู่มือสอนใช้งานนี้เสร็จแล้ว แต่คุณเพิ่งเริ่มต้นเส้นทางการสร้างแอปของคุณเท่านั้น ยิ่งคุณได้ลองปรับใช้แนวคิดที่คุณเรียนรู้มามากขึ้น คุณจะยิ่งจดจำแนวคิดเหล่านั้นได้มากขึ้น และคุณจะสามารถสร้างแอปได้มากขึ้น ในการทดลองต่อไป คุณสามารถลองใช้ทุกอย่างที่คุณได้เรียนรู้ในคู่มือสอนใช้งานนี้เพื่อเขียนตัวอย่างของคุณเองได้ โชคดีนะ!
tr: Bu öğreticiyi başarıyla tamamladın ancak uygulama geliştirme yolculuğuna henüz yeni başladın. Öğrendiğin kavramları uyguladıkça onları daha iyi anımsayacak ve daha fazla uygulama yaratabileceksin. Sıradaki denemelerde, kendi örneklerinden bazılarını yazmak için bu öğreticide öğrendiğin her şeyi kullanmayı dene. İyi şanslar!
vi: Bạn đã hoàn thành phần hướng dẫn này thành công, nhưng bạn chỉ mới bắt đầu hành trình xây dựng các ứng dụng của mình. Bạn càng áp dụng các khái niệm đã học thường xuyên thì bạn càng ghi nhớ chúng tốt hơn – và bạn sẽ càng tạo ra được nhiều ứng dụng hơn. Trong các thử nghiệm tiếp theo, hãy cố gắng sử dụng mọi thứ mà bạn đã học trong phần hướng dẫn này để viết ra một vài ví dụ của bạn. Chúc bạn may mắn!
zh_cn: 你成功完成了这个教程，但在构建 App 的道路上你才刚刚起步。经常运用学到的概念，才能更好地记住，以及创建更多的 App。在接下来的试验中，试着使用在这个教程中学到的所有知识，编写一些属于自己的示例。祝你好运！
zh_tw: 你已經成功完成本教學，但你才剛剛開始建構 App。你應用愈多所學的概念，就愈能記住它們，並且能夠製作更多的 App。在接下來的實驗中，請嘗試使用在本教學中學到的所有內容來編寫自己的範例。祝你好運！

# GuideBook..Guide0..StepCreate on Your Own..title
source: Create on Your Own
de: Auf eigene Faust erstellen
es: Crear la tuya propia
es_419: Crear por tu cuenta
fr: Créer par toi-même
it: Inizia a creare in modo autonomo
nl: Zelf maken
no: Opprett på egen hånd
pt: Crie por Conta Própria
sv: Skapa på egen hand
th: สร้างด้วยตัวคุณเอง
tr: Kendininkini Yarat
vi: Tự mình tạo ra
zh_cn: 自己创作
zh_tw: 自己創作

# GuideBook..Guide0..StepCreate on Your Own..LearningCenterContent..Paragraph337
source: Now that you’ve completed your journey learning about state and data flow, it’s time for you to unlease your creativity to create a new view that uses your creature data.
de: Status und Datenfluss hast du bereits kennengelernt. Jetzt ist es an der Zeit, deiner Kreativität freien Lauf zu lassen und mit den Daten der Charaktere eine neue Ansicht zu erstellen.
es: Ahora que has completado tu aventura aprendiendo sobre el estado y el flujo de datos, es el momento de dar rienda suelta a tu creatividad y crear una nueva vista que use los datos de tu criatura.
es_419: Ahora que aprendiste sobre los estados y los flujos de los datos, es hora de liberar tu creatividad y de crear una nueva visualización que use los datos de tus criaturas.
fr: Maintenant que tu as terminé ton voyage d’apprentissage sur l’état et les flux de données, il est temps pour toi de laisser libre cours à ta créativité et de créer une nouvelle vue qui utilise tes données de créature.
it: Adesso che hai portato a termine il viaggio alla scoperta dello stato e del flusso di dati, è arrivato il momento di dare sfogo alla tua creatività per creare una nuova vista che utilizza i dati della tua creatura.
nl: Nu je alles weet over status en gegevensstromen, is het tijd voor je om je creativiteit vrij baan te geven en een nieuwe weergave te ontwerpen die de gegevens van je wezens gebruikt.
no: Nå når du har lært det du skal om status og dataflyt, er det på tide å slippe løs kreativiteten og lage en ny visning som bruker skapningsdataene.
pt: Agora que você concluiu a jornada de aprendizado sobre estado e fluxo de dados, chegou a hora de soltar a criatividade para criar uma nova visualização que use os dados da criatura.
sv: Nu när du har lärt dig det du ska om status och dataflöde är det dags för dig att släppa loss din kreativitet och skapa en ny vy som använder dina varelsedata.
th: ตอนนี้เมื่อคุณได้เรียนรู้เกี่ยวกับสถานะและลำดับข้อมูลแล้ว ก็ถึงเวลาที่คุณจะปลดปล่อยความคิดสร้างสรรค์ของคุณเพื่อสร้างมุมมองใหม่ที่ใช้ข้อมูลสิ่งมีชีวิตของคุณ
tr: Durum ve veri akışı hakkında bilgi edinme maceranı tamamladığına göre yaratık verilerini kullanan yeni bir görüntü yaratmak için yaratıcılığını serbest bırakmanın zamanı geldi.
vi: Bây giờ bạn đã hoàn thành hành trình tìm hiểu về trạng thái và luồng dữ liệu, đã đến lúc bạn giải phóng khả năng sáng tạo của mình để tạo ra một chế độ xem mới sử dụng dữ liệu sinh vật của bạn.
zh_cn: 现在你已经完成了状态和数据流的学习之旅，是时候释放你的想象力，使用动物数据来创建新的视图。
zh_tw: 現在你已經完成了關於狀態和資料流的學習之旅，是時候釋放你的創造力來建立一個使用你的生物資料的新顯示區了。

# GuideBook..Guide0..StepCreate on Your Own..LearningCenterContent..Paragraph338
source: When you’re done with the experiments here, try creating your own project from scratch using the same concepts you’ve learned in this tutorial.
de: Wenn du mit dem Experimentieren fertig bist, versuche, mit den Konzepten, die du in dieser Anleitung gelernt hast, ein komplett neues Projekt zu erstellen.
es: Cuando hayas terminado con los experimentos aquí, prueba a crear tu propio proyecto desde cero, utilizando los mismos conceptos que has aprendido en este tutorial.
es_419: Una vez que hayas completado estos experimentos, intenta crear tu propio proyecto desde cero, usando los mismos conceptos que has aprendido en este tutorial.
fr: Lorsque tu as terminé les expériences présentées ici, essaie de créer ton propre projet à partir de zéro, en utilisant les mêmes concepts que ceux que tu as appris dans ce tutoriel.
it: Una volta che avrai completato gli esercizi di questo modulo, prova a creare un progetto completamente nuovo, utilizzando gli stessi concetti che hai imparato in questa guida.
nl: Als je klaar bent met deze experimenten, kun je zelf je eigen project gaan maken met behulp van de concepten die je in deze zelfstudie hebt geleerd.
no: Når du er ferdig med eksperimentene her, kan du prøve å lage ditt eget prosjekt fra bunnen av ved å bruke de samme konseptene som du har lært i denne opplæringen.
pt: Quando terminar todos os experimentos aqui, tente criar o seu próprio projeto desde o início com os mesmos conceitos que você aprendeu neste tutorial.
sv: När du är klar med experimenten här kan du försöka skapa dina egna projekt från grunden med hjälp av samma koncept som du har lärt dig i det här övningsexemplet.
th: เมื่อคุณทำการทดลองในส่วนนี้เสร็จแล้ว ให้ลองสร้างโปรเจ็กต์ของคุณเองตั้งแต่ต้นโดยใช้แนวคิดเดียวกันกับที่คุณได้เรียนรู้ในคู่มือสอนใช้งานนี้
tr: Burada denemeleri tamamladığında, bu öğreticide öğrendiğin kavramların aynısını kullanarak sıfırdan kendi projeni yaratmayı dene.
vi: Khi bạn hoàn tất các thử nghiệm tại đây, hãy cố gắng tạo ra dự án của riêng mình từ đầu bằng cách sử dụng cùng các khái niệm mà bạn đã học được trong phần hướng dẫn này.
zh_cn: 完成这里的试验后，尝试使用你在这个教程中学到的相同概念，从头开始创建自己的项目。
zh_tw: 當你完成此處的實驗後，請試著使用你在本教學中學習到的相同概念，從頭開始建立自己的計畫案。

# GuideBook..Guide0..StepCreate on Your Own..TaskcreateYourOwn..title
source: Create your Own View
de: Eigene Ansicht erstellen
es: Crear tu propia vista
es_419: Crear tu propia vista
fr: Créer ta propre vue
it: Creare la tua vista
nl: Je eigen weergave aanmaken
no: Opprett din egen visning
pt: Crie sua Própria Visualização
sv: Skapa en egen vy
th: สร้างมุมมองของคุณเอง
tr: Kendi Görüntünü Yarat
vi: Tạo ra chế độ xem của riêng bạn
zh_cn: 创建自己的视图
zh_tw: 製作你自己的顯示區

source: Things to try:
de: Das solltest du ausprobieren:
es: Cosas a probar:
es_419: Intenta lo siguiente:
fr: Choses à essayer :
it: Suggerimenti da provare:
nl: Dingen die je kunt proberen:
no: Ting du kan prøve:
pt: Tente isto:
sv: Saker du kan prova:
th: สิ่งที่ควรลอง:
tr: Denenebilecekler:
vi: Những việc nên thử:
zh_cn: 要尝试的内容：
zh_tw: 要嘗試的事項：

source: Create a new view that uses your `creatures` array and link to it as a destination in `ContentView`.
de: Erstelle eine neue Ansicht, die das Array `creatures` verwendet, und verknüpfe sie als Ziel in `ContentView`.
es: Crea una nueva vista que utilice tu vector de criaturas (`creatures`) y enlázala como destino en la vista de contenido (`ContentView`).
es_419: Crea una nueva visualización que use tu arreglo de `creatures`, y enlázala como un destino en la visualización `ContentView`.
fr: Crée une nouvelle vue qui utilise ton tableau `creatures` et associe-la à une destination dans `ContentView`.
it: Crea una nuova vista che utilizza l'array `creatures` e aggiungi un link a esso come destinazione in `ContentView`.
nl: Maak een nieuwe weergave aan waarin de array `creatures` wordt gebruikt en maak een link naar deze weergave aan in `ContentView`.
no: Opprett en ny visning som bruker matrisen `creatures`, og opprett en lenke til den som et mål i `ContentView`.
pt: Crie uma nova visualização que use o vetor `creatures` e vincule‑o como um destino em `ContentView`.
sv: Skapa en ny vy som använder arrayen `creatures` och länka till den som ett mål i `ContentView`.
th: สร้างมุมมองใหม่ที่ใช้อาร์เรย์ `creatures` ของคุณและลิงก์ไปที่มุมมองนั้นเป็นปลายทางใน `ContentView`
tr: `creatures` dizisini kullanan yeni bir görüntü yarat ve `ContentView`’da hedef olarak buna bağla.
vi: Tạo ra một chế độ xem mới sử dụng dãy `creatures` của bạn và liên kết đến chế độ đó dưới dạng đích trong `ContentView`.
zh_cn: 创建一个使用 `creatures` 数组的新视图，并将它作为 `ContentView` 中的目的位置链接。
zh_tw: 製作一個使用你的 `creatures` 陣列的新顯示區，並將其作為 `ContentView` 中的目標連結。

source: Add a new [published value](glossary://published%20value) to `CreatureZoo` and use it in one or more of your existing views.
de: Füge einen neuen [veröffentlichten Wert](glossary://published%20value) zu `CreatureZoo` hinzu und verwende ihn in einer oder in mehreren vorhandenen Ansichten.
es: Añade un nuevo [valor publicado](glossary://published%20value) a `CreatureZoo` y úsalo en una o más de las vistas existentes.
es_419: Agrega un nuevo [valor publicado](glossary://published%20value) a `CreatureZoo` y úsalo en una o varias visualizaciones existentes.
fr: Ajoute une nouvelle [valeur publiée](glossary://published%20value) à `CreatureZoo` et utilise-la dans une ou plusieurs vues existantes.
it: Aggiungi un nuovo [valore pubblicato](glossary://published%20value) a `CreatureZoo` e utilizzalo in una o più delle tue viste esistenti.
nl: Voeg een nieuwe [gepubliceerde waarde](glossary://published%20value) naar `CreatureZoo` toe en gebruik deze in een of meer van je bestaande weergaven.
no: Opprett en ny [publisert verdi](glossary://published%20value) i `CreatureZoo`, og bruk den i én eller flere eksisterende visninger.
pt: Adicione um novo [valor publicado](glossary://published%20value) a `CreatureZoo` e use‑o em uma ou mais das visualizações existentes.
sv: Lägg till ett nytt [publicerat värde](glossary://published%20value) i `CreatureZoo` och använd det i en eller flera befintliga vyer.
th: เพิ่ม[ค่าที่เผยแพร่](glossary://published%20value)ค่าใหม่ไปยัง `CreatureZoo` และใช้ในมุมมองที่มีอยู่แล้วของคุณอย่างน้อยหนึ่งมุมมอง
tr: `CreatureZoo`’ya yeni bir [yayımlanan değer](glossary://published%20value) ekle ve bunu var olan görüntülerinin birinde ya da birden fazlasında kullan.
vi: Thêm một [giá trị đã đăng](glossary://published%20value) mới vào `CreatureZoo` và sử dụng giá trị đó trong một hoặc nhiều chế độ xem hiện có của bạn.
zh_cn: 将一个新的[发布值](glossary://published%20value)添加到 `CreatureZoo`，并在一个或多个现有视图中使用它。
zh_tw: 將一個新的[發佈的數值](glossary://published%20value)加入 `CreatureZoo`，並且在你現有的一或多個顯示區中使用它。

source: Give each creature a `description` property, and create a new view that displays their descriptions, names, and images in a fun layout.
de: Weise jedem Charakter die Eigenschaft `description` (Beschreibung) zu und erstelle eine neue Ansicht, mit der du ihre Beschreibungen, Namen und Bilder in einem schönen Layout darstellen kannst.
es: Dale a cada criatura una propiedad `description` y crea una nueva vista que muestre sus descripciones, nombres e imágenes en una disposición divertida.
es_419: Asigna a cada criatura una propiedad `description`, y crea una nueva visualización que muestre sus descripciones, nombres e imágenes en un diseño divertido.
fr: Attribue une propriété `description` à chacune de tes créatures, et crée une nouvelle vue qui affiche leur description, leur nom et leur image dans une disposition amusante.
it: Assegna a ciascuna creatura una proprietà `description` e crea una nuova vista che mostra le loro descrizioni, nomi e immagini in un layout divertente.
nl: Ken aan elk wezen de eigenschap `description` toe en maak een nieuwe weergave aan waarin de beschrijvingen, namen en afbeeldingen van de wezens in een leuke lay-out worden weergegeven.
no: Gi hver skapning en `description`-egenskap, og opprett en ny visning som viser beskrivelsene, navnene og bildene deres i en morsom layout.
pt: Dê a cada criatura uma propriedade `description` e crie uma nova visualização mostre suas descrições, nomes e imagens em um layout divertido.
sv: Ge varje varelse en `description`-egenskap och skapa en ny vy som visar deras beskrivningar, namn och bilder i en rolig layout.
th: ใส่คุณสมบัติ `description` ให้กับสิ่งมีชีวิตแต่ละตัว แล้วสร้างมุมมองใหม่ที่แสดงคำอธิบาย ชื่อ และภาพของสิ่งมีชีวิตเหล่านั้นในเค้าโครงที่น่าสนใจ
tr: Her yaratığa bir `description` özelliği ver ve açıklamalarını, adlarını ve görüntülerini eğlenceli bir yerleşimde görüntüleyen yeni bir görüntü yarat.
vi: Cung cấp cho mỗi sinh vật một thuộc tính `description` và tạo ra một chế độ xem mới hiển thị mô tả, tên và hình ảnh của chúng trong một bố cục thú vị.
zh_cn: 为每个动物提供一个 `description`（描述）属性，并创建一个新视图，在有趣的布局中展示它们的描述、名称和图像。
zh_tw: 為每個生物指定一個 `description` 屬性並且製作一個新的顯示區，以有趣的佈局顯示它們的描述、名稱和影像。

# GuideBook..Guide0..StepCreate on Your Own..TaskcreateNewApp..title
source: Create your own app
de: Eigene App erstellen
es: Crear tu propia app
es_419: Crear tu propia app
fr: Créer ta propre app
it: Creare la tua app
nl: Je eigen app maken
no: Opprett din egen app
pt: Crie o seu próprio app
sv: Skapa en egen app
th: สร้างแอปของคุณเอง
tr: Kendi uygulamanı yaratma
vi: Tạo ra ứng dụng của riêng bạn
zh_cn: 创建自己的 App
zh_tw: 製作你自己的 App
