Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: To add a new creature, you’ll need to do two things:
de: Um einen neuen Charakter hinzuzufügen, musst du zwei Dinge tun:
es: Para añadir una nueva criatura, tendrás que hacer dos cosas:
es_419: Para agregar una criatura, necesitarás hacer dos cosas:
fr: Pour ajouter une nouvelle créature, tu dois faire deux choses :
it: Per aggiungere una nuova creatura, dovrai completare due azioni:
nl: Om een nieuw wezen toe te voegen, moet je twee dingen doen:
no: Du må gjøre to ting når du vil legge til en ny skapning:
pt: Para adicionar uma nova criatura, você precisa fazer duas coisas:
sv: Du måste göra två saker när du vill lägga till en ny varelse:
th: ในการเพิ่มสิ่งมีชีวิตใหม่ คุณจะต้องทำสองสิ่ง:
tr: Yeni bir yaratık eklemek için iki şey yapman gerekecek:
vi: Để thêm một sinh vật mới, bạn sẽ cần thực hiện hai việc:
zh_cn: 若要添加新动物，你需要做两件事：
zh_tw: 若要加入新的生物，你需做兩件事：

source: Add `CreatureEditor` to your [view hierarchy](glossary://view%20hierarchy) using a `NavigationLink`. This gives `CreatureEditor` access to your `CreatureZoo` environment object and allows a person to navigate to the view.
de: Füge `CreatureEditor` mit einem `NavigationLink` zur [Ansichtenhierarchie](glossary://view%20hierarchy) hinzu. So kann `CreatureEditor` auf das Umgebungsobjekt `CreatureZoo` zugreifen und die Benutzer:innen können zur Ansicht navigieren.
es: Añade `CreatureEditor` a la [jerarquía de vistas](glossary://view%20hierarchy) con un enlace de navegación (`NavigationLink`). Esto permite que `CreatureEditor` acceda al objeto de entorno de `CreatureZoo` y permite a la persona navegar hasta la vista.
es_419: Agrega una visualización `CreatureEditor` a tu [jerarquía de visualizaciones](glossary://view%20hierarchy) mediante un enlace `NavigationLink`. Esto permitirá que `CreatureEditor` tenga acceso al objeto de entorno `CreatureZoo` y que un usuario pueda navegar hasta la visualización.
fr: Ajoute `CreatureEditor` à ta [hiérarchie de vue](glossary://view%20hierarchy) à l’aide d’un `NavigationLink`. Cela donne à `CreatureEditor` un accès à l’objet d’environnement `CreatureZoo` et permet à une personne de naviguer jusqu’à la vue.
it: Aggiungi `CreatureEditor` alla tua [gerarchia di viste](glossary://view%20hierarchy) utilizzando un `NavigationLink`. In questo modo `CreatureEditor` avrà accesso all'oggetto ambiente `CreatureZoo` e sarà possibile navigare verso la vista.
nl: Voeg `CreatureEditor` aan je [weergavehiërarchie](glossary://view%20hierarchy) toe via een `NavigationLink`. Hiermee geef je `CreatureEditor` toegang tot je `CreatureZoo`-omgevingsobject en kunnen gebruikers naar de weergave navigeren.
no: Legg til `CreatureEditor` i [visningshierarkiet](glossary://view%20hierarchy) med en `NavigationLink`. Dette gir `CreatureEditor` tilgang til `CreatureZoo`-miljøobjektet og tillater at en person navigerer til visningen.
pt: Adicione `CreatureEditor` à [hierarquia de visualizações](glossary://view%20hierarchy) com um `NavigationLink`. Isso permite que `CreatureEditor` acesse o objeto de ambiente `CreatureZoo` e que uma pessoa navegue para a visualização.
sv: Lägg till `CreatureEditor` i [vyhierarkin](glossary://view%20hierarchy) med en `NavigationLink`. Det här ger `CreatureEditor` tillgång till `CreatureZoo`-miljöobjektet och tillåter att en person navigerar till vyn.
th: เพิ่ม `CreatureEditor` ไปยัง[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)ของคุณโดยใช้ `NavigationLink` ซึ่งจะทำให้ `CreatureEditor` เข้าถึงวัตถุสภาพแวดล้อม `CreatureZoo` ของคุณได้ และช่วยให้คนอื่นนำทางไปยังมุมมองได้
tr: Bir `NavigationLink` kullanarak [görüntü hiyerarşine](glossary://view%20hierarchy) `CreatureEditor` ekle. Bu `CreatureEditor`’ın `CreatureZoo` ortam nesnene erişmesini sağlar ve kişinin görüntüde dolaşmasına izin verir.
vi: Thêm `CreatureEditor` vào [phân cấp xem](glossary://view%20hierarchy) của bạn bằng một `NavigationLink`. Việc này cung cấp cho `CreatureEditor` quyền truy cập vào đối tượng môi trường `CreatureZoo` của bạn và cho phép một người điều hướng đến chế độ xem.
zh_cn: 使用 `NavigationLink` 将 `CreatureEditor`（动物编辑器）添加到[视图层次](glossary://view%20hierarchy)。这可让 `CreatureEditor` 访问 `CreatureZoo` 环境对象，并可让用户导航到视图。
zh_tw: 使用 `NavigationLink` 將 `CreatureEditor` 加入你的[顯示區階層](glossary://view%20hierarchy)。這能讓 `CreatureEditor` 取用你的 `CreatureZoo` 環境物件，並允許使用者導覽至顯示區。

source: [Compose](glossary://composed%20view) the `CreatureEditor` view to allow a person to edit and add a new creature to the `creatures` array in `CreatureZoo`.
de: Erstelle die [Ansicht](glossary://composed%20view) `CreatureEditor` (Charakterbearbeitung), in der Charaktere bearbeitet werden können und neue zum Array `creatures` in `CreatureZoo` hinzugefügt werden können.
es: Puedes [componer](glossary://composed%20view) la vista `CreatureEditor` para permitir que una persona pueda editar y añadir una nueva criatura al vector `creatures` en `CreatureZoo`.
es_419: [Compón](glossary://composed%20view) la visualización `CreatureEditor` para permitir que una persona edite y agregue una criatura nueva al arreglo `creatures` en `CreatureZoo`.
fr: [Compose](glossary://composed%20view) la vue `CreatureEditor` pour permettre à une personne de modifier et d’ajouter une créature au tableau `creatures` dans `CreatureZoo`.
it: [Componi](glossary://composed%20view) la vista `CreatureEditor` in modo da consentire a una persona di modificare e aggiungere una nuova creatura al tuo array `creatures` in `CreatureZoo`.
nl: Maak de [samengestelde](glossary://composed%20view) weergave `CreatureEditor` aan zodat de [gebruiker](glossary://user) wezens kan bewerken en nieuwe wezens kan toevoegen aan de array `creatures` in `CreatureZoo`.
no: [Sammenstill](glossary://composed%20view) visningen `CreatureEditor` så en person kan redigere og legge til en ny skapning i matrisen `creatures` i `CreatureZoo`.
pt: [Componha](glossary://composed%20view) a visualização `CreatureEditor` para permitir que uma pessoa edite e adicione uma nova criatura ao vetor `creatures` em `CreatureZoo`.
sv: [Sammanställ](glossary://composed%20view) vyn `CreatureEditor` så att en person kan redigera och lägga till en ny varelse i arrayen `creatures` i `CreatureZoo`.
th: [เขียน](glossary://composed%20view)มุมมอง `CreatureEditor` เพื่อให้คนอื่นสามารถแก้ไขและเพิ่มสิ่งมีชีวิตใหม่ไปยังอาร์เรย์ `creatures` ใน `CreatureZoo` ได้
tr: Bir kişinin `CreatureZoo`’daki `creatures` dizisini düzenlemesine ve buraya yeni bir yaratık eklemesine izin vermek için `CreatureEditor` görüntüsünü [oluştur](glossary://composed%20view).
vi: [Biên soạn](glossary://composed%20view) chế độ xem `CreatureEditor` để cho phép một người sửa và thêm một sinh vật mới vào dãy `creatures` trong `CreatureZoo`.
zh_cn: [组合](glossary://composed%20view) `CreatureEditor` 视图以允许用户编辑动物，以及将新动物添加到 `CreatureZoo` 中的 `creatures` 数组。
zh_tw: [組合](glossary://composed%20view) `CreatureEditor` 顯示區來允許使用者編輯和加入新的生物到 `CreatureZoo` 中的 `creatures` 陣列。

source: Start by deciding where to add a `NavigationLink` to `CreatureEditor`. Because you already have a `List` view of creatures that you can delete from in `ContentView`, it makes sense to add a creature from the same view.
de: Überlege als Erstes, wo du den `NavigationLink` zu `CreatureEditor` hinzufügen musst. Da du bereits die Ansicht `List` der löschbaren Charaktere in `ContentView` hast, ist es sinnvoll, einen Charakter von derselben Ansicht hinzuzufügen.
es: Comienza decidiendo dónde añadir un enlace de navegación (`NavigationLink`) a `CreatureEditor`. Dado que ya tienes una vista de lista (`List`) de criaturas que se pueden eliminar de `ContentView`, tiene sentido añadir una criatura de la misma vista.
es_419: Primero, decide dónde quieres agregar un enlace `NavigationLink` en `CreatureEditor`. Dado que ya tienes en `ContentView` una visualización `List` de criaturas que puedes eliminar, tiene sentido poder agregar una criatura desde la misma visualización.
fr: Commence par décider où ajouter un `NavigationLink` vers `CreatureEditor`. Puisque tu as déjà une vue `List` des créatures que tu peux supprimer dans `ContentView`, il est logique d’ajouter une créature depuis la même vue.
it: Innanzitutto, decidi dove aggiungere un `NavigationLink` a `CreatureEditor`. Poiché hai già una vista `List` di creature che puoi eliminare in `ContentView`, ha senso aggiungere una creatura alla stessa vista.
nl: Eerst beslis je waar je een `NavigationLink` naar `CreatureEditor` gaat toevoegen. Omdat je al een `List`-weergave hebt in `ContentView` met wezens die je kunt verwijderen, is het logisch om nieuwe wezens toe te voegen vanuit dezelfde weergave.
no: Begynn med å bestemme hvor du skal legge til en `NavigationLink` i `CreatureEditor`. Siden du allerede har en `List`-visning med skapninger som du kan slette fra i `ContentView`, gir det mening å legge til en skapning fra samme visning.
pt: Comece se decidindo sobre onde adicionar um `NavigationLink` a `CreatureEditor`. Como você já tem uma visualização `List` das criaturas que você pode apagar em `ContentView`, faz sentido adicionar uma criatura da mesma visualização.
sv: Börja med att bestämma var du ska lägga till en `NavigationLink` i `CreatureEditor`. Eftersom du redan har en `List`-vy med varelser som du kan radera från i `ContentView` är det vettigt att lägga till en varelse från samma vy.
th: เริ่มโดยตัดสินใจว่าจะเพิ่ม `NavigationLink` ไปยัง `CreatureEditor` ที่ตำแหน่งไหน เนื่องจากคุณมีมุมมอง `List` ของสิ่งมีชีวิตที่คุณสามารถลบได้ใน `ContentView` แล้ว การเพิ่มสิ่งมีชีวิตจากมุมมองเดียวกันนั้นก็ดูจะสมเหตุสมผล
tr: `NavigationLink`’i `CreatureEditor`’a nerede ekleyeceğine karar vererek başla. `ContentView`’da silebileceğin yaratıkların bir `List` görüntüsüne zaten sahip olduğun için aynı görüntüden yaratık eklemek mantıklıdır.
vi: Bắt đầu bằng việc quyết định nơi sẽ thêm `NavigationLink` vào `CreatureEditor`. Vì bạn đã có một chế độ xem `List` của các sinh vật mà bạn có thể xóa trong `ContentView` nên sẽ hợp lý khi thêm sinh vật từ cùng một chế độ xem.
zh_cn: 首先，决定要将 `NavigationLink` 添加到 `CreatureEditor` 的哪个位置。由于 `ContentView` 中已经有了一个可从中删除动物的动物 `List` 视图，因此从同一个视图添加动物也很合理。
zh_tw: 首先決定要將 `NavigationLink` 加入到 `CreatureEditor` 的哪個位置。因為你已經有一個可以在 `ContentView` 中刪除的生物的 `List` 顯示區，因此從同一顯示區加入生物是合理的。

source: To make creature editing easily accessible, place a link in the [navigation bar](glossary://navigation%20bar) in the `ContentView` UI. This is the perfect place for this type of link, because it’s in a familiar place where people look for additional features of your app.
de: Damit auf die Möglichkeiten zum Bearbeiten des Charakters einfach zugegriffen werden kann, platziere in der [Navigationsleiste](glossary://navigation%20bar) in der `ContentView`-UI einen Link. Das ist der ideale Ort für solche Links, da Benutzer:innen hier weitere Funktionen deiner App erwarten.
es: Para poder acceder fácilmente a la edición de criaturas, coloca un enlace en la [barra de navegación](glossary://navigation%20bar) en la IU de la vista de contenido (`ContentView`). Este es el lugar perfecto para este tipo de enlace, porque está en un lugar habitual donde las personas buscan las funciones adicionales de tu app.
es_419: Para facilitar la edición de criaturas, coloca un enlace en la [barra de navegación](glossary://navigation%20bar) de la interfaz de `ContentView`. Este es el lugar perfecto para este tipo de enlace, ya que es un sitio común en donde los usuarios suelen buscar las funciones adicionales de las apps.
fr: Pour pouvoir facilement modifier une créature, place un lien dans la [barre de navigation](glossary://navigation%20bar), dans l’IU `ContentView`. C’est l’endroit idéal pour ce type de lien, car c’est un emplacement où les utilisateurs ont l’habitude de regarder pour trouver d’autres fonctionnalités pour ton app.
it: Per rendere facile l'accesso alla modifica delle creature, posiziona un link nella [barra di navigazione](glossary://navigation%20bar) nell'interfaccia utente di `ContentView`. È il posto perfetto per questo tipo di link, poiché è in una posizione familiare in cui le persone cercano le funzionalità aggiuntive della tua app.
nl: Om het bewerken van wezens eenvoudig toegankelijk te maken, plaats je een link in de [navigatiebalk](glossary://navigation%20bar) in de `ContentView`-gebruikersinterface. Dit is de perfecte plaats voor dit type link, omdat dit de gebruikelijke plaats is waar gebruikers extra functies van je app zullen zoeken.
no: Du kan gjøre det enkelt å få tilgang til redigering av skapninger ved å plassere en lenke i [navigeringslinjen](glossary://navigation%20bar) i `ContentView`-brukergrensesnittet. Dette er det perfekte stedet for denne typen lenke fordi den er på et sted der brukerne forventer å finne ytterligere funksjoner i appen.
pt: Para facilitar o acesso à edição de criaturas, coloque um link na [barra de navegação](glossary://navigation%20bar) na IU `ContentView` UI. Esse é o lugar perfeito para esse tipo de link, por ser um local familiar onde as pessoas procuram recursos adicionais do app.
sv: Du kan göra det enkelt att komma åt redigering av varelser genom att placera en länk i [navigeringsfältet](glossary://navigation%20bar) i `ContentView`-gränssnittet. Det här är det perfekta stället för den här typen av länk eftersom den finns på en plats där användare förväntar sig att hitta ytterligare funktioner i appen.
th: ในการทำให้การแก้ไขสิ่งมีชีวิตสามารถเข้าถึงได้ง่ายๆ ให้วางลิงก์ใน[แถบการนำทาง](glossary://navigation%20bar) ใน UI ของ `ContentView` ตำแหน่งนี้คือตำแหน่งที่เหมาะสมสำหรับลิงก์ประเภทนี้เนื่องจากอยู่ในตำแหน่งที่คุ้นเคยที่ผู้คนมักค้นหาคุณลักษณะเพิ่มเติมของแอปของคุณ
tr: Yaratık düzenlemeyi kolay erişilebilir hâle getirmek için `ContentView` kullanıcı arayüzündeki [dolaşma çubuğuna](glossary://navigation%20bar) bir bağlantı yerleştir. Burası, kişilerin uygulamanın ek özellikleri için baktığı alışılmış yerlerden olduğu için mükemmel bir konumdur.
vi: Để đảm bảo tính năng sửa sinh vật có thể truy cập dễ dàng, hãy đặt một liên kết trong [thanh điều hướng](glossary://navigation%20bar) trong UI `ContentView`. Đây là nơi hoàn hảo cho loại liên kết này vì nằm trong một nơi tương tự mà mọi người tìm kiếm các tính năng bổ sung cho ứng dụng của bạn.
zh_cn: 若要轻松访问动物编辑，需将链接放置在 `ContentView` UI 的[导航栏](glossary://navigation%20bar)中。这是此类链接的理想位置，因为它位于用户查找 App 额外功能的熟悉位置。
zh_tw: 為了能容易地取用生物的編輯，請在 `ContentView` UI 的[導覽列](glossary://navigation%20bar)中放置一個連接。這是此類連結的理想位置，因為它位於使用者熟悉的位置，可在此尋找 App 的附加功能。

source: To add a button to the navigation bar:
de: Taste zur Navigationsleiste hinzufügen:
es: Para añadir un botón a la barra de navegación:
es_419: Para agregar un botón a la barra de navegación:
fr: Pour ajouter un bouton à la barre de navigation :
it: Per aggiungere un pulsante alla barra di navigazione:
nl: Een knop aan de navigatiebalk toevoegen:
no: Legg til en knapp i navigeringslinjen:
pt: Para adicionar um botão à barra de navegação:
sv: Lägg till en knapp i navigeringsfältet:
th: ในการเพิ่มปุ่มไปยังแถบการนำทาง:
tr: Dolaşma çubuğuna bir düğme eklemek için:
vi: Để thêm một nút vào thanh điều hướng:
zh_cn: 若要将按钮添加到导航栏：
zh_tw: 若要將按鈕加入導覽列：

source: Add navigation bar customization by attaching the `.toolbar` modifier to your `List` view.
de: Füge eine Anpassungsmöglichkeit für die Navigationsleiste hinzu, indem du den Modifikator `.toolbar` zur Ansicht `List` hinzufügst.
es: Añade la personalización de la barra de navegación adjuntando el modificador `.toolbar` a la vista `List`.
es_419: Agrega una barra de navegación personalizada agregando el modificador `.toolbar` a tu visualización `List`.
fr: Personnalise la barre de navigation en ajoutant le modificateur `.toolbar` à ta vue `List`.
it: Aggiungi la personalizzazione della barra di navigazione aggiungendo il modificatore `.toolbar` alla tua vista `List`.
nl: Voeg de modifier `.toolbar` aan de weergave `List` toe zodat de navigatiebalk kan worden aangepast.
no: Legg til tilpasninger av navigeringslinjen ved å legge ved modifikatoren `.toolbar` i `List`-visningen.
pt: Para adicionar a personalização de barra de navegação, anexe o modificador `.toolbar` à visualização `List`.
sv: Lägg till anpassningar av navigeringsfältet genom att bifoga modifieraren `.toolbar` i `List`-vyn.
th: เพิ่มการกำหนดแถบการนำทางเองโดยติดปุ่มปรับค่า `.toolbar` ไปที่มุมมอง `List` ของคุณ
tr: `List` görüntüne `.toolbar` niteleyicisini iliştirerek dolaşma çubuğu özelleştirmeyi ekle.
vi: Thêm tùy chỉnh thanh điều hướng bằng cách đính kèm trình sửa đổi `.toolbar` vào chế độ xem `List` của bạn.
zh_cn: 将 `.toolbar`（工具栏）修饰符附加到 `List` 视图中来添加自定的导航栏。
zh_tw: 藉由將 `.toolbar` 修飾符附加到 `List` 顯示區來加入自定的導覽列。

source: Inside the `.toolbar` closure, add a `ToolbarItem`. This is an item that you can place in the toolbar.
de: Füge im `.toolbar`-Funktionsabschluss das Symbolleistenobjekt `ToolbarItem` hinzu. Das ist ein Objekt, das in der Symbolleiste platziert werden kann.
es: Dentro de la clausura `.toolbar`, añade un ítem de barra de herramientas (`ToolbarItem`). Este es un ítem que puedes colocar en la barra de herramientas.
es_419: Dentro de la clausura `.toolbar`, agrega un `ToolbarItem`, el cual es un elemento que se puede colocar en la barra de herramientas.
fr: Dans la clôture de `.toolbar`, ajoute un `ToolbarItem`. Il s’agit d’un élément que tu peux placer dans la barre d’outils.
it: All'interno della chiusura `.toolbar`, aggiungi un `ToolbarItem`, ossia un elemento che puoi inserire della barra degli strumenti.
nl: Voeg binnen de `.toolbar`-closure een `ToolbarItem` toe. Dit is een onderdeel dat je aan de knoppenbalk kunt toevoegen.
no: Legg til `ToolbarItem` inni `.toolbar`-closure-blokken. Dette er et objekt som du kan plassere i verktøylinjen.
pt: Dentro do encerramento `.toolbar`, adicione um `ToolbarItem`. Esse é um item que você pode colocar na barra de ferramentas.
sv: Lägg till `ToolbarItem` inuti `.toolbar`-stängningen. Det här är ett objekt som du kan placera i verktygsfältet.
th: ภายในการปิด `.toolbar` ให้เพิ่ม `ToolbarItem` รายการนี้เป็นรายการที่คุณสามารถวางลงในแถบเครื่องมือได้
tr: `.toolbar` kapamasının içinde bir `ToolbarItem` ekle. Bu, araç çubuğuna yerleştirebileceğin bir öğedir.
vi: Bên trong bao đóng `.toolbar`, hãy thêm một `ToolbarItem`. Đây là một mục mà bạn có thể đặt trong thanh công cụ.
zh_cn: 在 `.toolbar` 闭包内添加 `ToolbarItem`（工具栏项）。这是可以放置在工具栏中的项目。
zh_tw: 在 `.toolbar` 閉包內加入一個 `ToolbarItem`。這是你可以放入工具列的項目。

source: Add a `NavigationLink` to `CreatureEditor` inside the `ToolbarItem`. This is the view you’ll see in the navigation bar.
de: Füge in `ToolbarItem` `NavigationLink` zu `CreatureEditor` hinzu. Das ist die Ansicht, die in der Navigationsleiste angezeigt wird.
es: Añade un enlace de navegación (`NavigationLink`) a `CreatureEditor` dentro de `ToolbarItem`. Esta es la vista que verás en la barra de navegación.
es_419: En `CreatureEditor`, agrega un enlace `NavigationLink` dentro de `ToolbarItem`. Esta es la visualización que verás en la barra de navegación.
fr: Ajoute un `NavigationLink` à `CreatureEditor` à l’intérieur du `ToolbarItem`. Il s’agit de la vue que tu verras dans la barre de navigation.
it: Aggiungi `NavigationLink` a `CreatureEditor` all'interno di `ToolbarItem`. Questa sarà la vista che vedrai nell barra di navigazione.
nl: Voeg een `NavigationLink` aan `CreatureEditor` toe in het `ToolbarItem`. Dit is de weergave die je in de navigatiebalk ziet.
no: Legg til `NavigationLink` i `CreatureEditor` inni `ToolbarItem`. Dette er visningen du ser i navigeringslinjen.
pt: Adicione um `NavigationLink` a `CreatureEditor` dentro de `ToolbarItem`. Essa é a visualização que você vê na barra de navegação.
sv: Lägg till `NavigationLink` i `CreatureEditor` inuti `ToolbarItem`. Det här är den vy du ser i navigeringsfältet.
th: เพิ่ม `NavigationLink` ที่ไปยัง `CreatureEditor` ภายใน `ToolbarItem` นี่คือมุมมองที่คุณจะเห็นในแถบการนำทาง
tr: `ToolbarItem` içindeki `CreatureEditor`’a bir `NavigationLink` ekle. Bu, dolaşma çubuğunda göreceğin görüntüdür.
vi: Thêm một `NavigationLink` vào `CreatureEditor` bên trong `ToolbarItem`. Đây là chế độ xem mà bạn sẽ nhìn thấy trong thanh điều hướng.
zh_cn: 将 `NavigationLink` 添加到 `CreatureEditor` 中的 `ToolbarItem` 内。这是你将在导航栏中看到的视图。
zh_tw: 將 `NavigationLink` 加入 `ToolbarItem` 內的 `CreatureEditor`。這是你會在導覽列中看到的顯示區。

source: .toolbar { ToolbarItem { // Add NavigationLink to CreatureEditor } }
de: .toolbar { ToolbarItem { // Navigations-Link zu CreatureEditor hinzufügen } }
es: .toolbar { ToolbarItem { // Añade NavigationLink a CreatureEditor } }
es_419: .toolbar { ToolbarItem { // Agrega NavigationLink a CreatureEditor } }
it: .toolbar { ToolbarItem { // Aggiungi NavigationLink a CreatureEditor } }
nl: .toolbar { ToolbarItem { // Voeg NavigationLink aan CreatureEditor toe } }
pt: .toolbar { ToolbarItem { // Adicionar NavigationLink a CreatureEditor } }
th: .toolbar { ToolbarItem { // เพิ่ม NavigationLink ไปยัง CreatureEditor } }
tr: .toolbar { ToolbarItem { // CreatureEditor’a NavigationLink ekle } }
zh_cn: .toolbar { ToolbarItem { // 将 NavigationLink 添加到 CreatureEditor } }

source: .toolbar { ToolbarItem { NavigationLink("Add") { CreatureEditor() } } }
de: .toolbar { ToolbarItem { NavigationLink("Hinzufügen") { CreatureEditor() } } }
es: .toolbar { ToolbarItem { NavigationLink("Añadir") { CreatureEditor() } } }
es_419: .toolbar { ToolbarItem { NavigationLink("Agregar") { CreatureEditor() } } }
fr: .toolbar { ToolbarItem { NavigationLink("Ajouter") { CreatureEditor() } } }
it: .toolbar { ToolbarItem { NavigationLink("Aggiungi") { CreatureEditor() } } }
nl: .toolbar { ToolbarItem { NavigationLink("Voeg toe") { CreatureEditor() } } }
sv: .toolbar { ToolbarItem { NavigationLink("Lägg till") { CreatureEditor() } } }
th: .toolbar { ToolbarItem { NavigationLink("เพิ่ม") { CreatureEditor() } } }
tr: .toolbar { ToolbarItem { NavigationLink("Ekle") { CreatureEditor() } } }
vi: .toolbar { ToolbarItem { NavigationLink("Thêm") { CreatureEditor() } } }
zh_cn: .toolbar { ToolbarItem { NavigationLink("添加") { CreatureEditor() } } }

source: Add a navigation title to `CreatureEditor`
de: Navigationstitel zu `CreatureEditor` hinzufügen
es: Añadir un título de navegación a `CreatureEditor`
es_419: Agregar un título de navegación a `CreatureEditor`
fr: Ajouter un titre de navigation à `CreatureEditor`
it: Aggiungere un titolo di navigazione a `CreatureEditor`
nl: Een navigatietitel aan `CreatureEditor` toevoegen
no: Legg til en navigeringstittel i `CreatureEditor`
pt: Adicione um título de navegação a `CreatureEditor`
sv: Lägg till en navigeringstitel i `CreatureEditor`
th: เพิ่มชื่อการนำทางไปยัง `CreatureEditor`
tr: `CreatureEditor`’a dolaşma başlığı ekleme
vi: Thêm một tiêu đề điều hướng vào `CreatureEditor`
zh_cn: 将导航标题添加到 `CreatureEditor`
zh_tw: 將導覽標題加入 `CreatureEditor`
