Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 3/Continue com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: By passing the data to your top-level view, the environment object makes the data available to the entire [view hierarchy](glossary://view%20hierarchy) so all other views can use it.
de: Indem du die Daten als Umgebungsobjekt an die oberste Ansicht übergibst, sind die Daten für die gesamte [Ansichtenhierarchie](glossary://view%20hierarchy) verfügbar und alle anderen Ansichten können sie verwenden.
es: Al pasar los datos a tu vista de nivel superior, el objeto de entorno hace que los datos estén disponibles para toda la [jerarquía de vistas](glossary://view%20hierarchy), de modo que todas las demás vistas puedan utilizarlos.
es_419: Al pasar los datos a tu visualización principal, el objeto de entorno hace que esos datos estén disponibles para toda la [jerarquía de visualizaciones](glossary://view%20hierarchy), de modo que todas las demás visualizaciones pueden usarlos.
fr: En transmettant les données à ta vue au plus haut niveau, l’objet d’environnement rend les données disponibles à la totalité de la [hiérarchie de vue](glossary://view%20hierarchy) de sorte que toutes les autres vues puissent les utiliser.
it: Trasmettendo i dati alla vista di livello superiore, l'oggetto ambiente rende i dati disponibili nell'intera [gerarchia di viste](glossary://view%20hierarchy), in modo che tutte le altre viste possano utilizzarli.
nl: Door de gegevens aan de weergave op het hoogste niveau door te geven, maakt het omgevingsobject de gegevens beschikbaar voor de hele [weergavehiërarchie](glossary://view%20hierarchy). Hierdoor kunnen alle weergaven er gebruik van maken.
no: Når du overfører dataene til toppnivåvisningen, gjør miljøobjektet dataene tilgjengelig for hele [visningshierarkiet](glossary://view%20hierarchy), slik at alle andre visninger kan bruke dem.
pt: Ao passar os dados para a visualização de nível superior, o objeto de ambiente disponibiliza os dados para toda a [hierarquia de visualização](glossary://view%20hierarchy) para que todas as outras visualizações possam usá-los.
sv: När du överför data till vyn på översta nivån gör miljöobjektet dessa data tillgängliga för hela [vyhierarkin](glossary://view%20hierarchy) så att alla andra vyer kan använda dem.
th: เมื่อส่งผ่านข้อมูลไปยังมุมมองระดับบนสุดของคุณ วัตถุสภาพแวดล้อมจะทำให้ข้อมูลใช้งานได้กับ[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)ทั้งหมด มุมมองอื่นๆ ทั้งหมดจึงสามารถใช้ข้อมูลนั้นได้
tr: Ortam nesnesi, üst düzey görüntüne veri geçirerek veriyi tüm [görüntü hiyerarşisi](glossary://view%20hierarchy) tarafından kullanılabilir hâle getirir ve diğer tüm görüntülerin onu kullanabilmesini sağlar.
vi: Bằng việc chuyển dữ liệu của bạn vào chế độ xem cấp cao nhất, đối tượng môi trường làm cho dữ liệu khả dụng trong toàn bộ [phân cấp xem](glossary://view%20hierarchy) sao cho tất cả các chế độ xem khác có thể sử dụng dữ liệu.
zh_cn: 通过将数据传入顶层视图，环境对象让数据在整个[视图层次](glossary://view%20hierarchy)中可用，这样所有的其他视图也可以使用它。
zh_tw: 藉由將資料傳送到最上層顯示區，環境物件會讓資料可用於整個[顯示區階層](glossary://view%20hierarchy)，因此所有其他顯示區都可以使用這些資料。

source: Create your instance of `CreatureZoo`, the same as you did in `CreatureList`:
de: Erstelle die `CreatureZoo`-Instanz auf dieselbe Weise, wie du es in `CreatureList` bereits getan hast:
es: Crea tu instancia de `CreatureZoo`, al igual que hiciste en `CreatureList`:
es_419: Crea tu instancia de `CreatureZoo`, igual que hiciste en `CreatureList`:
fr: Crée ton instance de `CreatureZoo`, comme tu l’as fait dans `CreatureList` :
it: Crea la tua istanza di `CreatureZoo`, come hai fatto in `CreatureList`:
nl: Maak een instantie aan van `CreatureZoo`, net als je hebt gedaan in `CreatureList`:
no: Opprett en instans av `CreatureZoo` på samme måte som du gjorde i `CreatureList`:
pt: Crie a instância de `CreatureZoo` da mesma maneira que você fez em `CreatureList`:
sv: Skapa en instans av `CreatureZoo` på samma sätt som du gjorde i `CreatureList`:
th: สร้างชื่อแทนประเภทของ `CreatureZoo` เช่นเดียวกับที่คุณทำใน `CreatureList`:
tr: `CreatureList`’te yaptığın gibi `CreatureZoo` örneğini yarat:
vi: Tạo ra thể hiện của `CreatureZoo` của bạn, giống với cách bạn thực hiện trong `CreatureList`:
zh_cn: 创建 `CreatureZoo` 的实例，与你之前在 `CreatureList` 中做的一样：
zh_tw: 建立你的 `AppData` 實例，就像你在 `CreatureZoo` 中所做的一樣：

source: Add the following modifier below the `NavigationStack`:
de: Füge den folgenden Modifikator unter `NavigationStack` hinzu:
es: Añade el siguiente modificador debajo de la pila de navegación (`NavigationStack`):
es_419: Agrega el siguiente modificador debajo de `NavigationStack`:
fr: Ajoute le modificateur suivant sous la `NavigationStack` :
it: Aggiungi il modificatore di seguito sotto `NavigationStack`:
nl: Voeg de volgende modifier toe onder de `NavigationStack`:
no: Legg til følgende modifikator nedenfor `NavigationStack`:
pt: Adicione o seguinte modificador abaixo do `NavigationStack`:
sv: Lägg till följande modifierare nedanför `NavigationStack`:
th: เพิ่มปุ่มปรับค่าต่อไปนี้ใต้ `NavigationStack`:
tr: Aşağıdaki niteleyiciyi `NavigationStack`’in altına ekle:
vi: Thêm trình sửa đổi sau đây bên dưới `NavigationStack`:
zh_cn: 在 `NavigationStack` 下方添加以下修饰符：
zh_tw: 在 `NavigationStack` 下方加入以下修飾符`：

source: This passes your [observable object](glossary://observable%20object) instance to the app’s [environment](glossary://environment), for any [subview](glossary://subview) to access.
de: Dadurch wird die [beobachtbare Objekt](glossary://observable%20object)-Instanz an die [Umgebung](glossary://environment) der App übergeben, damit jede [Unteransicht](glossary://subview) darauf zugreifen kann.
es: Esto pasa tu instancia de [objeto observable](glossary://observable%20object) al [entorno](glossary://environment) de la app, para que todas las [vistas secundarias](glossary://subview) puedan acceder.
es_419: Esto pasa tu instancia de [objeto observable](glossary://observable%20object) al [entorno](glossary://environment) de la app, para que cualquier [subvisualización](glossary://subview) pueda acceder a la instancia del objeto observable.
fr: Cela transmet l’instance de ton [objet observable](glossary://observable%20object) à l’[environnement](glossary://environment) de l’app, pour que toute [sous-vue](glossary://subview) y ait accès.
it: In questo modo, l'istanza del tuo [oggetto osservabile](glossary://observable%20object) viene passata all'[ambiente](glossary://environment) dell'app e diventa accessibile a tutte le [viste secondarie](glossary://subview).
nl: Hiermee geef je de instantie van het [observeerbare object](glossary://observable%20object) door aan de [omgeving](glossary://environment) van de app, zodat alle [subweergaven](glossary://subview) er toegang toe hebben.
no: Dette overfører instansen av det [observerbare objektet](glossary://observable%20object) til appens [miljø](glossary://environment), der alle [delvisninger](glossary://subview) har tilgang.
pt: Isso passa a sua instância de [objeto observável](glossary://observable%20object) para o [ambiente](glossary://environment) do app, para que qualquer [subvisualização](glossary://subview) possa acessar.
sv: Detta överför instansen av det [observerbara objektet](glossary://observable%20object) till appens [miljö](glossary://environment) där alla [delvyer](glossary://subview) har tillgång.
th: การทำเช่นนี้จะส่งผ่านชื่อแทนประเภท[วัตถุที่สังเกตเห็นได้](glossary://observable%20object)ของคุณไปยัง[สภาพแวดล้อม](glossary://environment)ของแอปเพื่อให้[มุมมองย่อย](glossary://subview)ใดๆ เข้าถึงได้
tr: Bu, herhangi bir [alt görüntünün](glossary://subview) erişebilmesi için [gözlemlenebilir nesne](glossary://observable%20object) örneğini uygulamanın [ortamına](glossary://environment) geçirir.
vi: Việc này chuyển thể hiện [đối tượng có thể quan sát](glossary://observable%20object) của bạn vào [môi trường](glossary://environment) của ứng dụng để bất kỳ [chế độ xem phụ](glossary://subview) nào truy cập.
zh_cn: 这会将[可观测对象](glossary://observable%20object)实例传入 App 的[环境](glossary://environment)，供任何[子视图](glossary://subview)访问。
zh_tw: 這會將[可觀察的物件](glossary://observable%20object)實例傳送到 App的[環境](glossary://environment)，供任何[子顯示區](glossary://subview)取用。

source: Next, you’ll go back to `ContentView.swift` to try using the environment object.
de: Als Nächstes gehst du zurück zu `ContentView.swift` und versuchst, das Umgebungsobjekt zu verwenden.
es: A continuación, volverás a `ContentView.swift` para probar a usar el objeto de entorno.
es_419: A continuación, regresa al archivo `ContentView.swift` para intentar usar el objeto de entorno.
fr: Ensuite, tu retourneras à `ContentView.swift` pour essayer d’utiliser l’objet d’environnement.
it: Nella prossima attività, torneremo a esaminare i contenuti di `ContentView.swift` per provare a utilizzare l'oggetto ambiente.
nl: Nu ga je terug naar `ContentView.swift` om het omgevingsobject te gebruiken.
no: Nå går du tilbake til `ContentView.swift` og prøver å bruke miljøobjektet.
pt: A seguir, você voltará a `ContentView.swift` para tentar usar o objeto de ambiente.
sv: Härnäst återgår du till `ContentView.swift` och försöker använda miljöobjektet.
th: ถัดไป คุณจะได้กลับไปยัง `ContentView.swift` เพื่อลองใช้วัตถุสภาพแวดล้อม
tr: Sonra, ortam nesnesini kullanmayı denemek için `ContentView.swift`’e geri döneceksin.
vi: Tiếp theo, bạn sẽ quay lại `ContentView.swift` để thử sử dụng đối tượng môi trường.
zh_cn: 下一步，你将回到 `ContentView.swift` 来尝试使用环境对象。
zh_tw: 接下來，你將返回到 `ContentView.swift` 來嘗試使用環境物件。

source: Access an environment object
de: Auf ein Umgebungsobjekt zugreifen
es: Acceder a un objeto de entorno
es_419: Acceder a un objeto de entorno
fr: Accéder à un objet d’environnement
it: Accedere a un oggetto ambiente
nl: Een omgevingsobject toegankelijk maken
no: Få tilgang til et miljøobjekt
pt: Acesse um objeto de ambiente
sv: Kom åt ett miljöobjekt
th: เข้าถึงวัตถุสภาพแวดล้อม
tr: Ortam nesnesine erişme
vi: Truy cập một đối tượng môi trường
zh_cn: 访问环境对象
zh_tw: 取用環境物件

source: Now that you’ve shared the observable object with all of the [subviews](glossary://subview) of your `NavigationStack`, including `ContentView`, it’s time to access that data.
de: Du hast das beobachtbare Objekt nun mit allen [Unteransichten](glossary://subview) von `NavigationStack` geteilt, auch mit `ContentView`. Jetzt wird auf die Daten zugegriffen.
es: Ahora que has compartido el objeto observable con todas las [vistas secundarias](glossary://subview) de tu pila de navegación (`NavigationStack`), incluida la vista de contenido (`ContentView`), es hora de acceder a esos datos.
es_419: Ahora que compartiste el objeto observable con todas las [subvisualizaciones](glossary://subview) de `NavigationStack`, incluyendo `ContentView`, es hora de acceder a esos datos.
fr: À présent que tu as partagé l’objet observable avec toutes les [sous-vues](glossary://subview) de ta `NavigationStack`, y compris `ContentView`, il est temps d’accéder à ces données.
it: Ora che hai condiviso l'oggetto osservabile con tutte le [viste secondarie](glossary://subview) della tua `NavigationStack`, inclusa `ContentView`, è arrivato il momento di provare ad accedere ai dati.
nl: Nu je het observeerbare object hebt gedeeld met alle [subweergaven](glossary://subview) van je `NavigationStack`, inclusief `ContentView`, is het tijd om toegang te krijgen tot die gegevens.
no: Nå når du har delt det observerbare objektet med alle [delvisningene](glossary://subview) i `NavigationStack`, inkludert `ContentView`, er det på tide å få tilgang til disse dataene.
pt: Agora que você compartilhou o objeto observável com todas as [subvisualizações](glossary://subview) do `NavigationStack`, incluindo `ContentView`, chegou a hora de acessar esses dados.
sv: Nu när du har delat det observerbara objektet med alla [delvyerna](glossary://subview) i `NavigationStack`, inklusive `ContentView`, är det dags att komma åt dessa data.
th: ตอนนี้เมื่อคุณได้แชร์วัตถุที่สังเกตเห็นได้กับ[มุมมองย่อย](glossary://subview)ทั้งหมดของ `NavigationStack` ซึ่งรวมถึง `ContentView` แล้ว ก็ถึงเวลาที่จะลองเข้าถึงข้อมูลนั้น
tr: Gözlemlenebilir nesneyi, `ContentView` da dahil olmak üzere `NavigationStack`’inin tüm [alt görüntüleriyle](glossary://subview) paylaştığına göre bu verilere erişme zamanı geldi.
vi: Bây giờ bạn đã chia sẻ đối tượng có thể quan sát với tất cả các [chế độ xem phụ](glossary://subview) của `NavigationStack`, bao gồm `ContentView`, đã đến lúc truy cập dữ liệu đó.
zh_cn: 现在你已经与 `NavigationStack` 中的所有[子视图](glossary://subview)共享可观测对象，包括 `ContentView`，是时候访问这些数据了。
zh_tw: 現在，你已經和 `NavigationStack` 的所有[子顯示區](glossary://subview)共享可觀察物件，包含`ContentView`，是時候來取用資料了。

source: Instead of using `@StateObject`, which creates a new instance of an observable object, you need to acccess the instance passed into the app [environment](glossary://environment):
de: Statt ein `@StateObject` zu verwenden, das eine neue Instanz eines beobachtbaren Objekts erstellt, musst du auf die Instanz zugreifen, die an die App-[Umgebung](glossary://environment) übergeben wird:
es: En lugar de usar `@StateObject`, que crea una nueva instancia de un objeto observable, tienes que acceder a la instancia pasada al [entorno](glossary://environment) de la app:
es_419: En lugar de usar `@StateObject`, que crea una nueva instancia de un objeto observable, necesitas acceder a la instancia que se pasó al [entorno](glossary://environment) de la app:
fr: Plutôt que d’utiliser `@StateObject`, qui crée une nouvelle instance d’un objet observable, tu dois accéder à l’instance transmise dans l’[environnement](glossary://environment) de l’app :
it: Al posto di `@StateObject`, che crea una nuova istanza di un oggetto osservabile, devi accedere all'istanza trasmessa nell'[ambiente](glossary://environment) dell'app:
nl: In plaats van `@StateObject` te gebruiken, waarmee je een nieuwe instantie van een observeerbaar object aanmaakt, moet je de instantie toegankelijk maken die aan de app[omgeving](glossary://environment) wordt doorgegeven:
no: I stedet for å bruke `@StateObject`, noe som oppretter en ny instans av et observerbart objekt, må du få tilgang til instansen som overføres til appens [miljø](glossary://environment):
pt: Em vez de usar `@StateObject`, que cria uma nova instância de um objeto observável, você precisa acessar a instância passada para o [ambiente](glossary://environment) do app:
sv: Istället för att använda `@StateObject`, vilket skapar en ny instans av ett observerbart objekt, måste du komma åt den instans som överförs till appens [miljö](glossary://environment):
th: แทนที่จะใช้ `@StateObject` ที่สร้างชื่อแทนประเภทใหม่ของวัตถุที่สังเกตเห็นได้ คุณจะต้องเข้าถึงชื่อแทนประเภทที่ส่งผ่านไปยัง[สภาพแวดล้อม](glossary://environment)ของแอป:
tr: Gözlemlenebilir nesnenin yeni bir örneğini yaratan `@StateObject`’i kullanmak yerine uygulama [ortamına](glossary://environment) geçirilen örneğe erişmen gerekir:
vi: Thay vì sử dụng `@StateObject`, tạo ra một thể hiện mới của một đối tượng có thể quan sát, bạn cần truy cập vào thể hiện được chuyển vào [môi trường](glossary://environment) ứng dụng:
zh_cn: 你需要访问传入到 App [环境](glossary://environment)中的实例，而不是使用可创建可观测对象新实例的 `@StateObject`：
zh_tw: 你需要取用傳入 App [環境](glossary://environment)的實例，而不是使用能建立可觀察物件新實例的 `@StateObject`：

source: Delete your current `@StateObject` variable, `data`.
de: Lösche die aktuelle `@StateObject`-Variable `data`.
es: Elimina la variable de `@StateObject` actual, `data`.
es_419: Elimina tu variable `@StateObject` actual, `data`.
fr: Supprime ta variable `@StateObject` actuelle, `data`.
it: Elimina la tua variabile `@StateObject` attuale, `data`.
nl: Verwijder de huidige `@StateObject`-variabele, `data`.
no: Slett den aktuelle `@StateObject`-variabelen `data`.
pt: Apague a variável `@StateObject` atual, `data`.
sv: Radera den aktuella `@StateObject`-variabeln `data`.
th: ลบตัวแปร `@StateObject` ปัจจุบันของคุณ นั่นคือ `data`
tr: Şu anki `data` `@StateObject` değişkenini sil.
vi: Xóa biến `@StateObject` hiện tại của bạn, `data`.
zh_cn: 删除当前的 `@StateObject` 变量 `data`（数据）。
zh_tw: 刪除你目前的 `@StateObject` 變數 `data`。

source: To access your [environment object](glossary://environment%20object), and create a new property with `@EnvironmentObject` property wrapper of type `CreatureZoo`.
de: Um auf das [Umgebungsobjekt](glossary://environment%20object) zuzugreifen, erstelle eine neue Eigenschaft mit dem Eigenschaftswrapper `@EnvironmentObject` des Typs `CreatureZoo`.
es: Para acceder a tu [objeto de entorno](glossary://environment%20object) y crear una nueva propiedad con un contenedor de propiedades `@EnvironmentObject` de tipo `CreatureZoo`.
es_419: Para acceder a tu [objeto de entorno](glossary://environment%20object), y crea una nueva propiedad con un contenedor de propiedades `@EnvironmentObject` del tipo `CreatureZoo`.
fr: Pour accéder à ton [objet d’environnement](glossary://environment%20object), crée une nouvelle propriété avec un wrapper de propriété `@EnvironmentObject` de type `CreatureZoo`.
it: Per accedere al tuo [oggetto ambiente](glossary://environment%20object), crea una nuova proprietà con il wrapper di proprietà `@EnvironmentObject` di tipo `CreatureZoo`.
nl: Om je [omgevingsobject](glossary://environment%20object) toegankelijk te maken, maak je een nieuwe eigenschap aan met de eigenschapwrapper `@EnvironmentObject` van het type `CreatureZoo`.
no: For å få tilgang til [miljøobjektet](glossary://environment%20object) og opprette en ny egenskap av typen `CreatureZoo` med egenskapsinnpakningen `@EnvironmentObject`.
pt: Para acessar o [objeto de ambiente](glossary://environment%20object) e criar uma nova propriedade com o empacotador de propriedades `@EnvironmentObject` do tipo `CreatureZoo`.
sv: För att komma åt [miljöobjektet](glossary://environment%20object) och skapa en ny egenskap av typen `CreatureZoo` med egenskapspaketeraren `@EnvironmentObject`.
th: เข้าถึง[วัตถุสภาพแวดล้อม](glossary://environment%20object)ของคุณ และสร้างคุณสมบัติใหม่ที่มีตัวหุ้มคุณสมบัติ `@EnvironmentObject` ของประเภท `CreatureZoo`
tr: [Ortam nesnene](glossary://environment%20object) erişmek ve `CreatureZoo` tipinde `@EnvironmentObject` özellik sarmalayıcısı ile yeni bir özellik yaratmak için.
vi: Để truy cập [đối tượng môi trường](glossary://environment%20object) của bạn và tạo ra một thuộc tính mới với trình đóng gói thuộc tính `@EnvironmentObject` thuộc kiểu `CreatureZoo`.
zh_cn: 若要访问[环境对象](glossary://environment%20object)，并使用 `CreatureZoo` 类型的 `@EnvironmentObject`（环境对象）属性包装器创建一个新的属性。
zh_tw: 若要取用你的[環境物件](glossary://environment%20object)，請使用 `CreatureZoo` 類型的 `@EnvironmentObject` 屬性包覆建立一個新的屬性。

source: Examine your list of creatures in `ContentView` preview.
de: Untersuche die Charakterliste in der `ContentView`-Vorschau.
es: Examina tu lista de criaturas en la vista previa de `ContentView`.
es_419: Examina tu lista de criaturas en la vista previa `ContentView`.
fr: Examine ta liste de créatures dans l’aperçu de `ContentView`.
it: Osserva l'elenco delle tue creature nell'anteprima di `ContentView`.
nl: Bekijk je lijst met wezens in de `ContentView`-voorvertoning.
no: Utforsk listen med skapninger i forhåndsvisningen av `ContentView`.
pt: Examine a lista de criaturas na pré-visualização de `ContentView`.
sv: Utforska listan med varelser i förhandsvisningen av `ContentView`.
th: ตรวจสอบรายการสิ่งมีชีวิตของคุณในการแสดงตัวอย่าง `ContentView`
tr: `ContentView` önizlemesinde yaratık listeni incele.
vi: Kiểm tra danh sách các sinh vật của bạn trong bản xem trước `ContentView`.
zh_cn: 仔细观察 `ContentView` 预览中的动物列表。
zh_tw: 在 `ContentView` 預覽中檢查你的生物列表。

source: Notice that the creatures appear just as they did before. Data in the creature list is created in `MyApp`, shared through the app [environment](glossary://environment), and accessed in `ContentView`.
de: Beachte, dass die Charaktere aussehen wie vorher. Die Daten in der Charakterliste werden in `MyApp` erstellt, durch die App-[Umgebung](glossary://environment) geteilt und über `ContentView` wird darauf zugegriffen.
es: Fíjate en que las criaturas aparecer igual que lo hacían antes. Los datos de la lista de criaturas se crean en `MyApp`, se comparten a través del [entorno](glossary://environment) de la app, y se accede a ellos en `ContentView`.
es_419: Observa que las criaturas aparecen de la misma forma que antes. Los datos de la lista de criaturas se crean en `MyApp`, se comparten mediante el [entorno](glossary://environment) de la app, y se acceden en la visualización `ContentView`.
fr: Tu remarqueras que les créatures apparaissent exactement comme avant. Les données de la liste des créatures sont créées dans `MyApp`, partagées par l’[environnement](glossary://environment) de l’app et accessibles dans `ContentView`.
it: Se hai notato, le creature hanno lo stesso aspetto di prima. I dati contenuti nell'elenco delle creature vengono creati in `MyApp`, condivisi tramite l'[ambiente](glossary://environment) dell'app e puoi accedervi da `ContentView`.
nl: Zoals je ziet, zien de wezens er net zo uit als eerder. Gegevens in de lijst met wezens worden aangemaakt in `MyApp`, gedeeld via de app[omgeving](glossary://environment) en toegankelijk gemaakt in `ContentView`.
no: Legg merke til at skapningene ser ut nøyaktig som før. Data i skapningslisten opprettes i `MyApp`, deles via appens [miljø](glossary://environment) og er tilgjengelig i `ContentView`.
pt: Note que as criaturas aparecem da mesma maneira que antes. Os dados na lista de criaturas são criados em `MyApp`, compartilhados através do [ambiente](glossary://environment) do app e acessados em `ContentView`.
sv: Lägg märke till att varelserna ser ut precis som tidigare. Data i varelselistan skapas i `MyApp`, delas via appens [miljö](glossary://environment) och är tillgängliga i `ContentView`.
th: สังเกตว่าสิ่งมีชีวิตจะแสดงเหมือนกับก่อนหน้านี้ ข้อมูลในรายการสิ่งมีชีวิตจะถูกสร้างใน `MyApp`, แชร์ผ่าน[สภาพแวดล้อม](glossary://environment)ของแอป และเข้าถึงใน `ContentView`
tr: Yaratıkların eskisi gibi göründüklerine dikkat et. Yaratık listesindeki veriler `MyApp`’de yaratılır, uygulama [ortamı](glossary://environment) yoluyla paylaşılır ve bunlara `ContentView`’da erişilir.
vi: Hãy lưu ý rằng các sinh vật xuất hiện đúng như trước đây. Dữ liệu trong danh sách sinh vật được tạo ra trong `MyApp`, được chia sẻ thông qua [môi trường](glossary://environment) ứng dụng và được truy cập trong `ContentView`.
zh_cn: 请注意，动物看起来与之前一模一样。动物列表中的数据在 `MyApp` 中创建，在 App [环境](glossary://environment)中共享，并在 `ContentView` 中访问。
zh_tw: 請注意，生物應該如同往常一樣出現。生物列表中的資料是在 `MyApp` 中建立的，透過 App [環境](glossary://environment)共享，並在 `ContentView` 中取用。

source: Replace your `HStack` with a composed `CreatureRow` view
de: `HStack` durch die zusammengesetzte `CreatureRow`-Ansicht ersetzen
es: Sustituir `HStack` por una vista compuesta `CreatureRow`
es_419: Reemplazar `HStack` con una visualización `CreatureRow` compuesta
fr: Remplacer la `HStack` par une vue `CreatureRow` composée
it: Sostituire `HStack` con una vista composta `CreatureRow`
nl: De `HStack` door de samengestelde weergave `CreatureRow` vervangen
no: Erstatt `HStack` med en sammenstilt `CreatureRow`-visning
pt: Substitua `HStack` por uma visualização `CreatureRow` composta
sv: Ersätt `HStack` med en sammanställd `CreatureRow`-vy
th: แทนที่ `HStack` ของคุณด้วยมุมมอง `CreatureRow` ที่ถูกประกอบ
tr: `HStack`’ini oluşturulmuş bir `CreatureRow` görüntüsüyle değiştirme
vi: Thay thế `HStack` của bạn bằng một chế độ xem `CreatureRow` tổ hợp
zh_cn: 使用 `CreatureRow` 组合视图替换 `HStack`
zh_tw: 用組合式的 `CreatureRow` 顯示區來取代你的 `HStack`
