Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 2/3 - Organizando com Grades/Organizando com Grades.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page22..Paragraph45
no: Nå har du tre kolonner. To av dem har fast størrelse, og den tredje tilpasser størrelsen sin mellom to verdier.
vi: Bây giờ, bạn có ba cột: hai trong số đó được cố định theo một kích cỡ cụ thể và một cột điều chỉnh giữa hai giá trị.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page22..Paragraph46
no: Prøv å endre de forskjellige parameterverdiene for `GridItem`. Hva skjer med rutenettet når du gjør det? Legg til et par ekstra `GridItem`-[instanser](glossary://instance) i `customColumns`. Kan du tenke deg hvordan rutenettet forandres?
vi: Thử thay đổi các giá trị tham số `GridItem` khác. Điều gì xảy ra với lưới của bạn bây giờ? Thêm một vài [thể hiện](glossary://instance) `GridItem` nữa trong `customColumns`. Bạn có thể dự đoán được lưới sẽ thay đổi như thế nào không?

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page23..Paragraph47
no: Det kan hende du har lagt merke til at det finnes et tredje størrelsesvalg for `GridItem` i tillegg til `.fixed(_:)` og `.flexible()`, som kalles `.adaptive(minimum:maximum:)`.
vi: Có thể bạn đã nhận thấy rằng bên cạnh `.fixed(_:)` và `.flexible()`, có một tùy chọn kích cỡ thứ ba cho `GridItem` được gọi là `.adaptive(minimum:maximum:)`.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page23..Paragraph48
no: Ved å bruke [adaptive](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) kan du få plass til så mange rutenettobjekter som det er plass til, basert på `minimum`- og `maximum`-verdiene du angir. Med den adaptive metoden kan antall kolonner i rutenettet tilpasses dynamisk basert på plassen som er tilgjengelig.
vi: Định cỡ [thích ứng](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) có gắng khớp số lượng mục lưới nhiều nhất có thể vào không gian dựa trên các giá trị `minimum` và `maximum` mà bạn đặt. Kết quả là, việc sử dụng định cỡ thích ứng cho phép số lượng cột trong lưới của bạn tự động điều chỉnh dựa trên không gian khả dụng.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page23..Paragraph49
no: Prøv å bruke `adaptiveColumns` som argument for `columns` i `LazyVGrid`. Eksperimenter med hvordan denne layouten oppfører seg når du utvider og trekker sammen forhåndsvisningen.
vi: Thử sử dụng `adaptiveColumns` dưới dạng đối số cho `columns` trong `LazyVGrid` của bạn. Thử nghiệm xem bố cục này hoạt động như thế nào khi bạn mở rộng và thu nhỏ bản xem trước.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page23..CodeBlock11
no: let adaptiveColumns = [GridItem(.adaptive(minimum: 100, maximum: 250))]
vi: let adaptiveColumns = [GridItem(.adaptive(minimum: 100, maximum: 250))]

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..title
no: Velg en farge i rutenettet
vi: Chọn một màu từ lưới

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Paragraph50
no: Bruk en [statusegenskap](glossary://state%20property) og en knapp for å spore hvilken farge en person velger i rutenettet.
vi: Sử dụng một [thuộc tính trạng thái](glossary://state%20property) và một nút để theo dõi màu mà một người chọn trong lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page24..Paragraph51
no: Hva hvis du vil kunne velge en farge i rutenettet ved å trykke på den? Og hva hvis fargen du velger, har en kul effekt, for eksempel at den legger til et fargefilter på et bilde?
vi: Nếu bạn muốn chọn một màu trong lưới bằng cách chạm vào lưới thì sao? Và nếu màu mà bạn đã chọn có một số hiệu ứng tuyệt vời, như áp dụng bộ lọc màu cho hình ảnh thì sao?

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page24..Paragraph52
no: Hvis du synes det høres spennende ut, så har du flaks!
vi: Chà, nếu bạn thấy những thứ đó thú vị thì bạn may mắn đấy!

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page25..Paragraph53
no: For å velge en farge trenger du først et sted å lagre en `Color`-verdi, for eksempel en [egenskap](glossary://property) for `ContentView`.
vi: Để chọn một màu, trước tiên bạn sẽ cần một nơi để lưu trữ giá trị `Color`, ví dụ như một [thuộc tính](glossary://property) của `ContentView`.

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page25..Paragraph54
no: Siden du vil at denne fargen skal påvirke [brukergrensesnittet](glossary://user%20interface), må du definere den som en [statusegenskap](glossary://state%20property) som SwiftUI kan bruke til å oppdatere visningene når verdien endres:
vi: Vì bạn sẽ muốn màu này có hiệu ứng trên [UI](glossary://user%20interface) nên bạn sẽ định nghĩa dưới dạng một [thuộc tính trạng thái](glossary://state%20property) — một thuộc tính mà SwiftUI có thể sử dụng để cập nhật các chế độ xem khi giá trị thay đổi:

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page25..CodeBlock12
no: @State private var selectedColor = Color.white
vi: @State private var selectedColor = Color.white

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page26..Paragraph55
no: For å endre den valgte fargen gjør du alle `Rectangle`-visningene om til en `Button`. En knapp har både en [etikett](glossary://label) (utseendet) og en handling (noe som skjer når du trykker på den).
vi: Để thay đổi màu được chọn, hãy chuyển đổi từng chế độ xem `Rectangle` thành một `Button`. Nút có cả [nhãn](glossary://label) (hình thức) và hành động (điều gì đó sẽ xảy ra khi bạn chạm vào nút).

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page26..Paragraph56
no: Legg til denne `Button`-visningen i `ForEach`:
vi: Thêm chế độ xem `Button` này bên trong `ForEach` của bạn:

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page26..CodeBlock13
no: Button { //#-learning-code-snippet(buttonAction) } label: { //#-learning-code-snippet(buttonLabel) }
vi: Button { //#-learning-code-snippet(buttonAction) } label: { //#-learning-code-snippet(buttonLabel) }

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page27..Paragraph57
no: Når noen trykker på et rektangel, vil du at `selectedColor` skal endres til fargen på rektangelet. Det er det som er handlingen!
vi: Khi một người nào đó chạm vào một hình chữ nhật, bạn muốn thay đổi màu `selectedColor` của hình chữ nhật đó — đó chính là hành động!

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page27..Paragraph58
no: Det gjør du ved å legge til denne koden som handling for knappen:
vi: Để thực hiện việc này, hãy thêm mã sau đây làm hành động nút của bạn:

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page27..CodeBlock14
no: selectedColor = allColors[index]
vi: selectedColor = allColors[index]

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page28..Paragraph59
no: `Button`-[etiketten](glossary://label) definerer hvordan den vises. Legg til en `RoundedRectangle`-visning for å vise knappen din som det samme avrundede rektangelet du hadde tidligere.
vi: [Nhãn](glossary://label) `Button` xác định cách nút xuất hiện. Thêm một chế độ xem `RoundedRectangle` để hiển thị nút của bạn giống hệt như hình chữ nhật góc bo tròn mà bạn đã có trước đây.

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page28..Paragraph60
no: Fjern `RoundedRectangle`-visningen utenfor `Button`, slik at du ikke får ekstra visninger uten knapper i rutenettet.
vi: Đảm bảo xóa chế độ xem `RoundedRectangle` bên ngoài `Button` hoặc bạn sẽ có các chế độ xem dư thừa, không phải là nút trong lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page28..CodeBlock15
no: RoundedRectangle(cornerRadius: 4.0) .aspectRatio(1.0, contentMode: ContentMode.fit) .foregroundColor(allColors[index])
vi: RoundedRectangle(cornerRadius: 4.0) .aspectRatio(1.0, contentMode: ContentMode.fit) .foregroundColor(allColors[index])

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page29..Paragraph61
no: Nå kommer det morsomme. Legg til et bilde, og bruk forskjellige filtre for å få det til å reagere på endringer i `selectedColor`.
vi: Bây giờ là phần thú vị. Hãy thêm một hình ảnh và cho phép hình ảnh đó phản hồi các thay đổi trong `selectedColor` bằng cách áp dụng các bộ lọc khác nhau trên ảnh.

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page29..Paragraph62
no: Ved å bruke `.colorMultiply(_:)`-modifikatoren og overføre `selectedColor` bytter bildet farge hver gang du velger en ny farge:
vi: Bằng việc sử dụng trình sửa đổi `.colorMultiply(_:)` và chuyển vào `selectedColor`, hình ảnh thay đổi màu bất kỳ lúc nào bạn chọn một màu mới:

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page29..CodeBlock16
no: Image("cactuswren") .resizable() .scaledToFit() .colorMultiply(selectedColor)
vi: Image("cactuswren") .resizable() .scaledToFit() .colorMultiply(selectedColor)

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page30..Paragraph63
no: Prøv å velge forskjellige farger i rutenettet. Endrer bildet farge når du gjør det?
vi: Thử chọn các màu khác nhau từ lưới. Hình ảnh của bạn có thay đổi màu theo không?

source: GuideBook..Guide0..StepOrganizing with grids..TaskselectColor..Page30..Paragraph64
no: Prøv å legge til din egen `Image`-visning med ditt eget bilde, og bruk et filter på det. Lykke til!
vi: Bây giờ, hãy thử thêm chế độ xem `Image` của riêng bạn với một ảnh tùy chỉnh và áp dụng một bộ lọc cho ảnh đó. Chúc bạn may mắn!
