Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 2/3 - Organizando com Grades/Organizando com Grades.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..title
no: Organisere med rutenett
vi: Sắp xếp với các lưới

source: GuideBook..WelcomeMessageOrganizing with grids..title
no: Organisere med rutenett
vi: Sắp xếp với các lưới

source: GuideBook..WelcomeMessageOrganizing with grids..Paragraph0
no: Dette eksempelet viser hvordan du kan organisere innhold ved hjelp av to forskjellige typer rutenett. Er du klar til å hoppe inn i matrisen?
vi: Mẫu này hướng dẫn bạn cách sắp xếp nội dung bằng hai kiểu chế độ xem lưới khác nhau. Bạn sẵn sàng bước vào ma trận chưa?

source: GuideBook..Guide0..StepOrganizing with grids..title
no: Organisere med rutenett
vi: Sắp xếp với các lưới

source: GuideBook..Guide0..StepOrganizing with grids..LearningCenterContent..Paragraph1
no: ![](intro.png)
vi: ![](intro.png)

source: GuideBook..Guide0..StepOrganizing with grids..LearningCenterContent..Paragraph2
no: I dette eksempelet lærer du hvordan du organiserer innhold ved hjelp av to vanlige former for rutenettvisning: [Grid](doc://com.apple.documentation/documentation/swiftui/grid) og [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid).
vi: Trong mẫu này, bạn sẽ tìm hiểu cách sắp xếp nội dung bằng hai kiểu chế độ xem lưới phổ biến: [Lưới](doc://com.apple.documentation/documentation/swiftui/grid) và [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid).

source: GuideBook..Guide0..StepOrganizing with grids..LearningCenterContent..Paragraph3
no: Et rutenett er en av de vanligste måtene å organisere innhold på i apper. Disse eksperimentene hjelper deg med å mestre rutenett, slik at du kan skape dine egne grensesnitt med rutenettyper som kan tilpasses. Hurra!
vi: Lưới là một trong những cách phổ biến nhất để trình bày bố cục nội dung trong ứng dụng của bạn. Những thử nghiệm này sẽ giúp bạn trở thành một chuyên gia về lưới có thể xác minh, thể hiện các giao diện mạnh mẽ của riêng bạn với các kiểu lưới có thể tùy chỉnh đầy đủ. Yeehaw!

source: GuideBook..Guide0..StepOrganizing with grids..LearningCenterContent..Paragraph4
no: Når du er ferdig med dette eksempelet, kan du fortsette å lære hvordan du oppretter rutenettbaserte apper i [Editing Grids](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.editinggrids).
vi: Sau khi hoàn tất mẫu này, bạn có thể tiếp tục tìm hiểu cách tạo các ứng dụng dựa trên lưới trong [Sửa lưới](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.editinggrids).

source: GuideBook..Guide0..StepOrganizing with grids..LearningCenterContent..GuideButtonStart Walkthrough..title
no: Start gjennomgangen
vi: Bắt đầu hướng dẫn

source: GuideBook..Guide0..StepOrganizing with grids..LearningCenterContent..GuideButtonStart Walkthrough..description
no: Tilgjengelighetsbeskrivelse for knapp
vi: Mô tả AX cho nút

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..title
no: Opprett og tilpass et enkelt rutenett
vi: Tạo ra và tùy chỉnh một lưới đơn giản

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Paragraph5
no: Opprett en enkel rutenettlayout ved hjelp av `Grid`.
vi: Tạo ra một bố cục lưới đơn giản bằng `Grid`.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page0..Paragraph6
no: Rutenett er nyttige når du oppretter et [brukergrensesnitt](glossary://user%20interface) som viser innhold i flere rader og kolonner, for eksempel TV-serier i Apple TV+.
vi: Lưới có vai trò hữu ích trong việc tạo ra một [giao diện người dùng](glossary://user%20interface) hiển thị nội dung trong nhiều hàng và cột, ví dụ như các chương trình TV trên Apple TV+.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page0..Paragraph7
no: Denne koden viser en struktur for en grunnleggende `Grid`-visning. En `Grid` er en [visning](glossary://view), og derfor kan den inneholde et valgfritt antall visninger. For å fylle rutenettet med visninger legger du til en `GridRow` som inneholder flere `Color`-visninger som skal vises.
vi: Mã sau đây minh họa một cấu trúc cho một chế độ xem `Grid` cơ bản. `Grid` là một [chế độ xem](glossary://view) nên có thể chứa bất kỳ số lượng chế độ xem nào khác bên trong. Để điền kín các chế độ xem vào lưới, hãy thêm một `GridRow` chứa một số chế độ xem `Color` sẽ hiển thị.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page0..CodeBlock0
no: GridRow { Color.mint Color.orange Color.pink }
vi: GridRow { Color.mint Color.orange Color.pink }

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page1..Paragraph8
no: Første `GridRow` viser tre visninger med forskjellig `Color`-verdi. Ser det ikke fint ut?
vi: `GridRow` đầu tiên này hiển thị ba chế độ xem, mỗi chế độ xem có một giá trị `Color` khác nhau. Như vậy rất đẹp phải không?

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page1..Paragraph9
no: Du kan legge til så mange rader du vil i rutenettet. Prøv å legge til en ekstra `GridRow` for å se hvordan rutenettet endres:
vi: Bạn có thể thêm số lượng hàng tùy thích vào lưới của mình. Thử thêm một `GridRow` thứ hai để xem lưới thay đổi như thế nào:

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page1..CodeBlock1
no: GridRow { Color.blue Color.teal //#-learning-code-snippet(gridCellColumns) }
vi: GridRow { Color.blue Color.teal //#-learning-code-snippet(gridCellColumns) }

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page2..Paragraph10
no: Legger du merke til noe interessant? Den `GridRow` som har flest visninger, bestemmer hvor mange kolonner det skal være i rutenettet. Selv om den andre raden bare har to visninger, er det fortsatt tre kolonner i rutenettet, slik at det ene området i rutenettet blir tomt.
vi: Bạn có nhận thấy bất kỳ điều gì thú vị không? `GridRow` có nhiều chế độ xem nhất xác định số lượng cột trong lưới. Mặc dù hàng thứ hai của bạn chỉ có hai chế độ xem, nhưng lưới vẫn có ba cột, để trống một không gian lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page2..Paragraph11
no: Av og til kan det være helt greit, men hva hvis du vil gjøre noe med det? 🤔 Her er et forslag: Du kan la den ene visningen i denne raden fylle flere kolonner.
vi: Đôi khi việc này có thể chấp nhận được, nhưng nếu bạn muốn thay đổi thì sao? 🤔 Đây là một ý tưởng: bạn có thể cho phép một trong các chế độ xem trong hàng này chiếm hữu nhiều cột.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page2..Paragraph12
no: Legg til `.gridCellColumns(_:)`-modifikatoren i en av visningene i den andre raden for å få den til å bruke to områder. Endre deretter antall områder som brukes, for å se hvordan det påvirker rutenettet.
vi: Thêm trình sửa đổi `.gridCellColumns(_:)` vào một trong các chế độ xem trong hàng thứ hai để cho phép chiếm hữu hai không gian. Sau đó thay đổi số lượng không gian được chiếm hữu để xem sự tác động đối với lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page2..CodeBlock2
no: .gridCellColumns(2)
vi: .gridCellColumns(2)

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page3..Paragraph13
no: Legg til en ekstra `GridRow` selv, og fyll den med så mange av dine egne visninger som du vil.
vi: Tự thêm một `GridRow` khác và điền vào số lượng tùy thích các chế độ xem của riêng bạn.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page3..Paragraph14
no: Prøv å bruke `Text`-, `Image`- og `Color`-visningen i raden i rutenettet. Hva legger du merke til for området der de brukes? Din `GridRow` endrer automatisk størrelse for å få plass til den høyeste visningen i raden.
vi: Thử sử dụng các chế độ xem `Text`, `Image` và `Color` trong hàng lưới. Bạn nhận thấy điều gì về không gian mà chúng chiếm hữu? `GridRow` của bạn tự động định cỡ lại để vừa với chế độ xem cao nhất của hàng.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page4..Paragraph15
no: Du kan bruke parametrene `alignment`, `horizontalSpacing` og `verticalSpacing` til å tilpasse avstanden og justeringen i rutenettet. Prøv å legge til disse parametrene nå:
vi: Bạn có thể điều chỉnh khoảng cách và căn chỉnh của lưới bằng các tham số `alignment`, `horizontalSpacing` và `verticalSpacing` của lưới. Thử thêm các tham số đó bây giờ:

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page4..CodeBlock3
no: Grid(alignment: .top, horizontalSpacing: 20, verticalSpacing: 40)
vi: Grid(alignment: .top, horizontalSpacing: 20, verticalSpacing: 40)

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page5..Paragraph16
no: Du kan også bruke `alignment`-parameteren for `GridRow` for å tilpasse justeringen for individuelle rader. Innstillingen for raden overstyrer innstillingen for rutenettets justering.
vi: Bạn cũng có thể điều chỉnh cách căn chỉnh cho các hàng riêng lẻ bằng tham số `alignment` cho `GridRow`. Cài đặt cho hàng đó thay thế cài đặt căn chỉnh của lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page5..CodeBlock4
no: GridRow(alignment: .bottom) { Text("Jeg er nederst i visningen!") Color.red }
vi: GridRow(alignment: .bottom) { Text("Tôi ở dưới cùng của chế độ xem!") Color.red }

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page6..Paragraph17
no: Du kan til og med tilpasse justeringen for enkelte celler i rutenettet ved hjelp av `.gridCellAnchor(_:)`-modifikatoren. Nå kan du bokstavelig talt tilpasse alt i rutenettet!
vi: Bạn thậm chí có thể điều chỉnh cách căn chỉnh cho các ô lưới riêng lẻ bằng trình sửa đổi `.gridCellAnchor(_:)`. Chà, đúng là bạn có thể tùy chỉnh mọi khía cạnh của lưới này!

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page6..CodeBlock5
no: Text("Ingen farge her") .gridCellAnchor(.center)
vi: Text("Ở đây không có màu") .gridCellAnchor(.center)

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page7..Paragraph18
no: Når du oppretter innhold med en `Grid`, får du full kontroll over layouten for rutenettets rader og kolonner.
vi: Việc tạo ra nội dung bằng một `Grid` cung cấp cho bạn quyền kiểm soát nâng cao đối với bố cục hàng và cột của lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcreateAGrid..Page7..Paragraph19
no: Men SwiftUI har også en annen type rutenett, en [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid). Den passer bedre når du skal vise en [samling](glossary://collection) med data, fordi den kan beregne automatisk hvor mange rader du trenger, uten at du må angi det først.
vi: Nhưng SwiftUI có một kiểu lưới khác, [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid), phù hợp hơn để hiển thị một [tập hợp](glossary://collection) dữ liệu. Đó là vì lưới này có thể tự động tính toán số lượng hàng mà bạn sẽ cần mà không yêu cầu bạn chỉ định trước.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..title
no: Opprett et rutenett fra en samling med data
vi: Tạo ra một lưới từ một tập hợp dữ liệu

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Paragraph20
no: Opprett en `LazyVGrid` fylt med fargede rektangler.
vi: Tạo ra một `LazyVGrid` được điền kín các hình chữ nhật màu.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page8..Paragraph21
no: I `ContentView` bruker du en [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid) til å opprette et rutenett med avrundede rektangler i forskjellige farger.
vi: Trong `ContentView`, bạn sẽ sử dụng một [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid) để tạo ra một lưới các hình chữ nhật góc bo tròn có màu khác nhau.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page9..Paragraph22
no: `LazyVGrid` skiller seg ut fra `Grid` på to viktige måter:
vi: `LazyVGrid` khác với `Grid` ở hai điểm quan trọng:

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page9..UnorderedList0..Paragraph23
no: Den er «forsinket» 🦥 fordi rutenettet ikke oppretter de individuelle rutenettobjektene før det er bruk for dem. Dette kan skje når det finnes flere rutenettobjekter enn appen kan vise samtidig.
vi: Chế độ này “lười biếng” 🦥 vì lưới không tạo ra các mục lưới riêng lẻ cho đến khi cần thiết. Việc này có thể xảy ra khi có nhiều mục lưới hơn mức mà ứng dụng có thể hiển thị cùng lúc.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page9..UnorderedList0..Paragraph24
no: I stedet for å opprette hver rad individuelt, som i `Grid`, gir du bare `LazyVGrid` beskjed om hvor mange kolonner som skal brukes. Antall rader bestemmes basert på hvor mange visninger du overfører. Det betyr at `LazyVGrid` er perfekt når du vil fylle visninger fra en [samling](glossary://collection) med data, for eksempel en [matrise](glossary://array).
vi: Thay vì tạo ra từng hàng riêng lẻ, như trong `Grid`, bạn chỉ cần cho `LazyVGrid` biết số lượng cột sẽ sử dụng và chế độ này xác định số lượng hàng dựa trên số lượng chế độ xem mà bạn chuyển vào. Điều này làm cho `LazyVGrid` trở nên xuất sắc trong việc điền các chế độ xem từ một [tập hợp](glossary://collection) dữ liệu, ví dụ như một [dãy](glossary://array).

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page10..Paragraph25
no: For å fylle rutenettet med forskjellige farger bruker du [variabelen](glossary://variable) `allColors`. Rutenettet [itererer](glossary://iteration) over denne [matrisen](glossary://array) med fargeverdier og lager en rektangulær knapp for hver farge.
vi: Để tô màu vào lưới với các màu khác nhau, bạn sẽ sử dụng [biến](glossary://variable) `allColors`. Lưới [lặp lại](glossary://iteration) trên [dãy](glossary://array) giá trị màu này và tạo ra một nút hình chữ nhật cho từng màu.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page11..Paragraph26
no: Rutenettet kan inneholde flere objekter enn det kan vise samtidig. Derfor pakker koden det i en [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview), slik at innholdet rulles vertikalt ved behov.
vi: Lưới có thể chứa nhiều mục hơn mức có thể hiển thị một lần nên mã đóng gói lưới trong một [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) để cuộn nội dung theo chiều dọc, nếu cần.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page12..Paragraph27
no: Du oppretter [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid) i `ScrollView` og overfører et [argument](glossary://argument) for `columns` for å bestemme hvor mange kolonner som skal vises i rutenettet.
vi: Bên trong `ScrollView`, bạn tạo ra [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid) và chuyển vào một [đối số](glossary://argument) cho `columns` để xác định số lượng cột sẽ hiển thị trong lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page13..Paragraph28
no: Verdien som er tildelt til `columnLayout`, angir at rutenettet skal ha tre kolonner. `LazyGrid` bruker denne verdien til å bestemme kolonnelayouten.
vi: Giá trị được gán cho `columnLayout` chỉ định một lưới gồm ba cột. `LazyGrid` sử dụng giá trị này để xác định bố cục cột.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page13..Paragraph29
no: Prøv å endre `count`-verdien til `2`, `4` eller et annet tall, og se hvordan det påvirker rutenettets utseende. Hva skjer med antallet rader når kolonnene endres?
vi: Thử thay đổi giá trị `count` thành `2`, `4` hoặc một số khác và lưu ý cách giá trị đó ảnh hưởng đến sự sắp xếp của lưới. Điều gì xảy ra đối với số lượng hàng khi các cột thay đổi?

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page14..Paragraph30
no: I `LazyVGrid` oppretter du hver visning som rutenettet skal vise, ved hjelp av en spesiell type løkke som kalles `ForEach`.
vi: Bên trong `LazyVGrid`, bạn có thể tạo ra từng chế độ xem để lưới hiển thị bằng cách sử dụng một kiểu vòng lặp đặc biệt, có tên là `ForEach`.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page14..Paragraph31
no: En `ForEach`-løkke skaper [visninger](glossary://view) når den [itererer](glossary://iteration) over en del data. Her itererer du over [indeksene](glossary://index) i [matrisen](glossary://array) `allColors` for å opprette `RoundedRectangle`-visninger for hvert objekt i matrisen.
vi: Vòng lặp `ForEach` tạo ra các [chế độ xem](glossary://view) khi [lặp lại](glossary://iteration) trên một số dữ liệu. Tại đây, bạn lặp lại trên các [chỉ mục](glossary://index) của [dãy](glossary://array) `allColors` để tạo ra các chế độ xem `RoundedRectangle` cho từng mục trong dãy.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page15..Paragraph32
no: Hver [RoundedRectangle](doc://com.apple.documentation/documentation/swiftui/roundedrectangle/)-visning setter forgrunnsfargen sin til en verdi fra `allColors`-matrisen ved hjelp av den aktuelle indeksen for `ForEach`-løkken.
vi: Mỗi chế độ xem [RoundedRectangle](doc://com.apple.documentation/documentation/swiftui/roundedrectangle/) đặt màu nền trước của mình thành một giá trị từ dãy `allColors` sử dụng chỉ mục hiện tại của vòng lặp `ForEach`.

source: GuideBook..Guide0..StepOrganizing with grids..TaskcontentView..Page15..Paragraph33
no: Tada! Koden oppretter et fint rutenett med fargede rektangler med avrundede hjørner.
vi: Bất ngờ chưa! Mã tạo ra một lưới các hình chữ nhật màu với các góc bo tròn đẹp mắt.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..title
no: Tilpass det forsinkede vertikale rutenettet
vi: Điều chỉnh lưới dọc lazy

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Paragraph34
no: Finjuster layouten for kolonnene i `LazyVGrid`.
vi: Tinh chỉnh cách trình bày bố cục các cột của `LazyVGrid`.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page16..Paragraph35
no: For å tilpasse en `LazyVGrid` må du tilpasse matrisen med `GridItem`-[instanser](glossary://instance). Det er dette som bestemmer antall, størrelse og avstand mellom kolonner i rutenettet.
vi: Để điều chỉnh một `LazyVGrid`, hãy tùy chỉnh dãy gồm các [thể hiện](glossary://instance) `GridItem`. Phần này xác định số lượng, kích cỡ và khoảng cách của các cột trong lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page16..Paragraph36
no: Hver `GridItem` inneholder [parametre](glossary://parameter) for `size`, `spacing` og `alignment`. Prøv å bytte ut `GridItem()` i `columnLayout` med den under:
vi: Mỗi `GridItem` chứa các [tham số](glossary://parameter) cho `size`, `spacing` và `alignment`. Hãy thử thay thế `GridItem()` hiện có trong `columnLayout` bằng thể hiện ở bên dưới:

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page16..CodeBlock6
no: GridItem(.fixed(75), spacing: 20, alignment: .center)
vi: GridItem(.fixed(75), spacing: 20, alignment: .center)

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page17..Paragraph37
no: Hva legger du merke til med `GridItems` nå?
vi: Bạn nhận thấy điều gì về `GridItems` bây giờ?

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page17..Paragraph38
no: For det første har de [fast](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/fixed(_:)) størrelse. Hvis du utvider størrelsen på forhåndsvisningen, vil de ikke utvides eller krympe. Så utrolig lite fleksibelt av dem! Det skyldes at du brukte `.fixed(_:)` til å bestemme størrelsen på rutenettobjektet.
vi: Thứ nhất, chúng có kích cỡ [cố định](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/fixed(_:)). Nếu bạn mở rộng bản xem trước thì chúng cũng không mở rộng và thu nhỏ để điều chỉnh theo không gian lớn hơn hoặc nhỏ hơn. Chúng thực sự là cứng nhắc và cố định! Đó là vì bạn đã sử dụng `.fixed(_:)` để xác định kích cỡ của mục lưới.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page18..Paragraph39
no: I stedet for å gi alle rutenettobjektene fast størrelse, kan du gjøre dem [fleksible](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)), slik at størrelsen tilpasses etter hvor mye plass som er tilgjengelig.
vi: Thay vì làm cho các mục lưới có kích cỡ cố định, bạn có thể làm cho chúng [linh hoạt](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) để chúng điều chỉnh kích cỡ theo mức không gian khả dụng.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page18..Paragraph40
no: Hvis du ikke angir argumenter for `.flexible()`, er det ingen begrensning for hvor store eller små objektene i rutenettet kan bli, men du kan begrense størrelsen til en minimums- og maksimumsverdi ved hjelp av parametrene `minimum` og `maximum`.
vi: Nếu bạn không cung cấp đối số cho `.flexible()` thì các mục lưới không bị hạn chế về kích cỡ có thể đạt được. Tuy nhiên, bạn có thể giới hạn kích cỡ đến một giá trị nhỏ nhất và lớn nhất bằng các tham số `minimum` và `maximum`.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page19..Paragraph41
no: Prøv disse `GridItem`-[initialisererne](glossary://initialization), en om gangen, for å se hvordan rutenettet tilpasser seg når du utvider og trekker sammen forhåndsvisningen:
vi: Hãy thử lần lượt từng [trình khởi tạo](glossary://initialization) `GridItem` mỗi lần để xem lưới điều chỉnh như thế nào khi bạn mở rộng và thu nhỏ bản xem trước:

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page19..CodeBlock7
no: GridItem(.flexible())
vi: GridItem(.flexible())

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page19..CodeBlock8
no: GridItem(.flexible(minimum: 20, maximum: 100))
vi: GridItem(.flexible(minimum: 20, maximum: 100))

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page20..Paragraph42
no: I `columnLayout` bruker du den samme `GridItem`, gjentatt flere ganger. Så kjedelig! Hvis du vil ha mer kontroll over layouten av kolonnene, kan du lage en tilpasset layout for hver kolonne ved å opprette hver `GridItem` individuelt.
vi: Trong `columnLayout`, bạn sử dụng `GridItem` giống hệt nhau, được lặp lại một số lần nhất định. Thật là tẻ nhạt! Nếu bạn muốn kiểm soát nhiều hơn đối với cách trình bày các cột thì bạn có thể tạo ra một bố cục tùy chỉnh cho các cột bằng cách tạo ra từng `GridItem` riêng lẻ.

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page20..Paragraph43
no: Legg til en tilpasset layout under `columnLayout`:
vi: Thêm một bố cục tùy chỉnh bên dưới `columnLayout`:

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page20..CodeBlock9
no: let customColumns = [GridItem(.fixed(75)), GridItem(.fixed(100)), GridItem(.flexible(minimum: 125, maximum: 250))]
vi: let customColumns = [GridItem(.fixed(75)), GridItem(.fixed(100)), GridItem(.flexible(minimum: 125, maximum: 250))]

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page21..Paragraph44
no: Deretter bytter du ut `columns`-argumentet i `LazyVGrid` med `customColumns`:
vi: Tiếp theo, hãy hoán đổi đối số `columns` trong `LazyVGrid` bằng `customColumns`:

source: GuideBook..Guide0..StepOrganizing with grids..TaskadjustLazyVGrid..Page21..CodeBlock10
no: LazyVGrid(columns: customColumns)
vi: LazyVGrid(columns: customColumns)
