Repository: caioagralemos/Swift-Playgrounds
Catalog: 1 - Comece com Apps/Comece com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..Guide0..StepComposability..TaskcomposeAView..Page20..CodeBlock10
no: Image("Friend") .resizable() .scaledToFit()
vi: Image("Friend") .resizable() .scaledToFit()

source: GuideBook..Guide0..StepComposability..TaskcomposeAView..Page21..Paragraph49
no: Nå inneholder visningen en `Image`-visning i `HStack`, som ligger i `VStack`.
vi: Nói chung, chế độ xem của bạn hiển thị một chế độ xem `Image` bên trong `HStack`, tất cả bên trong `VStack`.

source: GuideBook..Guide0..StepComposability..TaskcomposeAView..Page21..CodeBlock11
no: VStack { HStack { Image("Friend") .resizable() .scaledToFit() } }
vi: VStack { HStack { Image("Friend") .resizable() .scaledToFit() } }

source: GuideBook..Guide0..StepComposability..TaskaddVStackInHStack..title
no: Legge til en `VStack` i en `HStack`.
vi: Thêm một `VStack` bên trong một `HStack`.

source: GuideBook..Guide0..StepComposability..TaskaddVStackInHStack..Page22..Paragraph50
no: I `HStack`, og under `Image`-visningen, legger du til en [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) for å organisere noen tekstvisninger vertikalt.
vi: Bên trong `HStack` và bên dưới chế độ xem `Image`, hãy thêm một [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) để sắp xếp một số chế độ xem văn bản theo chiều dọc.

source: GuideBook..Guide0..StepComposability..TaskaddVStackInHStack..Page23..Paragraph51
no: Slik ser `VStack` ut når den er plassert i `HStack`:
vi: Đây là hình thức của `VStack` khi được đặt bên trong `HStack`:

source: GuideBook..Guide0..StepComposability..TaskaddVStackInHStack..Page23..CodeBlock12
no: HStack { Image("Friend") .resizable() .scaledToFit() VStack { } }
vi: HStack { Image("Friend") .resizable() .scaledToFit() VStack { } }

source: GuideBook..Guide0..StepComposability..TaskaddTextInVStack..title
no: Legge til en `Text`-visning i `VStack`.
vi: Thêm chế độ xem `Text` bên trong `VStack`.

source: GuideBook..Guide0..StepComposability..TaskaddTextInVStack..Page24..Paragraph52
no: Lag en [Text](doc://com.apple.documentation/documentation/swiftui/text)-visning som sier «Friend» i `VStack`.
vi: Bên trong `VStack` của bạn, hãy tạo một chế độ xem [Văn bản](doc://com.apple.documentation/documentation/swiftui/text) có nội dung “Bạn bè”.

source: GuideBook..Guide0..StepComposability..TaskaddTextInVStack..Page25..Paragraph53
no: Hvis du vil gjøre fonten litt større, legger du til `.font`-modifikatoren i `Text`-visningen og overfører `.largeTitle` som argument.
vi: Để làm cho phông chữ lớn hơn một chút, hãy thêm trình sửa đổi `.font` vào chế độ xem `Text` và chuyển `.largeTitle` vào dưới dạng đối số.

source: GuideBook..Guide0..StepComposability..TaskaddTextInVStack..Page26..CodeBlock13
no: Text("Friend") .font(.largeTitle)
vi: Text("Bạn bè") .font(.largeTitle)

source: GuideBook..Guide0..StepComposability..TaskdescribeFriend..title
no: Legge til en ny `Text`-visning under den første for å beskrive vennen vår.
vi: Thêm một chế độ xem `Text` khác bên dưới chế độ xem thứ nhất để mô tả người bạn của chúng ta.

source: GuideBook..Guide0..StepComposability..TaskdescribeFriend..Page27..Paragraph54
no: Legg til en ny `Text`-visning under den første i `VStack`, slik at du kan gi vennen vår en beskrivelse.
vi: Thêm một chế độ xem `Text` thứ hai bên dưới chế độ xem đầu tiên trong `VStack` để bạn có thể cung cấp mô tả cho người bạn của chúng ta.

source: GuideBook..Guide0..StepComposability..TaskdescribeFriend..Page28..Paragraph55
no: Legg til `.font`-modifikatoren og overfør `.caption` som argument for å endre fonten for denne tekstvisningen.
vi: Để tùy chỉnh phông chữ của chế độ xem văn bản này, hãy thêm trình sửa đổi `.font` và chuyển `.caption` vào dưới dạng đối số.

source: GuideBook..Guide0..StepComposability..TaskdescribeFriend..Page29..Paragraph56
no: Den andre `Text`-visningen vises under den første, og koden skal se omtrent slik ut:
vi: Chế độ xem `Text` thứ hai của bạn xuất hiện bên dưới chế độ xem thứ nhất và mã sẽ trông giống như sau.

source: GuideBook..Guide0..StepComposability..TaskdescribeFriend..Page29..CodeBlock14
no: Text("The best teacher of SwiftUI this side of the Milky Way!") .font(.caption)
vi: Text("Giáo viên tốt nhất của SwiftUI ở phía bên này của Dải Ngân Hà!") .font(.caption)

source: GuideBook..Guide0..StepComposability..SuccessMessage..Paragraph57
no: Gratulerer! Du har opprettet en [sammenstilt visning](glossary://composed%20view).
vi: Chúc mừng, bạn vừa tạo được một [chế độ xem tổ hợp](glossary://composed%20view).

source: GuideBook..Guide0..StepComposability..SuccessMessage..Paragraph58
no: En sammenstilt visning, for eksempel `FriendDetailView`, kan brukes i alle andre SwiftUI-visninger, slik at du kan gjenbruke deler av [brukergrensesnittet](glossary://user%20interface) i appene du lager.
vi: Chế độ xem tổ hợp, ví dụ như `FriendDetailView`, có thể được sử dụng bên trong bất kỳ chế độ xem SwiftUI nào khác, cho phép bạn sử dụng lại các mảng chung của [UI](glossary://user%20interface) trong các ứng dụng mà bạn xây dựng.

source: GuideBook..Guide0..StepExperiment with SwiftUI..title
no: Eksperimenter med SwiftUI
vi: Thử nghiệm với SwiftUI

source: GuideBook..Guide0..StepExperiment with SwiftUI..LearningCenterContent..Paragraph59
no: ![](experiment-with-swiftui@2x.png)
vi: ![](experiment-with-swiftui@2x.png)

source: GuideBook..Guide0..StepExperiment with SwiftUI..LearningCenterContent..Paragraph60
no: Nå som du har lært det grunnleggende i SwiftUI, er det på tide å eksperimentere litt.
vi: Bây giờ bạn đã biết các khái niệm cơ bản về SwiftUI, đã đến lúc thử nghiệm một chút.

source: GuideBook..Guide0..StepExperiment with SwiftUI..LearningCenterContent..Paragraph61
no: Prøv å bruke alt du har lært om SwiftUI, til å lage et [brukergrensesnitt](glossary://user%20interface) som beskriver Learn to Code-karakterene.
vi: Hãy cố gắng sử dụng tất cả những gì bạn đã học được về SwiftUI để tạo ra một [UI](glossary://user%20interface) mô tả dàn nhân vật của Học cách viết mã.

source: GuideBook..Guide0..StepExperiment with SwiftUI..LearningCenterContent..Paragraph62
no: Start med å bruke `FriendDetailView` som du allerede har laget.
vi: Để bắt đầu, hãy sử dụng `FriendDetailView` mà bạn đã biên soạn.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateDetailView..title
no: Opprett en instans av `FriendDetailView`.
vi: Tạo ra một thể hiện của `FriendDetailView`.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateDetailView..Page30..Paragraph63
no: Initialiser `FriendDetailView` for å se den [sammenstilte visningen](glossary://composed%20view) i `ExperimentView`.
vi: Khởi chạy `FriendDetailView` để xem [chế độ xem tổ hợp](glossary://composed%20view) của bạn ở bên trong của `ExperimentView`.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateDetailView..Page30..CodeBlock15
no: FriendDetailView()
vi: FriendDetailView()

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..title
no: Opprett en lignende visning med Blus bilde.
vi: Bây giờ, hãy tạo một chế độ xem tương tự bằng hình ảnh của Blu.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page31..Paragraph64
no: Nå er det på tide å teste SwiftUI-kunnskapen din. Lag en visning som ligner på `FriendDetailView`, ved å bruke Blus bilde og beskrivelse. Du kan stable denne visningen vertikalt under `FriendDetailView`.
vi: Đã đến lúc kiểm tra các kỹ năng SwiftUI của bạn. Hãy tạo ra một chế độ xem tương tự như `FriendDetailView` bằng hình ảnh và mô tả của Blu. Bạn có thể xếp chồng chế độ xem này theo chiều dọc, bên dưới `FriendDetailView`.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page32..Paragraph65
no: Start med å lage en `HStack` og plassere Blus bilde i den:
vi: Bắt đầu bằng cách tạo ra một `HStack` và đặt hình ảnh của Blu ở bên trong đó:

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page32..CodeBlock16
no: HStack { Image("Blu") }
vi: HStack { Image("Blu") }

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page33..Paragraph66
no: Deretter legger du til to [modifikatorer](glossary://modifier) i `Image`-visningen. Bruk `.resizable()`, slik at bildet kan endre størrelse, og `.scaledToFit`, slik at det tilpasses størrelsen på visningen.
vi: Tiếp theo, hãy thêm hai [trình sửa đổi](glossary://modifier) vào chế độ xem `Image`. Hãy sử dụng `.resizable()` để hình ảnh có thể thay đổi kích cỡ và `.scaledToFit` để hình ảnh định cỡ lại để vừa bên trong chế độ xem.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page34..Paragraph67
no: Nå må du legge til teksten. Legg til en `VStack` i `HStack` for å organisere de to tekstvisningene vertikalt.
vi: Bây giờ, bạn sẽ cần thêm văn bản. Để sắp xếp hai chế độ xem văn bản theo chiều dọc, hãy thêm một `VStack` bên trong một `HStack`.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page35..Paragraph68
no: Til slutt legger du til to `Text`-visninger i `VStack`. Legg til `.font`-modifikatoren for hver tekstvisning, slik at de bruker riktig fontstil.
vi: Cuối cùng, hãy thêm hai chế độ xem `Text` bên trong `VStack`. Hãy thêm trình sửa đổi `.font` vào mỗi chế độ xem văn bản để chúng sử dụng đúng kiểu phông chữ.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page36..Paragraph69
no: Koden for Blus visning kan for eksempel se slik ut:
vi: Mã của bạn cho chế độ xem của Blu có thể trông giống như sau:

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateBluView..Page36..CodeBlock17
no: HStack { Image("Blu") .resizable() .scaledToFit() VStack { Text("Blu") .font(.largeTitle) Text("A fierce, cloud-loving water droplet with nothing to lose.") .font(.caption) } }
vi: HStack { Image("Blu") .resizable() .scaledToFit() VStack { Text("Blu") .font(.largeTitle) Text("Một giọt nước mạnh mẽ, yêu thích những đám mây và không có gì để mất.") .font(.caption) } }

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateHopperView..title
no: Nå skal du lage en lignende visning ved hjelp av Hoppers bilde.
vi: Bây giờ, hãy tạo một chế độ xem tương tự bằng hình ảnh của Hopper.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateHopperView..Page37..Paragraph70
no: Prøv å lage en ekstra visning ved hjelp av Hoppers bilde og beskrivelse, men denne gangen kan du bruke litt tid på å eksperimentere med å plassere teksten og bildene på forskjellige måter. Prøv å bytte `HStack` og `VStack` eller å legge til en ekstra stabel for å se hvordan det påvirker layouten.
vi: Thử biên soạn một chế độ xem nữa bằng hình ảnh và mô tả của Hopper. Chỉ trong lần này, hãy dành thời gian để thử nghiệm, tạo bố cục văn bản và hình ảnh theo nhiều cách khác nhau. Hãy thử hoán đổi `HStack` và `VStack` của bạn hoặc thêm một ngăn xếp bổ sung để xem bố cục của bạn thay đổi như thế nào.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateHopperView..Page37..CodeBlock18
no: Image("Hopper")
vi: Image("Hopper")

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateHopperView..Page38..Paragraph71
no: Prøv å lage denne visningen selv ved å bruke visningene for vennen vår og Blu som inspirasjon. Prøv nye layouter ved å kombinere visningene `HStack`, `VStack`, `Text` og `Image` på forskjellige måter.
vi: Hãy thử tự mình tạo ra chế độ xem này, sử dụng các chế độ xem cho người bạn của chúng ta và Blu làm nguồn cảm hứng. Hãy thử các bố cục mới bằng cách kết hợp các chế độ xem `HStack`, `VStack`, `Text` và `Image` theo nhiều cách khác nhau.

source: GuideBook..Guide0..StepExperiment with SwiftUI..TaskcreateHopperView..Page38..Paragraph72
no: Du kan for eksempel forsøke å stable Hoppers bilde vertikalt over to `Text`-visninger horisontalt.
vi: Ví dụ: bạn có thể thử tạo ngăn xếp hình ảnh của Hopper theo chiều dọc lên trên hai chế độ xem `Text` được sắp xếp theo chiều ngang.

source: GuideBook..Guide0..StepExperiment with SwiftUI..SuccessMessage..Paragraph73
no: Nå som du kan en del av det grunnleggende, kan du prøve å lage din egen app ved å bygge et [brukergrensesnitt](glossary://user%20interface) ved hjelp av SwiftUI-visninger.
vi: Bây giờ bạn đã biết một số khái niệm cơ bản, hãy thử tạo ra ứng dụng của riêng mình bằng cách xây dựng một [UI](glossary://user%20interface) bằng các chế độ xem SwiftUI.

source: GuideBook..Guide0..StepExperiment with SwiftUI..SuccessMessage..Paragraph74
no: Du kan prøve kunnskapen din ved å åpne [Om meg](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.aboutme) og [Organizing with Grids](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.organizingwithgrids) for å tilpasse koden og gjøre den til din egen.
vi: Để thử nghiệm một số kỹ năng mới học được của bạn, hãy xem phần [Giới thiệu về tôi](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.aboutme) và [Sắp xếp với các lưới](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.organizingwithgrids) để điều chỉnh mã và biến chúng thành của riêng bạn.

source: GuideBook..Guide0..StepExperiment with SwiftUI..SuccessMessage..Paragraph75
no: Lær mer om de grunnleggende funksjonene i SwiftUI i [Fortsett med apper](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.keepgoingwithapps), der du jobber videre med å lage apper.
vi: Để tiếp tục học các khái niệm cơ bản của SwiftUI, hãy chuyển sang phần [Tiếp tục với các ứng dụng](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.keepgoingwithapps) để tiếp tục hành trình xây dựng ứng dụng của bạn.
