Repository: caioagralemos/Swift-Playgrounds
Catalog: 1 - Comece com Apps/Comece com Apps.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..title
no: Kom i gang med apper
vi: Bắt đầu với các ứng dụng

source: GuideBook..Guide0..StepGet Started with Apps..title
no: Kom i gang med apper
vi: Bắt đầu với các ứng dụng

source: GuideBook..Guide0..StepGet Started with Apps..LearningCenterContent..Paragraph0
no: ![](get-started-with-apps@2x.png)
vi: ![](get-started-with-apps@2x.png)

source: GuideBook..Guide0..StepGet Started with Apps..LearningCenterContent..Paragraph1
no: I denne opplæringen lærer du det grunnleggende for å bruke SwiftUI til å lage apper.
vi: Trong Hướng dẫn này, bạn sẽ học các khái niệm cơ bản về việc sử dụng SwiftUI để xây dựng các ứng dụng.

source: GuideBook..Guide0..StepGet Started with Apps..LearningCenterContent..Paragraph2
no: [SwiftUI](glossary://SwiftUI) er en ny måte å kode apper på – enklere og raskere enn noensinne. SwiftUI-kode skrives i programmeringsspråket [Swift](glossary://Swift).
vi: [SwiftUI](glossary://SwiftUI) là một cách mã hóa ứng dụng mới, giúp việc đó trở nên dễ dàng hơn và nhanh hơn bao giờ hết. Mã SwiftUI được viết bằng ngôn ngữ lập trình [Swift](glossary://Swift).

source: GuideBook..Guide0..StepGet Started with Apps..LearningCenterContent..Paragraph3
no: Når du har fullført Kom i gang med apper, kan du gå videre til [Fortsett med apper](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.keepgoingwithapps) for å lære enda mer om SwiftUI.
vi: Khi bạn đã hoàn thành phần Bắt đầu với các ứng dụng, bạn có thể chuyển sang phần [Tiếp tục với các ứng dụng](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.keepgoingwithapps) để học nhiều hơn nữa về SwiftUI.

source: GuideBook..Guide0..StepGet Started with Apps..LearningCenterContent..Paragraph4
no: Det første skrittet for å lære SwiftUI er å forstå hvordan en SwiftUI-fil fungerer.
vi: Bước đầu tiên của quá trình học SwiftUI là hiểu cách hoạt động của tệp SwiftUI.

source: GuideBook..Guide0..StepGet Started with Apps..TaskgetStartedWithApps..title
no: Velkommen til SwiftUI
vi: Chào mừng bạn đến SwiftUI

source: GuideBook..Guide0..StepGet Started with Apps..TaskgetStartedWithApps..Page0..Paragraph5
no: I en SwiftUI-fil vises kodens utdata automatisk i forhåndsvisningen til høyre. Koden i denne filen lager teksten "Hello, friend."
vi: Trong tệp SwiftUI, đầu ra của mã được hiển thị tự động trong bản xem trước ở bên phải. Mã trong tệp này tạo ra văn bản “Hello, friend.”

source: GuideBook..Guide0..StepGet Started with Apps..TaskgetStartedWithApps..Page1..Paragraph6
no: I filen ser du navnet på [visningen](glossary://view) du ser på. Her ser du på visningen som heter `IntroView`.
vi: Bên trong tệp, bạn sẽ nhìn thấy tên của [chế độ xem](glossary://view) mà bạn đang nhìn vào. Tại đây, bạn đang nhìn vào chế độ xem có tên là `IntroView`.

source: GuideBook..Guide0..StepGet Started with Apps..TaskgetStartedWithApps..Page2..Paragraph7
no: I `IntroView`, ser du en [egenskap](glossary://property) med navnet `body`. Det er i [visningsinnholdet](glossary://body) du begynner å skrive SwiftUI-kode.
vi: Bên trong `IntroView`, bạn sẽ nhìn thấy một [thuộc tính](glossary://property) có tên là `body`. Bên trong [phần thân](glossary://body) là nơi mà bạn sẽ bắt đầu viết mã SwiftUI.

source: GuideBook..Guide0..StepGet Started with Apps..TaskgetStartedWithApps..Page3..Paragraph8
no: I `body` ser du en [Text](doc://com.apple.documentation/documentation/swiftui/text)-visning med teksten «Hello, friend.» i forhåndsvisningen.
vi: Bên trong `body`, bạn sẽ nhìn thấy một chế độ xem [Văn bản](doc://com.apple.documentation/documentation/swiftui/text), hiển thị văn bản “Hello, friend.” trong bản xem trước.

source: GuideBook..Guide0..StepGet Started with Apps..TaskgetStartedWithApps..Page4..Paragraph9
no: Apropos forhåndsvisningen er dette koden som genererer `IntroView`-forhåndsvisningen. Du kommer til å se liknende kode under mange forhåndsvisninger, slik at det blir enklere å visualisere koden du skriver.
vi: Nói về bản xem trước, đây là mã tạo ra bản xem trước `IntroView`. Bạn sẽ nhìn thấy mã tương tự bên dưới nhiều chế độ xem để giúp hình dung mã mà bạn viết.

source: GuideBook..Guide0..StepGet Started with Apps..TaskchangeText..title
no: Prøv å endre teksten til noe annet.
vi: Bây giờ, hãy thử thay đổi văn bản thành thứ gì đó mới.

source: GuideBook..Guide0..StepGet Started with Apps..TaskchangeText..PageNow, try changing the text to something new..title
no: Prøv å endre teksten til noe annet.
vi: Bây giờ, hãy thử thay đổi văn bản thành thứ gì đó mới.

source: GuideBook..Guide0..StepGet Started with Apps..TaskchangeText..PageNow, try changing the text to something new...Paragraph10
no: Endre teksten `"Hello, friend."` til noe annet.
vi: Thay đổi văn bản, `"Hello, friend."` thành điều gì đó mà bạn muốn nói.

source: GuideBook..Guide0..StepGet Started with Apps..SuccessMessage..Paragraph11
no: Når du endrer koden, oppdateres forhåndsvisningen automatisk, slik at du ser hva du har endret. Ganske praktisk, ikke sant?
vi: Bất kỳ lúc nào bạn thay đổi mã của mình, bản xem trước tự động cập nhật để phản ánh các thay đổi của bạn. Khá hữu ích phải không?

source: GuideBook..Guide0..StepGet Started with Apps..SuccessMessage..Paragraph12
no: Nå skal du prøve å lage en ny visning fra bunnen av.
vi: Tiếp theo, hãy thử tạo một chế độ xem mới từ đầu.

source: GuideBook..Guide0..StepCreating New SwiftUI Views..title
no: Opprett nye SwiftUI-visninger
vi: Tạo các chế độ xem SwiftUI mới

source: GuideBook..Guide0..StepCreating New SwiftUI Views..LearningCenterContent..Paragraph13
no: ![](creating-new-swiftui-views@2x.png)
vi: ![](creating-new-swiftui-views@2x.png)

source: GuideBook..Guide0..StepCreating New SwiftUI Views..LearningCenterContent..Paragraph14
no: Når du oppretter en SwiftUI-[visning](glossary://view), for eksempel [Text](doc://com.apple.documentation/documentation/swiftui/text), oppretter du egentlig en ny [instans](glossary://instance) av den [typen](glossary://type).
vi: Khi bạn tạo ra một [chế độ xem](glossary://view) SwiftUI như [Văn bản](doc://com.apple.documentation/documentation/swiftui/text), việc mà bạn đang thực sự làm là tạo ra một [thể hiện](glossary://instance) mới của [kiểu](glossary://type) đó.

source: GuideBook..Guide0..StepCreating New SwiftUI Views..LearningCenterContent..Paragraph15
no: Du bruker mange forskjellige SwiftUI-typer for å opprette de visuelle elementene i appen, som knapper, skyveknapper og tekst. Her er to eksempler:
vi: Để tạo ra các phần tử hình ảnh của ứng dụng, ví dụ như các nút, thanh trượt và văn bản, bạn sẽ sử dụng nhiều kiểu SwiftUI khác nhau. Đây là hai ví dụ:

source: GuideBook..Guide0..StepCreating New SwiftUI Views..LearningCenterContent..CodeBlock0
no: Text("I’m a Text view!") Image("imAnImageView")
vi: Text("Tôi là một chế độ xem Văn bản!") Image("imAnImageView")

source: GuideBook..Guide0..StepCreating New SwiftUI Views..LearningCenterContent..Paragraph16
no: Du må [initialisere](glossary://initialization) hver av disse typene uten å opprette en [variabel](glossary://variable), slik at du kan holde oversikten over dem.
vi: Lưu ý rằng với mỗi kiểu trong này, bạn [khởi chạy](glossary://initialization) chúng mà không cần tạo ra một [biến](glossary://variable) để theo dõi chúng.

source: GuideBook..Guide0..StepCreating New SwiftUI Views..LearningCenterContent..Paragraph17
no: Det er slik fordi SwiftUI-visninger er utformet slik at de ikke lagrer data om seg selv. I stedet for å lagre visningens [egenskaper](glossary://property) ved hjelp av en variabel, vil data om visningen holdes [adskilt fra selve visningen](glossary://data%20separation).
vi: Đó là vì các chế độ xem SwiftUI được thiết kế để không lưu trữ bất kỳ dữ liệu nào về bản thân chúng. Thay vì lưu trữ các [thuộc tính](glossary://property) của chế độ xem đang sử dụng một biến, bạn sẽ giữ bất kỳ dữ liệu nào về chế độ xem [tách riêng với bản thân chế độ xem](glossary://data%20separation).

source: GuideBook..Guide0..StepCreating New SwiftUI Views..TasktextElement..title
no: Legg til en ny `Text`-visning i `IntroView`.
vi: Thêm một chế độ xem `Text` mới vào `IntroView` của bạn.

source: GuideBook..Guide0..StepCreating New SwiftUI Views..TasktextElement..Page5..Paragraph18
no: Plasser pekeren i [visningsinnholdet](glossary://body), og begynn å skrive «Text» i koderedigereren. Kodefullføringen viser en liste med forslag. Velg `Text` fra nedtrekksmenyen.
vi: Đặt con trỏ của bạn trong [phần thân](glossary://body) và bắt đầu nhập “Text” vào trình sửa mã. Tính năng hoàn thành mã cung cấp cho bạn một danh sách các gợi ý, hãy chọn `Text` từ menu thả xuống.

source: GuideBook..Guide0..StepCreating New SwiftUI Views..TasktextElement..Page6..Paragraph19
no: Overfør en [String](glossary://String) som et [argument](glossary://argument) til `Text`. Det skal ligne på dette.
vi: Chuyển một [Chuỗi](glossary://String) vào dưới dạng [đối số](glossary://argument) cho `Text`. Chuỗi đó sẽ trông giống như sau.

source: GuideBook..Guide0..StepCreating New SwiftUI Views..TasktextElement..Page6..CodeBlock1
no: Text("This is a string!")
vi: Text("Đây là một chuỗi!")

source: GuideBook..Guide0..StepCreating New SwiftUI Views..TasktextElement..Page7..CodeBlock2
no: Text("I’m a new Text element.")
vi: Text("Tôi là một phần tử Văn bản mới.")

source: GuideBook..Guide0..StepCreating New SwiftUI Views..SuccessMessage..Paragraph20
no: Vanligvis bruker du en [variabel](glossary://variable) for å lagre en verdi som du kan bruke og endre senere: `var textView = Text("Hola")`
vi: Thông thường, bạn sử dụng [biến](glossary://variable) để lưu trữ giá trị để sử dụng và sửa đổi sau này: `var textView = Text("Hola")`

source: GuideBook..Guide0..StepCreating New SwiftUI Views..SuccessMessage..Paragraph21
no: I SwiftUI endrer du ikke visningsinstanser andre steder enn på linjen der de lages, så du kan initialisere visningen på stedet: `Text("Hola")`
vi: Nhưng trong SwiftUI, bạn sẽ không sửa đổi các thể hiện chế độ xem ở bất kỳ nơi nào khác mà là trên dòng mà chúng được tạo ra, do đó bạn có thể khởi chạy đơn giản chế độ xem tại chỗ: `Text("Hola")`

source: GuideBook..Guide0..StepModifying SwiftUI Views..title
no: Endre SwiftUI-visninger
vi: Sửa đổi các chế độ xem SwiftUI

source: GuideBook..Guide0..StepModifying SwiftUI Views..LearningCenterContent..Paragraph22
no: ![](modifying-swift-ui-views@2x.png)
vi: ![](modifying-swift-ui-views@2x.png)

source: GuideBook..Guide0..StepModifying SwiftUI Views..LearningCenterContent..Paragraph23
no: Alle SwiftUI-[visningene](glossary://view) du oppretter, er veldig allsidige, og de kan endres.
vi: Mỗi [chế độ xem](glossary://view) SwiftUI mà bạn tạo ra đều linh hoạt và có thể sửa đổi.

source: GuideBook..Guide0..StepModifying SwiftUI Views..LearningCenterContent..Paragraph24
no: Hvis du vil endre utseendet eller oppførselen til en visning, kan du endre disse [instansene](glossary://instance) direkte ved å kalle [metodene](glossary://method) deres.
vi: Nếu bạn muốn thay đổi giao diện hoặc hoạt động của một chế độ xem thì bạn có thể sửa đổi những [thể hiện](glossary://instance) này trực tiếp bằng cách gọi các [phương thức](glossary://method) của chúng.

source: GuideBook..Guide0..StepModifying SwiftUI Views..LearningCenterContent..Paragraph25
no: Disse metodene har sitt eget navn i SwiftUI. De kalles [modifikatorer](glossary://modifier). I den neste oppgaven skal du prøve å legge til noen modifikatorer for å se hvordan de endrer utseendet til en bildevisning.
vi: Những phương thức này có một tên đặc biệt trong SwiftUI. Chúng được gọi là các [trình sửa đổi](glossary://modifier). Trong tác vụ tiếp theo, bạn sẽ thử thêm một số trình sửa đổi để xem chúng sửa đổi giao diện của một chế độ xem hình ảnh như thế nào.

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskaddFriend..title
no: Legg til et bilde av vennen vår.
vi: Thêm một hình ảnh về người bạn của chúng ta.

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskaddFriend..Page8..Paragraph26
no: Først oppretter du en [Image](doc://com.apple.documentation/documentation/swiftui/image)-visning og overfører `"FriendAndGem"` som et [argument](glossary://argument).
vi: Trước tiên, hãy tạo một chế độ xem [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image) và chuyển `"FriendAndGem"` vào dưới dạng [đối số](glossary://argument).

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskaddFriend..Page8..Paragraph27
no: Du kommer også til å legge til en [modifikator](glossary://modifier), `.resizable`, slik at bildet kan endre den opprinnelige størrelsen.
vi: Bạn cũng sẽ thêm một [trình sửa đổi](glossary://modifier), `.resizable`, để cho phép hình ảnh thay đổi kích cỡ ban đầu.

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskaddFriend..Page8..CodeBlock3
no: Image("FriendAndGem") .resizable()
vi: Image("FriendAndGem") .resizable()

source: GuideBook..Guide0..StepModifying SwiftUI Views..Taskmodifier..title
no: Legg til en annen modifikator for å skalere vennen vår, slik at han passer.
vi: Thêm một trình sửa đổi khác để định tỷ lệ người bạn của chúng ta đúng cách.

source: GuideBook..Guide0..StepModifying SwiftUI Views..Taskmodifier..Page9..Paragraph28
no: Oi! Nå har vennen vår blitt lang! Det kan du ordne ved å legge til en annen modifikator.
vi: Ồ, người bạn của chúng ta thực sự bị kéo giãn! Bạn có thể sửa bằng cách thêm một trình sửa đổi khác.

source: GuideBook..Guide0..StepModifying SwiftUI Views..Taskmodifier..Page9..CodeBlock4
no: .scaledToFit()
vi: .scaledToFit()

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskmodifierWalkthrough..title
no: Bildemodifikatorer
vi: Các trình sửa đổi hình ảnh

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskmodifierWalkthrough..Page10..Paragraph29
no: Legg merke til at [Image](doc://com.apple.documentation/documentation/swiftui/image)-visningen har to [modifikatorer](glossary://modifier), som begge kalles ved hjelp av [punktnotasjon](glossary://dot%20notation).
vi: Hãy lưu ý rằng chế độ xem [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image) có hai [trình sửa đổi](glossary://modifier), mỗi trình sửa đổi được gọi bằng [ký pháp dấu chấm](glossary://dot%20notation).

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskmodifierWalkthrough..Page11..Paragraph30
no: SwiftUI gjør det enklere å lese modifikatorene ved å plassere hver modifikator på sin egen linje, selv om de alle modifiserer samme `Image`-instans. Dette kan også skrives som:
vi: SwiftUI làm cho các trình sửa đổi dễ đọc hơn bằng cách đặt mỗi trình sửa đổi trên một dòng riêng biệt, ngay cả khi tất cả chúng sửa đổi cùng một thể hiện `Image`. Phần này cũng có thể được viết dưới dạng:

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskmodifierWalkthrough..Page11..CodeBlock5
no: Image("FriendAndGem").resizable().scaledToFit()
vi: Image("FriendAndGem").resizable().scaledToFit()

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskmodifierWalkthrough..Page12..Paragraph31
no: Den første modifikatoren, `.resizable()`, gjør at bildet kan endre størrelse. Prøv å fjerne denne modifikatoren midlertidig, og legg merke til hvordan bildet endres. Uten `.resizable()`-modifikatoren kan bildet bare gjengis i opprinnelig størrelse, og det kan ikke skaleres opp eller ned etter plassen som er tilgjengelig.
vi: Trình sửa đổi đầu tiên, `.resizable()`, làm cho hình ảnh của bạn có thể thay đổi kích cỡ. Hãy thử xóa tạm thời trình sửa đổi này và lưu ý sự thay đổi của hình ảnh. Không có trình sửa đổi `.resizable()`, hình ảnh của bạn chỉ có thể kết xuất theo kích cỡ ban đầu và không thể tăng hoặc giảm tỷ lệ để phù hợp với không gian khả dụng.

source: GuideBook..Guide0..StepModifying SwiftUI Views..TaskmodifierWalkthrough..Page13..Paragraph32
no: Den andre modifikatoren, `.scaledToFit()`, gjør at bildet kan skaleres for å passe i beholderen det vises i. Prøv å endre den til `.scaledToFill()` midlertidig. Ser du forskjellen? Bytt tilbake til `.scaledToFit()` før du fortsetter.
vi: Trình sửa đổi thứ hai, `.scaledToFit()`, cho phép hình ảnh của bạn định tỷ lệ để vừa với kích cỡ của bộ chứa mà hình ảnh sử dụng. Hãy thử thay đổi tạm thời trình sửa đổi thành `.scaledToFill()`. Bạn có thể chỉ ra sự khác biệt không? Hãy chuyển đổi trở lại `.scaledToFit()` trước khi tiếp tục.

source: GuideBook..Guide0..StepModifying SwiftUI Views..SuccessMessage..Paragraph33
no: Nå som du kan litt om å lage og endre SwiftUI-visninger, kan du prøve å kombinere kunnskapen din.
vi: Bây giờ bạn đã biết một chút về việc tạo ra và sửa đổi các chế độ xem SwiftUI, hãy thử đặt tất cả cùng nhau.

source: GuideBook..Guide0..StepSwiftUI Views..title
no: SwiftUI-visninger
vi: Các chế độ xem SwiftUI

source: GuideBook..Guide0..StepSwiftUI Views..LearningCenterContent..Paragraph34
no: ![](swift-ui-views@2x.png)
vi: ![](swift-ui-views@2x.png)

source: GuideBook..Guide0..StepSwiftUI Views..LearningCenterContent..Paragraph35
no: Alle synlige elementer du ser i forhåndsvisningen, som tekst, bilder og knapper, er SwiftUI-[visninger](glossary://view).
vi: Tất cả các phần tử hiển thị mà bạn nhìn thấy trong bản xem trước, ví dụ như văn bản, hình ảnh và nút đều là các [chế độ xem](glossary://view) SwiftUI.

source: GuideBook..Guide0..StepSwiftUI Views..LearningCenterContent..Paragraph36
no: SwiftUI-visninger er spesielle fordi de følger det samme settet med retningslinjer, kalt en [protokoll](glossary://protocol).
vi: Các chế độ xem SwiftUI đặc biệt vì chúng tuân theo cùng một bộ hướng dẫn, được gọi là [giao thức](glossary://protocol).

source: GuideBook..Guide0..StepSwiftUI Views..LearningCenterContent..Paragraph37
no: Ved å følge retningslinjene for [View](doc://com.apple.documentation/documentation/swiftui/view)-protokollen for en visning spesielle funksjoner. En av funksjonene er at visningene oppfører seg som [beholdere](glossary://container), slik at du kan plassere andre visninger i dem.
vi: Bằng việc tuân theo các hướng dẫn của giao thức [Chế độ xem](doc://com.apple.documentation/documentation/swiftui/view), một chế độ xem có các khả năng đặc biệt. Một trong những khả năng đó là các chế độ xem đóng vai trò như các [bộ chứa](glossary://container), cho phép bạn đặt các chế độ xem khác bên trong chúng.

source: GuideBook..Guide0..StepSwiftUI Views..TaskplaceOneViewInsideAnother..title
no: Prøv å plassere en visning i en annen visning.
vi: Hãy thử đặt một chế độ xem bên trong một chế độ xem khác.

source: GuideBook..Guide0..StepSwiftUI Views..TaskplaceOneViewInsideAnother..Page14..Paragraph38
no: Legg først til en [HStack](doc://com.apple.documentation/documentation/swiftui/hstack), som er en visning som organiserer [delvisninger](glossary://subview) horisontalt.
vi: Trước tiên, hãy thêm một [HStack](doc://com.apple.documentation/documentation/swiftui/hstack), một chế độ xem sắp xếp các [chế độ xem phụ](glossary://subview) theo chiều ngang.

source: GuideBook..Guide0..StepSwiftUI Views..TaskplaceOneViewInsideAnother..Page14..CodeBlock6
no: HStack { }
vi: HStack { }

source: GuideBook..Guide0..StepSwiftUI Views..TaskplaceOneViewInsideAnother..Page15..Paragraph39
no: Deretter plasserer du én `Text`- eller `Image`-visning i `HStack`.
vi: Tiếp theo, hãy đặt một chế độ xem `Text` hoặc `Image` đơn nhất bên trong `HStack`.

source: GuideBook..Guide0..StepSwiftUI Views..TaskplaceOneViewInsideAnother..Page16..CodeBlock7
no: HStack { Text("I’m a view inside a view.") }
vi: HStack { Text("Tôi là một chế độ xem bên trong một chế độ xem.") }

source: GuideBook..Guide0..StepSwiftUI Views..TaskaddImageInHStack..title
no: Nå plasserer du `Image`-visningen i `HStack`.
vi: Bây giờ, hãy đặt chế độ xem `Image` của bạn bên trong `HStack`.

source: GuideBook..Guide0..StepSwiftUI Views..TaskaddImageInHStack..Page17..Paragraph40
no: Klipp ut og lim inn `Image`-visningen til `HStack`. Når du ser på forhåndsvisningen, ser du to visninger stablet horisontalt i den rekkefølgen du har angitt i `HStack`, og to tekstvisninger stablet vertikalt under `HStack`.
vi: Hãy cắt và dán chế độ xem `Image` của bạn vào `HStack`. Khi nhìn vào bản xem trước, bạn sẽ nhìn thấy hai chế độ xem được xếp chồng theo chiều ngang theo thứ tự mà bạn đã chỉ định bên trong `HStack` và hai chế độ xem văn bản được xếp chồng theo chiều dọc bên dưới `HStack`.

source: GuideBook..Guide0..StepSwiftUI Views..TaskaddImageInHStack..Page18..CodeBlock8
no: HStack { Text("I'm a view inside a view") Image("FriendAndGem") .resizable() .scaledToFit() } Text("Hello there!") Text("I’m a new Text element.")
vi: HStack { Text("Tôi là một chế độ xem bên trong một chế độ xem") Image("FriendAndGem") .resizable() .scaledToFit() } Text("Chào các bạn!") Text("Tôi là một phần tử văn bản mới.")

source: GuideBook..Guide0..StepSwiftUI Views..SuccessMessage..Paragraph41
no: Nå ser du tekst- og bildevisningene stablet ved siden av hverandre. Dette er fordi du har plassert visningene i en [beholder](glossary://container)-visning som kalles `HStack`.
vi: Hãy lưu ý rằng bây giờ bạn nhìn thấy các chế độ xem văn bản và hình ảnh của mình được xếp chồng cạnh nhau. Đó là vì bạn đã đặt những chế độ xem đó trong một chế độ xem [bộ chứa](glossary://container) có tên là `HStack`.

source: GuideBook..Guide0..StepSwiftUI Views..SuccessMessage..Paragraph42
no: Nå skal du lære flere måter å kombinere visninger på.
vi: Tiếp theo, bạn sẽ học thêm nhiều cách để đặt các chế độ xem cùng nhau.

source: GuideBook..Guide0..StepComposability..title
no: Kombinerbarhet
vi: Khả năng biên soạn

source: GuideBook..Guide0..StepComposability..LearningCenterContent..Paragraph43
no: ![](composability@2x.png)
vi: ![](composability@2x.png)

source: GuideBook..Guide0..StepComposability..LearningCenterContent..Paragraph44
no: Siden du kan plassere visninger i andre visninger, fungerer hver visning som en byggekloss for å lage større deler. Når du setter sammen visninger på denne måten, kalles det en [komposisjon](glossary://composition).
vi: Vì bạn có thể đặt chế độ xem bên trong chế độ xem khác nên mỗi chế độ xem đóng vai trò như một khối xây dựng để tạo nên các mảng lớn hơn. Việc kết nối các chế độ xem cùng nhau theo cách này được gọi là [tổ hợp](glossary://composition).

source: GuideBook..Guide0..StepComposability..LearningCenterContent..Paragraph45
no: Med komposisjoner kan du lage et detaljert [brukergrensesnitt](glossary://user%20interface) for appen din, samtidig som koden blir lett å både lese og forstå.
vi: Tổ hợp cho phép bạn tạo dựng một [giao diện người dùng](glossary://user%20interface) chi tiết cho ứng dụng trong khi vẫn đảm bảo có thể đọc được và có thể hiểu được mã.

source: GuideBook..Guide0..StepComposability..LearningCenterContent..Paragraph46
no: Deretter lager du en [sammenstilt visning](glossary://composed%20view) for å se hvordan den fungerer.
vi: Tiếp theo, bạn sẽ tạo một [chế độ xem tổ hợp](glossary://composed%20view) để biết cách hoạt động.

source: GuideBook..Guide0..StepComposability..TaskcomposeAView..title
no: Sammenstille en visning med stabler.
vi: Biên soạn một chế độ xem với các ngăn xếp.

source: GuideBook..Guide0..StepComposability..TaskcomposeAView..Page19..Paragraph47
no: For å sammenstille visningen legger du først til en [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) i `VStack` for å organisere [delvisninger](glossary://subview) horisontalt.
vi: Để biên soạn chế độ xem của bạn, trước tiên hãy thêm một [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) bên trong `VStack` để sắp xếp các [chế độ xem phụ](glossary://subview) của bạn theo chiều ngang.

source: GuideBook..Guide0..StepComposability..TaskcomposeAView..Page19..CodeBlock9
no: HStack { }
vi: HStack { }

source: GuideBook..Guide0..StepComposability..TaskcomposeAView..Page20..Paragraph48
no: Deretter legger du til et bilde av vennen vår i `HStack`.
vi: Tiếp theo, hãy thêm một hình ảnh người bạn của chúng ta vào `HStack` của bạn.
