Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 2/4 - Editando Grades/Editando Grades.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page19..Paragraph44
no: En siste ting før vi går videre. Du kan bruke modifikatorene `.navigationTitle(_:)` og `navigationBarTitleDisplayMode(_:)` til å gi hver visning i `NavigationStack` sin egen tittel og tilpasse hvordan den vises.
vi: Một mục cuối cùng tại đây trước khi chuyển tiếp. Bạn có thể đặt cho từng chế độ xem bên trong `NavigationStack` một tiêu đề riêng và tùy chỉnh cách hiển thị bằng các trình sửa đổi `.navigationTitle(_:)` và `navigationBarTitleDisplayMode(_:)`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page19..Paragraph45
no: Prøv å legge til disse under `SymbolGrid`, og legg merke til at visningen nå viser en tittel. Det er veldig nyttig å gi visningene en tittel når du navigerer mellom mange forskjellige visninger i appen.
vi: Thử thêm những trình sửa đổi này bên dưới `SymbolGrid` và lưu ý cách chế độ xem của bạn hiển thị tiêu đề bây giờ. Việc đặt tiêu đề cho các chế độ xem khi điều hướng giữa nhiều chế độ xem trong ứng dụng của bạn rất hữu ích.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page19..CodeBlock8
no: .navigationTitle("My Symbols") .navigationBarTitleDisplayMode(.inline)
vi: .navigationTitle("Ký hiệu của tôi") .navigationBarTitleDisplayMode(.inline)

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..title
no: Opprett navigeringslenker fra rutenettobjekter
vi: Tạo liên kết điều hướng từ các mục lưới

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Paragraph46
no: Gjør hvert objekt i rutenettet til en [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink).
vi: Biến từng mục trong lưới của bạn thành một [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink).

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page20..Paragraph47
no: Hvis målet er å aktivere navigering til en ny visning når noen trykker på et symbol, må du plassere hvert symbol i rutenettet i en [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink).
vi: Nếu mục tiêu của bạn là cho phép điều hướng đến một chế độ xem mới bất kỳ lúc nào một người chạm vào một ký hiệu thì bạn sẽ cần đặt từng ký hiệu trong lưới bên trong một [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink).

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page20..Paragraph48
no: En `NavigationLink` har både et [mål](glossary://destination%20view), som er visningen du navigerer til, og en [etikett](glossary://label), som bestemmer hvordan lenken vises. I dette tilfellet er etiketten symbolets `Image`-visning, og målet er `SymbolDetail`-visningen.
vi: `NavigationLink` có cả [đích](glossary://destination%20view) – chế độ xem mà bạn điều hướng đến – và một [nhãn](glossary://label) – cách liên kết hiển thị. Trong trường hợp này, nhãn là chế độ xem `Image` của ký hiệu và đích là chế độ xem `SymbolDetail`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page21..Paragraph49
no: Legg til en `NavigationLink` i `ForEach` i `LazyVGrid`.
vi: Thêm một `NavigationLink` bên trong `ForEach` của `LazyVGrid`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page21..Paragraph50
no: Denne navigeringslenken har `SymbolDetail` som mål, som lenker til symbolet i den cellen i rutenettet.
vi: Liên kết điều hướng này có một đích là `SymbolDetail`, liên kết đến ký hiệu trong ô đó của lưới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page21..CodeBlock9
no: NavigationLink { SymbolDetail(symbol: symbol) } label: { //#-learning-code-snippet(addLabelNavLink) }
vi: NavigationLink { SymbolDetail(symbol: symbol) } label: { //#-learning-code-snippet(addLabelNavLink) }

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page22..Paragraph51
no: Klipp ut og lim inn `Image`-visningen som en [etikett](glossary://label) i klammeparentesene i `NavigationLink`.
vi: Cắt và dán chế độ xem `Image` của bạn dưới dạng một [nhãn](glossary://label) bên trong các dấu ngoặc nhọn của `NavigationLink`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page22..Paragraph52
no: Dette forandrer visningen til en knapp som skyver målvisningen `SymbolDetail` til toppen av navigeringsstabelen når noen trykker på den.
vi: Việc này biến chế độ xem thành một nút sẽ đẩy chế độ xem đích — `SymbolDetail` — lên trên cùng của ngăn xếp điều hướng khi được chạm.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page22..CodeBlock10
no: Image(systemName: symbol.name) .resizable() .scaledToFit() .symbolRenderingMode(.hierarchical) .foregroundColor(.accentColor) .padding()
vi: Image(systemName: symbol.name) .resizable() .scaledToFit() .symbolRenderingMode(.hierarchical) .foregroundColor(.accentColor) .padding()

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page23..Paragraph53
no: Prøv å trykke på ett av symbolene i forhåndsvisningen.
vi: Bây giờ, hãy thử thêm một trong các ký hiệu trong bản xem trước.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasknavigationLinksGrid..Page23..Paragraph54
no: Fungerer navigeringen som forventet? Kan du navigere tilbake til rutenettet etter at du har gått til en annen visning?
vi: Việc điều hướng của bạn có hoạt động như dự kiến không? Bạn có thể điều hướng trở lại lưới sau khi đã di chuyển đến một chế độ xem khác không?

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..title
no: Legge til redigeringsfunksjonalitet
vi: Thêm chức năng sửa

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..title
no: Legg til objekter i rutenettet
vi: Thêm các mục vào lưới của bạn

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Paragraph55
no: Utforsk hvordan du legger til objekter i rutenettet ved hjelp av et [ark](doc://com.apple.documentation/documentation/SwiftUI/View/sheet(isPresented:onDismiss:content:)).
vi: Khám phá cách thêm các mục vào lưới bằng một [bảng](doc://com.apple.documentation/documentation/SwiftUI/View/sheet(isPresented:onDismiss:content:)).

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page24..Paragraph56
no: Nå er det på tide å skru opp temperaturen i rutenettet (🌶 bang!) med redigeringsfunksjonalitet. Begynn med å legge til et objekt i rutenettet.
vi: Đã đến lúc làm cho lưới này hấp dẫn (🌶 bùm!) với một số chức năng sửa. Trước tiên, hãy thêm một mục vào lưới của bạn.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page24..Paragraph57
no: Begynn med å legge til en [statusegenskap](glossary://state%20property), `isAddingSymbol`, som en boolsk verdi. Verdien av denne gjør det mulig å aktivere eller deaktivere muligheten til å legge til et nytt symbol:
vi: Bắt đầu bằng cách thêm một [thuộc tính trạng thái](glossary://state%20property), `isAddingSymbol`, dưới dạng một giá trị Boolean, là giá trị làm cho việc bật hoặc tắt chức năng thêm một ký hiệu mới trở nên khả thi:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page24..CodeBlock11
no: @State private var isAddingSymbol = false
vi: @State private var isAddingSymbol = false

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page25..Paragraph58
no: Hvordan slås `isAddingSymbol` på (tildeles verdien `true`)?
vi: Vậy làm cách nào để bật `isAddingSymbol` (được gán giá trị `true`)?

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page25..Paragraph59
no: For å gjøre dette legger du til en knapp i [verktøylinjen](glossary://toolbar) som legger til et nytt symbol. Verktøylinjen er en del av `NavigationStack`, så du må kontrollere at du la til den i «Opprett navigeringsstabelen for appen din» tidligere.
vi: Đối với việc này, bạn sẽ thêm một nút trong [thanh công cụ](glossary://toolbar) để thêm một ký hiệu mới. Thanh công cụ là một phần của `NavigationStack`, vậy nên hãy đảm bảo rằng bạn đã thêm trong phần “Tạo ra ngăn xếp điều hướng cho ứng dụng của bạn” trước đó.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page25..CodeBlock12
no: .toolbar { ToolbarItem(placement: .navigationBarTrailing) { Button { isAddingSymbol = true } label: { Image(systemName: "plus") } } }
vi: .toolbar { ToolbarItem(placement: .navigationBarTrailing) { Button { isAddingSymbol = true } label: { Image(systemName: "plus") } } }

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page26..Paragraph60
no: Prøv å trykke på Legg til-knappen (+). Men … den gjør jo ikke noe ennå?
vi: Bây giờ, hãy thử đẩy nút Thêm (+). Đợi đã… nút đó chưa thực hiện bất kỳ chức năng nào!

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page27..Paragraph61
no: Når du vil legge til et nytt symbol, viser du et [ark](doc://com.apple.documentation/documentation/SwiftUI/View/sheet(isPresented:onDismiss:content:)) med en `SymbolPicker`-visning når `isAddingSymbol` er `true`. Når du lukker arket, vil `addSymbol`-funksjonen legge til det valgte symbolet i rutenettet.
vi: Để thêm một ký hiệu mới, bạn sẽ hiển thị một [bảng](doc://com.apple.documentation/documentation/SwiftUI/View/sheet(isPresented:onDismiss:content:)) với một chế độ xem `SymbolPicker` khi `isAddingSymbol` là `true`. Khi bạn ẩn bảng đó, hàm `addSymbol` thêm ký hiệu được chọn vào lưới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page27..CodeBlock13
no: .sheet(isPresented: $isAddingSymbol, onDismiss: addSymbol) { SymbolPicker(symbol: $selectedSymbol) }
vi: .sheet(isPresented: $isAddingSymbol, onDismiss: addSymbol) { SymbolPicker(symbol: $selectedSymbol) }

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page28..Paragraph62
no: [Argumentet](glossary://argument) for `SymbolPicker` (`$selectedSymbol`) er en spesiell type verdi som kalles en [binding](glossary://binding). Når du overfører en bindingsverdi til en [delvisning](glossary://subview), kan delvisningen endre verdien sin, men det er bare [beholdervisningen](glossary://container) som lagrer den [faktiske verdien](glossary://source%20of%20truth).
vi: [Đối số](glossary://argument) của `SymbolPicker` (`$selectedSymbol`) là một kiểu giá trị đặc biệt, được gọi là [ràng buộc](glossary://binding). Khi bạn chuyển một giá trị ràng buộc vào một [chế độ xem phụ](glossary://subview), chế độ xem phụ đó có thể sửa đổi giá trị, nhưng chỉ [chế độ xem bộ chứa](glossary://container) lưu trữ [giá trị thực tế](glossary://source%20of%20truth).

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page28..Paragraph63
no: Når `selectedSymbol` overføres som et argument, kan `SymbolPicker` endre den verdien fra delvisningen, samtidig som det beholdes én [sannhetskilde](glossary://source%20of%20truth) i `SymbolGrid`.
vi: Việc chuyển `selectedSymbol` dưới dạng đối số cho phép `SymbolPicker` sửa đổi giá trị đó từ chế độ xem phụ trong khi duy trì một [nguồn chân lý](glossary://source%20of%20truth) đơn nhất trong `SymbolGrid`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page29..Paragraph64
no: Når arket lukkes, setter `addSymbol` inn verdien som er tildelt til `selectedSymbol`, i `symbols`-matrisen. Siden `symbols` er en [statusegenskap](glossary://state%20property), vil SwiftUI gjenkjenne endringen og oppdatere rutenettgrensesnittet med det nye symbolet.
vi: Khi bảng ẩn đi, `addSymbol` chèn giá trị được gán cho `selectedSymbol` vào dãy `symbols`. Vì `symbols` là một [thuộc tính trạng thái](glossary://state%20property) nên SwiftUI nhận biết sự thay đổi và cập nhật UI lưới bằng ký hiệu mới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TasksymbolGridEditing..Page30..Paragraph65
no: Prøv å legge til et nytt symbol i forhåndsvisningen. Kan du bruke [gummiandmetoden](glossary://rubber%20ducky%20method) til å forklare hvordan verdien blir lagt til og deretter oppdatert i rutenettet?
vi: Tiếp tục thực hiện và thử thêm một ký hiệu mới trong bản xem trước. Bạn có thể sử dụng [phương thức vịt cao su](glossary://rubber%20ducky%20method) để giải thích cách giá trị được thêm rồi cập nhật trong lưới không?

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..title
no: Slett objekter fra rutenettet
vi: Xóa các mục khỏi lưới

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Paragraph66
no: Legg til en redigeringsmodus, slik at du kan slette objekter fra rutenettet.
vi: Thêm một chế độ sửa để cho phép xóa các mục khỏi lưới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page31..Paragraph67
no: Hvis du vil at det skal være mulig å slette objekter fra rutenettet, legger du til en redigeringsmodus. Legg til en ekstra [statusegenskap](glossary://state%20property), `isEditing`, for å spore om brukergrensesnittet viser brukergrensesnittet for sletting.
vi: Để xóa các mục khỏi lưới, bạn sẽ thêm một chế độ sửa. Hãy thêm một [thuộc tính trạng thái](glossary://state%20property) khác, `isEditing`, để theo dõi xem UI của bạn có hiển thị UI xóa không.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page31..CodeBlock14
no: @State private var isEditing = false
vi: @State private var isEditing = false

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page32..Paragraph68
no: Endre til redigeringsstatus ved å legge til en `Button` i verktøylinjen, som bytter om på verdien for `isEditing` når noen trykker på den.
vi: Để chuyển đổi trạng thái sửa, hãy thêm một `Button` vào thanh công cụ của bạn, nút này có nhiệm vụ chuyển đổi giá trị của `isEditing` khi được chạm.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page32..CodeBlock15
no: ToolbarItem(placement: .navigationBarLeading) { Button(isEditing ? "Ferdig" : "Rediger") { withAnimation { isEditing.toggle() } } }
vi: ToolbarItem(placement: .navigationBarLeading) { Button(isEditing ? "Xong" : "Sửa") { withAnimation { isEditing.toggle() } } }

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page33..Paragraph69
no: Nå ser du en «Rediger»-knapp i verktøylinjen, som endres til «Ferdig» når noen trykker på den. Men den er ikke knyttet til brukergrensesnittet i visningen ennå.
vi: Bây giờ, bạn có thể nhìn thấy nút “Sửa” trong thanh công cụ, thay đổi thành “Xong” khi được chạm. Nhưng nút này chưa được liên kết với bất kỳ UI nào trong chế độ xem.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page34..Paragraph70
no: Når du vil bruke `isEditing` til å fjerne symboler fra rutenettet, må du opprette et betinget brukergrensesnitt som vises når `isEditing` er `true`.
vi: Để sử dụng `isEditing` để xóa các ký hiệu khỏi lưới, bạn sẽ cần tạo ra một số UI điều kiện được hiển thị khi `isEditing` là `true`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page34..Paragraph71
no: Koden under legger en rød «x» over et symbol når denne verdien er `true`.
vi: Mã bên dưới phủ một dấu “x” màu đỏ lên trên một ký hiệu khi giá trị này là `true`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page34..CodeBlock16
no: .overlay(alignment: .topTrailing) { if isEditing { Button { //#-learning-code-snippet(removeSymbol) } label: { Image(systemName: "xmark.square.fill") .font(.title) .symbolRenderingMode(.palette) .foregroundStyle(.white, Color.red) } } }
vi: .overlay(alignment: .topTrailing) { if isEditing { Button { //#-learning-code-snippet(removeSymbol) } label: { Image(systemName: "xmark.square.fill") .font(.title) .symbolRenderingMode(.palette) .foregroundStyle(.white, Color.red) } } }

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page35..Paragraph72
no: Hvis du prøver å bytte om på redigeringsmodus, ser du røde «x»-visninger over symbolbildene, men foreløpig skjer det ikke noe når du trykker på dem. 😕
vi: Nếu bạn thử chuyển đổi chế độ Sửa thì bây giờ bạn sẽ nhìn thấy chế độ xem “x” màu đỏ bên trên các hình ảnh ký hiệu, nhưng việc chạm vào chúng chưa thực hiện bất kỳ chức năng nào. 😕

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page35..Paragraph73
no: Hvis du vil fjerne et objekt fra rutenettet, må du finne og fjerne symbolet fra `symbols`-matrisen.
vi: Nếu bạn muốn xóa một mục khỏi lưới thì bạn cần tìm và xóa ký hiệu đó khỏi dãy `symbols`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page35..Paragraph74
no: Legg til denne koden i knappens [closure-blokk](glossary://closure)-handling for å fjerne et objekt når du trykker på den røde «x»-en:
vi: Thêm mã này bên trong [bao đóng](glossary://closure) hành động của nút để xóa một mục khi chạm vào dấu “x” màu đỏ:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page35..CodeBlock17
no: remove(symbol: symbol)
vi: remove(symbol: symbol)

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page36..Paragraph75
no: Det var det! Når du trykker på den røde «x»-knappen, fjernes symbolet fra rutenettet.
vi: Vậy là xong! Chạm vào nút “x” màu đỏ sẽ xóa ký hiệu khỏi lưới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page37..Paragraph76
no: Hvis du vil legge til en annen interessant redigeringsfunksjon, kan du legge til en trinnkontroll for å endre antall kolonner i rutenettet dynamisk.
vi: Nếu bạn muốn thêm một phần chức năng sửa thú vị khác thì bạn có thể thêm một trình tạo bước cho phép bạn chủ động thay đổi số lượng cột trong lưới của mình.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page37..Paragraph77
no: Prøv å legge til denne koden øverst i `VStack` i `SymbolGrid`, og prøv den for å se hvordan den fungerer!
vi: Thử thêm mã này vào trên cùng của `VStack` trong `SymbolGrid` và kiểm tra để xem cách hoạt động!

source: GuideBook..Guide0..StepEditing Grids..TaskGroup3..TaskdeleteGridItems..Page37..CodeBlock18
no: if isEditing { Stepper(columnsText, value: $numColumns, in: 1...6, step: 1) { _ in withAnimation { gridColumns = Array(repeating: GridItem(.flexible()), count: numColumns) } } .padding() }
vi: if isEditing { Stepper(columnsText, value: $numColumns, in: 1...6, step: 1) { _ in withAnimation { gridColumns = Array(repeating: GridItem(.flexible()), count: numColumns) } } .padding() }
