Repository: caioagralemos/Swift-Playgrounds
Catalog: Dia 2/4 - Editando Grades/Editando Grades.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..title
no: Redigere rutenett
vi: Sửa lưới

source: GuideBook..WelcomeMessageEditing Grids..title
no: Redigere rutenett
vi: Sửa lưới

source: GuideBook..WelcomeMessageEditing Grids..Paragraph0
no: I dette eksempelet oppretter du et rutenettgrensesnitt som er fylt med SF-symboler.
vi: Trong mẫu này, bạn sẽ tạo ra một giao diện lưới được điền các Ký hiệu SF.

source: GuideBook..Guide0..StepEditing Grids..title
no: Redigere rutenett
vi: Sửa lưới

source: GuideBook..Guide0..StepEditing Grids..LearningCenterContent..Paragraph1
no: ![](intro.png)
vi: ![](intro.png)

source: GuideBook..Guide0..StepEditing Grids..LearningCenterContent..Paragraph2
no: I [Organizing with Grids](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.organizingwithgrids) lærte du å opprette en layout i appens grensesnitt ved å bruke et rutenett med fargede rektangler. I dette eksempelet skal du opprette et lignende rutenettgrensesnitt som er fylt med [SF-symboler](https://developer.apple.com/sf-symbols/). Rediger rutenett bygger videre på det du har lært, og tar appen til et nytt nivå ved å lære deg om to viktige funksjoner for appdesign: navigering i appen, og redigering av data.
vi: Trong [Sắp xếp với các lưới](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.organizingwithgrids), bạn đã tìm hiểu cách tạo bố cục giao diện của ứng dụng bằng một lưới các hình chữ nhật có màu. Trong mẫu này, bạn sẽ tạo ra một giao diện lưới tương tự được điền các [Ký hiệu SF](https://developer.apple.com/sf-symbols/). Để xây dựng dựa trên những gì mà bạn đã học, phần Sửa lưới đưa ứng dụng của bạn lên cấp độ tiếp theo bằng cách dạy bạn về hai đặc điểm quan trọng trong thiết kế ứng dụng: điều hướng bên trong ứng dụng và chỉnh sửa dữ liệu.

source: GuideBook..Guide0..StepEditing Grids..LearningCenterContent..UnorderedList0..Paragraph3
no: For at det skal være enkelt for brukerne å navigere i appen, må du sørge for at de kan navigere mellom forskjellige [visninger](glossary://view).
vi: Để mọi người di chuyển dễ dàng trong ứng dụng của bạn, bạn cần cung cấp một cách để họ điều hướng giữa các [chế độ xem](glossary://view) khác nhau.

source: GuideBook..Guide0..StepEditing Grids..LearningCenterContent..UnorderedList0..Paragraph4
no: Hvis andre skal kunne redigere dataene i appen din, trenger du en redigeringsmodus. Du kommer til å lære hvordan du legger til redigeringsfunksjonalitet i et rutenett, inkludert å legge til og fjerne objekter i rutenettet.
vi: Để cho phép mọi người sửa dữ liệu trong ứng dụng của bạn, bạn cần một chế độ chỉnh sửa. Bạn sẽ tìm hiểu cách thêm chức năng chỉnh sửa vào lưới, bao gồm việc thêm hoặc xóa các mục lưới.

source: GuideBook..Guide0..StepEditing Grids..LearningCenterContent..Paragraph5
no: Det er på tide å sette i gang!
vi: Đã đến lúc bắt đầu!

source: GuideBook..Guide0..StepEditing Grids..LearningCenterContent..GuideButtonStart Walkthrough..title
no: Start gjennomgangen
vi: Bắt đầu hướng dẫn

source: GuideBook..Guide0..StepEditing Grids..LearningCenterContent..GuideButtonStart Walkthrough..description
no: Tilgjengelighetsbeskrivelse for knapp
vi: Mô tả AX cho nút

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..title
no: Bruke SF-symboldata
vi: Sử dụng dữ liệu Ký hiệu SF

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..title
no: Definer en identifiserbar type
vi: Định nghĩa một kiểu có thể nhận dạng

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Paragraph6
no: Lær hvordan du oppretter data som er unikt identifiserbare av SwiftUI.
vi: Tìm hiểu cách tạo ra dữ liệu có thể nhận dạng duy nhất bởi SwiftUI.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Page0..Paragraph7
no: Når du oppretter et rutenett, bør du stille deg selv dette spørsmålet tidlig: «Hvilket innhold skal jeg plassere i rutenettet?» Her skal du bruke [SF-symboler](https://developer.apple.com/sf-symbols/), siden de er flotte symboler som det er enkelt å legge til i koden.
vi: Khi tạo ra một lưới, một trong những câu hỏi đầu tiên bạn nên đặt ra là “Tôi muốn đặt nội dung nào vào lưới?”. Tại đây, bạn sẽ sử dụng [Ký hiệu SF](https://developer.apple.com/sf-symbols/), vì chúng là những biểu tượng tuyệt vời, dễ thêm vào mã của bạn.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Page0..Paragraph8
no: Denne strukturen er [datamodellen](glossary://data%20model) som representerer ett SF-symbol.
vi: Cấu trúc này là [mô hình dữ liệu](glossary://data%20model) biểu thị cho một Ký hiệu SF đơn nhất.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Page1..Paragraph9
no: Hvert bilde i rutenettet bruker en `Symbol`-[instans](glossary://instance), for eksempel `Symbol(name: "eyes")`.
vi: Mỗi hình ảnh trong lưới của bạn sử dụng một [thể hiện](glossary://instance) `Symbol`, ví dụ như `Symbol(name: "mắt")`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Page1..Paragraph10
no: Siden `Symbol`-typen [stemmer overens](glossary://conform) med [Identifiable](doc://com.apple.documentation/documentation/swift/identifiable)-protokollen, identifiserer SwiftUI hver celle i rutenettet basert på symbolets `id`-verdi selv om flere symboler bruker samme `name`-streng.
vi: Vì kiểu `Symbol` [tuân thủ](glossary://conform) giao thức [Identifiable](doc://com.apple.documentation/documentation/swift/identifiable) nên SwiftUI nhận dạng từng ô trong lưới của bạn dựa trên giá trị `id` của ký hiệu, ngay cả khi một số ký hiệu sử dụng cùng một Chuỗi `name`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Page1..Paragraph11
no: Å legge til overensstemmelse med `Identifiable` i [datamodellen](glossary://data%20model) er et godt mønster å følge når du bruker `ForEach` til å fylle ut et rutenett eller en liste med visninger, siden en `ForEach` trenger en unik ID for at objektene skal kunne utføre oppdateringer i en tilsvarende visning.
vi: Việc thêm giao thức tuân thủ `Identifiable` vào [mô hình dữ liệu](glossary://data%20model) của bạn là một khuôn mẫu tuyệt vời để tuân theo khi sử dụng `ForEach` để điền vào lưới hoặc danh sách bằng các chế độ xem, vì `ForEach` cần một ID duy nhất cho các mục để thực hiện cập nhật cho một chế độ xem tương ứng.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Page2..Paragraph12
no: `Symbol`-typen din inneholder en `id`-egenskap. Det er et krav for `Identifiable`-protokollen. Angi en `UUID`-verdi for denne egenskapen for å sikre at hvert objekt har sin egen identitet.
vi: Kiểu `Symbol` chứa một thuộc tính `id`, là một yêu cầu của giao thức `Identifiable`. Bạn đảm bảo từng mục có nhận dạng riêng bằng cách đặt thuộc tính này thành giá trị `UUID`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TasksymbolStruct..Page3..Paragraph13
no: `name`-egenskapen er en [String](doc://com.apple.documentation/documentation/swift/string)-verdi som tilsvarer et [SF-symbol](https://developer.apple.com/sf-symbols/). Du bruker denne egenskapen til å opprette `Image`-visningene i rutenettet.
vi: Thuộc tính `name` là một giá trị [Chuỗi](doc://com.apple.documentation/documentation/swift/string) tương ứng với một [Ký hiệu SF](https://developer.apple.com/sf-symbols/). Bạn sẽ sử dụng thuộc tính này để tạo ra các chế độ xem `Image` trong lưới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..title
no: Opprett detaljvisningen for symboler
vi: Tạo ra chế độ xem chi tiết cho các ký hiệu

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Paragraph14
no: Finn ut hvordan du oppretter en bildevisning som bruker et [SF-symbol](https://developer.apple.com/sf-symbols/).
vi: Tìm hiểu cách tạo ra một chế độ xem hình ảnh sử dụng [Ký hiệu SF](https://developer.apple.com/sf-symbols/).

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page4..Paragraph15
no: Før du begynner med `SymbolGrid`, må du lære hvordan du oppretter et bilde ved hjelp av en `Symbol`-verdi.
vi: Trước khi đi sâu vào `SymbolGrid`, trước tiên bạn sẽ tìm hiểu cách tạo ra một hình ảnh bằng một giá trị `Symbol`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page4..Paragraph16
no: `SymbolDetail` bruker [egenskapen](glossary://property) `symbol` til å opprette en detaljert visning av symbolet, komplett med en tekstbeskrivelse og et bilde.
vi: `SymbolDetail` sử dụng [thuộc tính](glossary://property) `symbol` để tạo ra một chế độ xem chi tiết của biểu tượng, hoàn chỉnh với mô tả bằng văn bản và một hình ảnh.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page5..Paragraph17
no: Det er flere måter å opprette en [Image](doc://com.apple.documentation/documentation/swiftui/image/) på i SwiftUI. Én måte er å bruke [parameteren](glossary://parameter) `systemName`, som oppretter et bilde ved hjelp av SF-symbolet som er assosiert med [strengen](glossary://String) som sendes.
vi: Có nhiều cách để tạo ra một [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image/) trong SwiftUI. Một trong những cách đó là sử dụng [tham số](glossary://parameter) `systemName`, tạo ra một hình ảnh bằng Ký hiệu SF được liên kết với [chuỗi](glossary://String) được chuyển vào.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page5..Paragraph18
no: Legg til følgende kode i `VStack` for å opprette et bilde ved hjelp av symbolets navn:
vi: Thêm mã sau đây bên trong `VStack` để tạo ra một hình ảnh bằng tên của ký hiệu:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page5..CodeBlock0
no: Image(systemName: symbol.name)
vi: Image(systemName: symbol.name)

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page6..Paragraph19
no: Gratulerer! Nå har du opprettet et bilde ved hjelp av et SF-symbol. Men det er veldig lite. 🔎
vi: Chúc mừng bạn đã tạo ra một hình ảnh bằng Ký hiệu SF! Nhưng hình ảnh đó quá nhỏ. 🔎

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page6..Paragraph20
no: Når du har opprettet bildevisningen, kan du bruke [modifikatorer](glossary://modifier) til å endre hvordan visningen ser ut og oppfører seg. Modifikatorer i SwiftUI er [metoder](glossary://method) som du bruker til å forandre utseendet i en visning. Du kan bruke flere modifikatorer i en visning ved å legge dem etter hverandre, men på hver sin linje for å gjøre det enklere å lese koden. Du kan endre visningens utseende ved hjelp av de samme modifikatorene, avhengig av hvilken rekkefølge du velger.
vi: Sau khi tạo ra chế độ xem hình ảnh, bạn có thể sử dụng các [trình sửa đổi](glossary://modifier) để thay đổi hình thức và hoạt động của chế độ xem. Trình sửa đổi trong SwiftUI là các [phương thức](glossary://method) mà bạn sử dụng để sửa đổi giao diện của một chế độ xem. Bạn có thể áp dụng nhiều trình sửa đổi cho một chế độ xem, móc nối chúng với nhau, nhưng được sắp xếp trên các dòng riêng biệt trong mã của bạn để làm cho mã dễ đọc hơn. Bạn có thể thay đổi giao diện của chế độ xem bằng cùng các trình sửa đổi, tùy theo cách bạn sắp xếp chúng.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page6..Paragraph21
no: Legg til disse modifikatorene under `Image`-visningen for å gjøre den større, og for å kunne angi valg for farge og utseende:
vi: Thêm những trình sửa đổi này bên dưới chế độ xem `Image` của bạn để tăng tỷ lệ của hình ảnh và cung cấp một số tùy chọn cho màu và giao diện:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page6..CodeBlock1
no: .resizable() .scaledToFit() .symbolRenderingMode(.hierarchical) .foregroundColor(.accentColor)
vi: .resizable() .scaledToFit() .symbolRenderingMode(.hierarchical) .foregroundColor(.accentColor)

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page7..Paragraph22
no: Mye bedre!
vi: Tốt hơn rồi!

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page7..Paragraph23
no: Du kan eksperimentere med å endre modifikatorene `.foregroundColor` eller `.symbolRenderingMode` for å se hvordan forhåndsvisningen endres.
vi: Như một phần của thử nghiệm, hãy thử thay đổi các trình sửa đổi `.foregroundColor` hoặc `.symbolRenderingMode` để xem bản xem trước thay đổi như thế nào.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page8..Paragraph24
no: Nå skal du få en utfordring. Prøv å legge til en `Text`-visning over `Image` som viser symbolets navn.
vi: Bây giờ là một thử thách: thử thêm một chế độ xem `Text` phía trên `Image` hiển thị tên của ký hiệu.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page8..Paragraph25
no: Prøv å finne ut av det selv. Du kan bruke denne koden hvis du står fast:
vi: Hãy xem liệu bạn có thể tìm ra phần này không, sử dụng mã sau đây nếu bạn bị vướng mắc:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page8..CodeBlock2
no: Text(symbol.name)
vi: Text(symbol.name)

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page9..Paragraph26
no: Legg til `font`-modifikatoren i `Text`-visningen, og gjør den større. Nå passer den bedre sammen med bildet!
vi: Thêm trình sửa đổi `font` vào chế độ xem `Text` của bạn và cung cấp một kích cỡ lớn hơn. Bây giờ, văn bản đã phù hợp hơn với hình ảnh!

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page9..CodeBlock3
no: .font(.largeTitle)
vi: .font(.largeTitle)

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page10..Paragraph27
no: Hvis du vil prøve å forhåndsvise et annet symbol her, går du til `Details_Previews`-strukturen nederst i denne filen og endrer `Symbol` som sendes til `SymbolDetail`.
vi: Nếu bạn muốn thử xem trước một ký hiệu khác tại đây, hãy đi tới cấu trúc `Details_Previews` ở cuối tệp này và thay đổi `Symbol` được chuyển vào `SymbolDetail`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page10..Paragraph28
no: Prøv å bytte den ut for å se et annet symbol i forhåndsvisningen:
vi: Thử thay thế để xem một ký hiệu khác trong bản xem trước:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup0..TaskitemDetails..Page10..CodeBlock4
no: Symbol(name: "brain.head.profile")
vi: Symbol(name: "brain.head.profile")

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..title
no: Opprett rutenettet
vi: Tạo ra lưới

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..title
no: Bygg navigeringsrutenettet
vi: Xây dựng lưới điều hướng

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Paragraph29
no: Opprett et rutenett med SF-symboler fra en [matrise](glossary://array) av `Symbol`-verdier.
vi: Tạo ra một lưới các Ký hiệu SF từ một [dãy](glossary://array) các giá trị `Symbol`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page11..Paragraph30
no: Når du oppretter rutenettet med SF-symboler, bruker du [egenskapen](glossary://property) `symbols`. Den sporer en samling med `Symbol`-instanser.
vi: Để tạo ra lưới Ký hiệu SF, bạn sẽ sử dụng [thuộc tính](glossary://property) `symbols`, theo dõi một tập hợp các thể hiển `Symbol`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page11..Paragraph31
no: Når du merker denne egenskapen med `@State`, håndterer SwiftUI lagringen for verdien. Når denne [statusegenskapen](glossary://state%20property) endres, vil SwiftUI oppdatere visningene som bruker verdien (i dette tilfellet rutenettet). Hvis du for eksempel sletter et symbol, vil det tilsvarende symbolbildet forsvinne fra rutenettet.
vi: Khi bạn đánh dấu thuộc tính này với `@State`, SwiftUI quản lý việc lưu trữ cho giá trị. Bất kỳ lúc nào [thuộc tính trạng thái](glossary://state%20property) này thay đổi, SwiftUI cập nhật bất kỳ chế độ xem nào đang sử dụng giá trị đó (trong trường hợp này là lưới). Ví dụ: nếu bạn xóa một ký hiệu thì hình ảnh ký hiệu tương ứng biến mất khỏi lưới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page12..Paragraph32
no: Du kan finne og legge til flere SF-symboler ved å [laste ned appen SF-symboler](https://developer.apple.com/sf-symbols/) og legge til nye `Symbol`-instanser med navnet på det ønskede symbolet.
vi: Để tìm và thêm các Ký hiệu SF bổ sung, hãy [tải về ứng dụng Ký hiệu SF](https://developer.apple.com/sf-symbols/) và thêm các thể hiện `Symbol` mới với tên ký hiệu mong muốn.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page12..CodeBlock5
no: Symbol(name: "moon.stars"),
vi: Symbol(name: "moon.stars"),

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page13..Paragraph33
no: Du oppretter et rutenett ved å bruke en [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid), overføre `gridColumns`-verdien og angi et innledende antall fleksible `GridItem`-instanser i hver rad. Endre verdien for `initialColumns` for å begynne med et annet antall kolonner.
vi: Để tạo ra một lưới, hãy sử dụng một [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid) và chuyển vào giá trị `gridColumns`, chỉ định số lượng thể hiện `GridItem` linh hoạt ban đầu trong mỗi hàng. Thay đổi giá trị cho `initialColumns` để bắt đầu với một số lượng cột khác.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page13..Paragraph34
no: Nøst `LazyVGrid` i en [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview), slik at andre kan rulle gjennom innholdet i rutenettet hvis det overskrider den vertikale plassen i rutenettvisningen.
vi: Lồng `LazyVGrid` bên trong một [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview), sao cho mọi người có thể cuộn qua nội dung của lưới nếu vượt quá không gian chiều dọc của chế độ xem lưới.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page14..Paragraph35
no: `ForEach` krever vanligvis at du oppgir en ID for hvert element i samlingen, slik at den kan spore når konkrete elementer i samlingen endres. `ForEach` fungerer best med en [samling](glossary://collection) av [Identifiable](doc://com.apple.documentation/documentation/swift/identifiable)-typer, for eksempel `Symbol`, slik at den kan spore hvert objekt i samlingen og oppdatere en konkret visning når objektets verdi endres.
vi: `ForEach` thường yêu cầu bạn cung cấp một ID cho từng phần tử của tập hợp để có thể theo dõi thời điểm các phần tử cụ thể trong tập hợp thay đổi. `ForEach` hoạt động tốt nhất với một [tập hợp](glossary://collection) các kiểu [Identifiable](doc://com.apple.documentation/documentation/swift/identifiable), ví dụ như `Symbol`, để có thể theo dõi từng mục trong tập hợp và cập nhật một chế độ xem cụ thể khi giá trị của mục đó thay đổi.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup1..TasksymbolGrid..Page15..Paragraph36
no: Etter `ForEach` oppretter du `Image`-visninger for hvert symbol i rutenettet. Opprett `Image`-visningen ved hjelp av symbolets navn, akkurat som i `SymbolDetail`.
vi: Sau `ForEach`, bạn sẽ tạo ra các chế độ xem `Image` cho từng ký hiệu trong lưới. Tạo ra chế độ xem `Image` bằng tên của ký hiệu, giống như trong `SymbolDetail`.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..title
no: Legge til navigering
vi: Thêm chức năng điều hướng

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..title
no: Opprett navigeringsstabelen for appen din
vi: Tạo ra ngăn xếp điều hướng cho ứng dụng của bạn

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Paragraph37
no: Pakk `SymbolGrid` i en `NavigationStack` for å gjøre det mulig å navigere til forskjellige visninger.
vi: Đóng gói `SymbolGrid` của bạn trong một `NavigationStack` để cho phép điều hướng đến các chế độ xem khác.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page16..Paragraph38
no: Hadde det ikke vært praktisk hvis symbolets `SymbolDetail`-visning vises hver gang du trykker på et symbol? For at det skal fungere, trenger du navigering.
vi: Sẽ thật tuyệt nếu việc chạm vào một ký hiệu đưa bạn đến chế độ xem `SymbolDetail` tương ứng phải không? Đối với việc này, bạn sẽ cần điều hướng.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page16..Paragraph39
no: Det er flere måter å håndtere navigasjon i appen på. Du kan bruke en [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) hvis du vil vise innhold i flere kolonner, eller en [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) for å vise innhold som én stabel, der du skyver en visning over stabelen når den skal vises.
vi: Có nhiều cách để quản lý điều hướng trong ứng dụng của bạn. Bạn có thể sử dụng [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) nếu muốn trình bày nội dung trong nhiều cột hoặc [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) để hiển thị nội dung dưới dạng một ngăn xếp đơn nhất, là nơi mà bạn đẩy một chế độ xem lên trên cùng của ngăn xếp đó khi cần hiển thị.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page17..Paragraph40
no: Du legger til navigeringsfunksjoner i appen ved å bruke opprette en [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) som [toppnivåvisning](glossary://top-level%20view). `NavigationStack` fungerer som en [beholder](glossary://container) som viser andre visninger.
vi: Để cung cấp chức năng điều hướng trong ứng dụng của bạn, hãy tạo ra một [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) dưới dạng [chế độ xem cấp cao nhất](glossary://top-level%20view). `NavigationStack` đóng vai trò như một [bộ chứa](glossary://container) hiển thị các chế độ xem khác.

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page17..Paragraph41
no: Legg til en `NavigationStack` i `WindowGroup`:
vi: Thêm một `NavigationStack` bên trong `WindowGroup`:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page17..CodeBlock6
no: NavigationStack { }
vi: NavigationStack { }

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page18..Paragraph42
no: Deretter oppgir du visningen som navigeringsstabelen skal vise når appen åpnes. Det gjør du ved å klippe ut og lime inn `SymbolGrid()` som innhold i `NavigationStack`:
vi: Tiếp theo, hãy cung cấp chế độ xem mà bạn muốn ngăn xếp điều hướng hiển thị khi ứng dụng khởi chạy lần đầu tiên. Để thực hiện việc này, hãy cắt và dán `SymbolGrid()` dưới dạng nội dung bên trong `NavigationStack`:

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page18..CodeBlock7
no: NavigationStack { SymbolGrid() }
vi: NavigationStack { SymbolGrid() }

source: GuideBook..Guide0..StepEditing Grids..TaskGroup2..TasksymbolGridApp..Page18..Paragraph43
no: Når en bruker navigerer til en annen visning, flyttes `SymbolGrid` ned i navigeringsstabelen og skyver opp en annen visning for å vise innholdet i den.
vi: Khi một người sử dụng ứng dụng của bạn điều hướng đến một chế độ xem khác, `SymbolGrid` di chuyển xuống dưới của ngăn xếp điều hướng, đẩy một chế độ xem khác lên để hiển thị nội dung.
